module.exports = {

    "加": {
        "参数": {
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": "左边的运算量，可以是结果为数字或矢量的值。"
            },
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": "右边的运算量，可以是结果为数字或矢量的值。"
            }
        },
        "返回": ["数字", "矢量"],
        "标签": ["条件", "数学运算", "矢量运算"],
        "提示": "两个数字或矢量的和。"
    },

    "减": {
        "参数": {
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": "左边的运算量，可以是结果为数字或矢量的值。"
            },
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": "右边的运算量，可以是结果为数字或矢量的值。"
            }
        },
        "返回": ["数字", "矢量"],
        "标签": ["条件", "数学运算", "矢量运算"],
        "提示": "两个数字或矢量的差"
    },

    "乘": {
        "参数": {
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": "左边的运算量，可以是结果为数字或矢量的值。"
            },
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": "右边的运算量，可以是结果为数字或矢量的值。"
            }
        },
        "返回": ["数字", "矢量"],
        "标签": ["条件", "数学运算", "矢量运算"],
        "提示": "两个数字或矢量的积。矢量乘以数字会得到一个缩放后的矢量。"
    },

    "除": {
        "参数": {
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": "左边的运算量，可以是结果为数字或矢量的值。"
            },
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": "右边的运算量，可以是结果为数字或矢量的值。"
            }
        },
        "返回": ["数字", "矢量"],
        "标签": ["条件", "数学运算", "矢量运算"],
        "提示": "两个数字或矢量的商。矢量除以数字会得到一个缩放后的矢量。除以零的结果为0。"
    },

    "乘方": {
        "返回": ["数字"],
        "标签": ["条件", "数学运算"],
        "提示": "左边运算量的乘方，幂为右边运算量。如果左边运算量为负，则结果始终为0。"
    },

    "余数": {
        "返回": ["数字"],
        "标签": ["条件", "数学运算"],
        "提示": "左边的运算量除以右边的运算量之后的余数。如果右边是0的话则结果为0。"
    },

    "非": {
        "参数": {
            "值": {
                "类型": "条件",
                "默认": "真",
                "提示": "如果输入为“假”（或等效于“假”），则“非”值为“真”。否则，则“非”值为“假”。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "布尔运算"],
        "提示": "返回输入的布尔的相反值。"
    },

    "与": {
        "参数": {
            "值": {
                "类型": "条件",
                "默认": "真",
                "提示": "考察的两个输入值中的一个。如果两个值均为“真”（或等效于“真”），则“与”的值为“真”。"
            },
            "值": {
                "类型": "条件",
                "默认": "真",
                "提示": "考察的两个输入值中的一个。如果两个值均为“真”（或等效于“真”），则“与”的值为“真”。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "布尔运算"],
        "提示": "两个输入值是否都为“真”（或等效于“真”）。"
    },

    "或": {
        "参数": {
            "值": {
                "类型": "条件",
                "默认": "真",
                "提示": "考察的两个输入值中的一个。如果两个值中有一个为“真”（或等效于“真”），则“或”的值为“真”。"
            },
            "值": {
                "类型": "条件",
                "默认": "真",
                "提示": "考察的两个输入值中的一个。如果两个值中有一个为“真”（或等效于“真”），则“或”的值为“真”。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "布尔运算"],
        "提示": "两个输入值是否都为“真”（或等效于“真”）。"
    },

    "If-Then-Else": {
        "参数": {
            "If": {
                "类型": "条件",
                "默认": "真",
                "提示": "如果此条件为真，则结果为Then后面的值。否则结果为Else后面的值。"
            },
            "Then": {
                "类型": "条件",
                "默认": "0",
                "提示": "如果条件为真，则结果是这个值。"
            },
            "Else": {
                "类型": "条件",
                "默认": "0",
                "提示": "如果条件不为真，则结果是这个值。"
            }
        },
        "返回": ["条件"],
        "标签": ["条件", "流程控制"],
        "提示": "如果If后面的条件为真，则结果为Then后面的值。否则结果为Else后面的值。"
    },

    "数字": {
        "参数": {
            "数字": {
                "类型": "数字",
                "默认": "0",
                "提示": "一个数字选项。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "数字"],
        "提示": "一个数字常量。"
    },
    
    "比较": {
        "参数": {
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": "比较式的左边。如果操作为“==”或“!=”，则可以为任意类型的值。否则此值应为实数。"
            },
            "比较": {
                "类型": "比较",
                "默认": "==",
                "提示": "比较式的中间符号。表示两个值的比较关系。"
            },
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": "比较式的右边。如果操作为“==”或“!=”，则可以为任意类型的值。否则此值应为实数。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "布尔运算"],
        "提示": "比较输入的两个值的结果，如果相等则为“真”反之为“假”。"
    },

    "=": {
        "标签": ["变量赋值符号"],
        "提示": "一个变量赋值符号。"
    },

    "!": {
        "标签": ["布尔运算符号"],
        "提示": "一个布尔运算符号。"
    },
    
    "||": {
        "标签": ["布尔运算符号"],
        "提示": "一个布尔运算符号。"
    },
    
    "&&": {
        "标签": ["布尔运算符号"],
        "提示": "一个布尔运算符号。"
    },

    "+": {
        "标签": ["数学运算符号"],
        "提示": "一个数学运算符号。"
    },
    
    "-": {
        "标签": ["数学运算符号"],
        "提示": "一个数学运算符号。"
    },
    
    "*": {
        "标签": ["数学运算符号"],
        "提示": "一个数学运算符号。"
    },
    
    "/": {
        "标签": ["数学运算符号"],
        "提示": "一个数学运算符号。"
    },
    
    "%": {
        "标签": ["数学运算符号"],
        "提示": "一个数学运算符号。"
    },
    
    "^": {
        "标签": ["数学运算符号"],
        "提示": "一个数学运算符号。"
    },

    "==": {
        "标签": ["比较"],
        "提示": "比较输入的两个值的结果，如果相等则为“真”反之为“假”。"
    },

    "!=": {
        "标签": ["比较"],
        "提示": "比较输入的两个值的结果，如果不等则为“真”反之为“假”。"
    },

    "<=": {
        "标签": ["比较"],
        "提示": "比较输入的两个值的结果，如果第一个值小于等于第二个值则为“真”反之为“假”。"
    },

    ">=": {
        "标签": ["比较"],
        "提示": "比较输入的两个值的结果，如果第一个值大于等于第二个值则为“真”反之为“假”。"
    },

    "<": {
        "标签": ["比较"],
        "提示": "比较输入的两个值的结果，如果第一个值小于第二个值则为“真”反之为“假”。"
    },

    ">": {
        "标签": ["比较"],
        "提示": "比较输入的两个值的结果，如果第一个值大于第二个值则为“真”反之为“假”。"
    },

    "+=": {
        "标签": ["变量修改符号"],
        "提示": "一个变量修改符号。"
    },
    
    "-=": {
        "标签": ["变量修改符号"],
        "提示": "一个变量修改符号。"
    },
    
    "*=": {
        "标签": ["变量修改符号"],
        "提示": "一个变量修改符号。"
    },
    
    "/=": {
        "标签": ["变量修改符号"],
        "提示": "一个变量修改符号。"
    },
    
    "%=": {
        "标签": ["变量修改符号"],
        "提示": "一个变量修改符号。"
    },
    
    "^=": {
        "标签": ["变量修改符号"],
        "提示": "一个变量修改符号。"
    },

    "设置全局变量": {
        "参数": {
            "变量": {
                "类型": "变量",
                "默认": "A",
                "提示": "指定将值存储哪个全局变量。"
            },
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": "此值将被存储。"
            }
        },
        "标签": ["行动"],
        "提示": "将一个值存储为一个全局变量，全局变量即属于游戏本身的变量。"
    },

    "设置玩家变量": {
        "参数": {
            "变量": {
                "类型": "变量",
                "默认": "A",
                "提示": "指定将值存储为玩家的哪些变量。"
            },
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": "此值将被存储。"
            }
        },
        "标签": ["行动"],
        "提示": "将一个值存储为一个玩家变量，玩家变量即属于一个特定玩家的变量。"
    },

    "修改全局变量": {
        "参数": {
            "变量": {
                "类型": "变量",
                "默认": "A",
                "提示": "要修改的全局变量。"
            },
            "操作": {
                "类型": "变量操作选项",
                "默认": "加",
                "提示": "变量的值改变的方式。选项包括标准运算操作，以及数组操作（如添加或移除值）。"
            },
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": "用于修改的值。若要进行运算操作，则此值为两个运算量中的第二个，第一个运算量为变量当前的值。若要进行数组操作，则此值是用于添加或移除的值。"
            }
        },
        "标签": ["行动"],
        "提示": "修改一个全局变量的值，全局变量即属于游戏本身的变量。"
    },

    "修改玩家变量": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "此玩家的变量将被修改。如果有多个玩家，则每个玩家的变量都将被设置。"
            },
            "变量": {
                "类型": "变量",
                "默认": "A",
                "提示": "指定修改此玩家的哪些变量。"
            },
            "操作": {
                "类型": "变量操作选项",
                "默认": "加",
                "提示": "变量的值改变的方式。选项包括标准运算操作，以及数组操作（如添加或移除值）。"
            },
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": "用于修改的值。若要进行运算操作，则此值为两个运算量中的第二个，第一个运算量为变量当前的值。若要进行数组操作，则此值是用于添加或移除的值。"
            }
        },
        "标签": ["行动"],
        "提示": "修改一个玩家变量的值，玩家变量即属于一个特定玩家的变量。"
    },

    "在索引处修改全局变量": {
        "参数": {
            "变量": {
                "类型": "变量",
                "默认": "A",
                "提示": "要修改的全局变量。"
            },
            "索引": {
                "类型": "条件",
                "默认": "0",
                "提示": "修改数组的索引。如果索引位置已经超过了数组的末尾，则将数组延伸至索引位置，且新的元素值均为0。"
            },
            "操作": {
                "类型": "变量操作选项",
                "默认": "添加至数组",
                "提示": "变量的值改变的方式。选项包括标准运算操作，以及数组操作（如添加或移除值）。"
            },
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": "用于修改的值。若要进行运算操作，则此值为两个运算量中的第二个，第一个运算量为变量当前的值。若要进行数组操作，则此值是用于添加或移除的值。"
            }
        },
        "标签": ["行动"],
        "提示": "修改索引处一个全局变量的值，全局变量即属于游戏本身的变量。"
    },

    "在索引处修改玩家变量": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "此玩家的变量将被修改。如果有多个玩家，则每个玩家的变量都将被设置。"
            },
            "变量": {
                "类型": "变量",
                "默认": "A",
                "提示": "指定修改此玩家的哪些变量。"
            },
            "索引": {
                "类型": "条件",
                "默认": "0",
                "提示": "修改数组的索引。如果索引位置已经超过了数组的末尾，则将数组延伸至索引位置，且新的元素值均为0。"
            },
            "操作": {
                "类型": "变量操作选项",
                "默认": "添加至数组",
                "提示": "变量的值改变的方式。选项包括标准运算操作，以及数组操作（如添加或移除值）。"
            },
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": "用于修改的值。若要进行运算操作，则此值为两个运算量中的第二个，第一个运算量为变量当前的值。若要进行数组操作，则此值是用于添加或移除的值。"
            }
        },
        "标签": ["行动"],
        "提示": "修改索引处一个玩家变量的值，玩家变量即属于一个特定玩家的变量。"
    },

    "在索引处设置全局变量": {
        "参数": {
            "变量": {
                "类型": "变量",
                "默认": "A",
                "提示": "指定哪个全局变量的值是要修改的数组。如果变量的值不是一个数组，则使其值变为一个空的数组。"
            },
            "索引": {
                "类型": "条件",
                "默认": "0",
                "提示": "修改数组的索引。如果索引位置已经超过了数组的末尾，则将数组延伸至索引位置，且新的元素值均为0。"
            },
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": "将此值存储到数组中。"
            }
        },
        "标签": ["行动"],
        "提示": "为一个全局变量寻找或创建一个数组，然后将一个值储存至指定的索引中。全局变量即属于游戏本身的变量。"
    },

    "在索引处设置玩家变量": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "此玩家的变量将被修改。如果有多个玩家，则每个玩家的变量都将被设置。"
            },
            "变量": {
                "类型": "变量",
                "默认": "A",
                "提示": "指定哪个玩家变量的值是要修改的数组。如果变量的值不是一个数组，则使其值变为一个空的数组。"
            },
            "索引": {
                "类型": "条件",
                "默认": "0",
                "提示": "修改数组的索引。如果索引位置已经超过了数组的末尾，则将数组延伸至索引位置，且新的元素值均为0。"
            },
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": "将此值存储到数组中。"
            }
        },
        "标签": ["行动"],
        "提示": "为一个玩家变量寻找或创建一个数组，然后将一个值储存至指定的索引处。玩家变量即属于一个特定玩家的变量。"
    },
    
    "全局变量": {
        "参数": {
            "变量": {
                "类型": "变量",
                "默认": "A",
                "提示": "获取此变量的值。"
            }
        },
        "返回": ["变量"],
        "标签": ["条件", "全局"],
        "提示": "一个全局变量的当前值，全局变量即属于游戏本身的变量。"
    },

    "玩家变量": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家的变量值。"
            },
            "变量": {
                "类型": "变量",
                "默认": "A",
                "提示": "获取此变量的值。"
            }
        },
        "返回": ["变量"],
        "标签": ["条件", "玩家"],
        "提示": "一个玩家变量当前的值，玩家变量即属于一个特定玩家的变量。"
    },
}