const MAP = {
  地图: [
    {
      名称: "阿育陀耶",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "黑森林",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "圣诞节黑森林",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "暴雪世界",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "圣诞节暴雪世界",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "釜山",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "春节釜山城区",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "春节釜山寺院",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "城堡",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "吉拉德堡",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "万圣节吉拉德堡",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "皇家赛道",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "斗兽场",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "多拉多",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "生态监测站：南极洲",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "圣诞节生态监测站：南极洲",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "艾兴瓦尔德",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "万圣节艾兴瓦尔德",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "埃斯佩兰萨",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "花村",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "圣诞节花村",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "哈瓦那",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "好莱坞",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "万圣节好莱坞",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "“地平线”月球基地",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "伊利奥斯",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "伊利奥斯灯塔",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "伊利奥斯废墟",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "伊利奥斯深井",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "怪鼠复仇",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "渣客镇",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "铁坂",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "国王大道",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "圣诞节国王大道",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "漓江塔控制中心",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "春节漓江塔控制中心",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "漓江塔庭院",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "春节漓江塔庭院",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "漓江塔夜市",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "春节漓江塔夜市",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "漓江塔",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "春节漓江塔",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "马莱温多",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "中城",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "墓园",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "尼泊尔",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "尼泊尔圣所",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "尼泊尔圣坛",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "尼泊尔村庄",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "圣诞节尼泊尔村庄",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "新皇后街",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "努巴尼",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "绿洲城",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "绿洲城中心",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "绿洲城花园",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "绿洲城大学",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "帕拉伊苏",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "巴黎",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "佩特拉",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "训练靶场",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "里阿尔托",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "66号公路",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "阿努比斯神殿",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "沃斯卡娅工业区",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "监测站：直布罗陀",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "地图工坊室内",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "地图工坊空地",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "地图工坊空地（夜间）",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "地图工坊绿幕",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "地图工坊岛屿",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "地图工坊岛屿（夜间）",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "香巴里寺院",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "爪兰蒂斯",
      标签: ["地图"],
      提示: "一张地图。",
    },
  ],
};
