const vscode = require("vscode");
const path = require("path");

let 拼音 = {
  阿: "AE",
  啊: "EA",
  埃: "ZhiAi",
  艾: "YiAi",
  碍: "Ai",
  安: "An",
  按: "An",
  昂: "YangAng",
  奥: "YouAoYu",
  巴: "Ba",
  靶: "Ba",
  霸: "PoBa",
  吧: "PaBa",
  白: "BoBai",
  百: "MoBaiBo",
  败: "Bai",
  坂: "Ban",
  板: "Ban",
  半: "PanBan",
  帮: "Bang",
  绑: "Bang",
  棒: "Bang",
  包: "PaoBaoFu",
  保: "Bao",
  堡: "PuBuBao",
  报: "Bao",
  抱: "PouPaoBao",
  暴: "BoPuBao",
  爆: "BoBao",
  北: "Bei",
  备: "Bei",
  背: "Bei",
  被: "BeiPiBi",
  本: "Ben",
  比: "BiPi",
  币: "YinBi",
  闭: "Bi",
  蔽: "BiePieBi",
  壁: "Bi",
  避: "Bi",
  边: "Bian",
  变: "Bian",
  标: "Biao",
  镖: "Biao",
  表: "Biao",
  别: "Bie",
  冰: "BingNing",
  兵: "Bing",
  并: "Bing",
  播: "Bo",
  不: "BuFuFou",
  布: "Bu",
  部: "BuPou",
  材: "Cai",
  参: "CenShenCan",
  藏: "ZangCang",
  操: "Cao",
  测: "Ce",
  查: "ZhaChaChai",
  差: "ChaiJieChaCiCuo",
  禅: "ChanShan",
  尝: "Chang",
  场: "Chang",
  超: "ChaoTiao",
  朝: "ZhuChaoZhao",
  撤: "Che",
  沉: "Chen",
  称: "ChengChen",
  成: "Cheng",
  承: "ChengZheng",
  城: "Cheng",
  乘: "ChengSheng",
  程: "Cheng",
  橙: "ChenChengDeng",
  池: "CheChiTuo",
  持: "Chi",
  充: "Chong",
  冲: "Chong",
  宠: "Chong",
  抽: "Chou",
  仇: "JuQiuChou",
  出: "Chu",
  初: "Chu",
  除: "ShuZhuChu",
  处: "Chu",
  触: "Chu",
  传: "ZhuanChuan",
  串: "ChuanGuanQuan",
  创: "Chuang",
  垂: "ZhuiChui",
  锤: "Chui",
  春: "Chun",
  磁: "Ci",
  此: "Ci",
  次: "CiZi",
  从: "Cong",
  摧: "CuiCuoZui",
  村: "Cun",
  存: "Cun",
  错: "Cuo",
  达: "TiTaDa",
  打: "Da",
  大: "TaiDaDai",
  带: "Dai",
  待: "Dai",
  单: "ShanChanDan",
  诞: "Dan",
  弹: "TanDan",
  当: "Dang",
  挡: "Dang",
  荡: "Dang",
  岛: "Dao",
  到: "Dao",
  倒: "Dao",
  道: "Dao",
  得: "DeiDe",
  德: "De",
  地: "DeDi",
  的: "DiDe",
  灯: "DengDing",
  等: "Deng",
  迪: "Di",
  敌: "DiHua",
  抵: "QiZhiDi",
  蒂: "Di",
  典: "DianTian",
  点: "Dian",
  电: "Dian",
  店: "Dian",
  殿: "Dian",
  调: "DiaoTiao",
  掉: "NuoDiao",
  跌: "DieTu",
  顶: "Ding",
  定: "Ding",
  东: "Dong",
  动: "Dong",
  冻: "Dong",
  斗: "ZhuDou",
  毒: "DuDai",
  独: "Du",
  读: "DuDou",
  度: "ZhaiDuDuo",
  端: "Duan",
  段: "Duan",
  断: "Duan",
  堆: "ZuiDui",
  队: "Dui",
  对: "Dui",
  蹲: "ZunCuanDunQunCun",
  盾: "ShunDunYun",
  顿: "DuDun",
  多: "Duo",
  夺: "Duo",
  朵: "Duo",
  躲: "Duo",
  呃: "AiE",
  恩: "En",
  儿: "RenEr",
  尔: "Er",
  饵: "Er",
  发: "Fa",
  法: "Fa",
  反: "Fan",
  返: "Fan",
  范: "Fan",
  方: "FangWangFengPang",
  坊: "Fang",
  防: "Fang",
  放: "Fang",
  飞: "Fei",
  非: "Fei",
  废: "Fei",
  分: "FenBan",
  峰: "Feng",
  锋: "Feng",
  否: "PiFou",
  孵: "Fu",
  弗: "Fu",
  服: "FuBiBo",
  符: "Fu",
  幅: "BiFu",
  辐: "Fu",
  釜: "Fu",
  辅: "Fu",
  腐: "Fu",
  负: "Fu",
  附: "BuFu",
  复: "Fu",
  赋: "Fu",
  改: "Gai",
  赶: "QianGan",
  感: "GanHan",
  干: "GanAn",
  港: "HongGang",
  高: "Gao",
  告: "GaoJuGu",
  割: "Ge",
  格: "LuoHeGe",
  个: "GeGan",
  根: "Gen",
  跟: "Gen",
  更: "Geng",
  工: "Gong",
  公: "Gong",
  功: "Gong",
  攻: "Gong",
  恭: "Gong",
  勾: "Gou",
  钩: "Gou",
  购: "Gou",
  怪: "Guai",
  关: "Guan",
  观: "Guan",
  管: "Guan",
  光: "Guang",
  归: "Gui",
  规: "Gui",
  诡: "Gui",
  国: "Guo",
  果: "LuoGuanGuo",
  过: "Guo",
  哈: "TaHaShaHe",
  海: "Hai",
  害: "HeHai",
  含: "Han",
  好: "Hao",
  号: "XiaoHao",
  耗: "HaoMao",
  合: "HeGe",
  和: "HuoHuHe",
  河: "He",
  黑: "Hei",
  红: "GongHong",
  后: "Hou",
  候: "Hou",
  弧: "Hu",
  互: "Hu",
  护: "Hu",
  花: "Hua",
  化: "HuaHuo",
  坏: "PeiPiHuai",
  欢: "Huan",
  环: "Huan",
  换: "Huan",
  皇: "HuangWang",
  黄: "Huang",
  灰: "Hui",
  恢: "Hui",
  回: "Hui",
  毁: "Hui",
  会: "HuiKuai",
  活: "HuoGuo",
  火: "Huo",
  或: "YuHuo",
  货: "Huo",
  获: "Huo",
  击: "Ji",
  圾: "JieJi",
  机: "JiWei",
  积: "JiZhi",
  基: "Ji",
  激: "JiJiao",
  及: "Ji",
  吉: "Ji",
  级: "Ji",
  即: "Ji",
  极: "Ji",
  急: "Ji",
  疾: "Ji",
  集: "Ji",
  计: "Ji",
  记: "Ji",
  技: "JiQi",
  际: "Ji",
  继: "Ji",
  加: "Jia",
  夹: "GaJia",
  佳: "Jia",
  枷: "Jia",
  家: "JiaGuJie",
  甲: "Jia",
  假: "JiaJieGeXia",
  价: "JieJia",
  间: "Jian",
  监: "Jian",
  减: "Jian",
  检: "Jian",
  见: "XianJian",
  件: "JianMou",
  建: "Jian",
  键: "Jian",
  箭: "Jian",
  江: "Jiang",
  将: "QiangJiang",
  奖: "Jiang",
  降: "JiangXiang",
  交: "Jiao",
  焦: "QiaoJiao",
  角: "JiaoGuLuJue",
  较: "Jiao",
  阶: "Jie",
  接: "XieShaJieCha",
  揭: "JieHeQi",
  街: "Jie",
  节: "Jie",
  杰: "Jie",
  结: "Jie",
  截: "Jie",
  解: "JieXie",
  戒: "Jie",
  界: "Jie",
  金: "Jin",
  尽: "Jin",
  锦: "Jin",
  近: "Jin",
  进: "Jin",
  禁: "Jin",
  经: "Jing",
  睛: "Jing",
  井: "Jing",
  阱: "Jing",
  警: "Jing",
  净: "JingCheng",
  径: "Jing",
  竞: "Jing",
  境: "Jing",
  镜: "Jing",
  救: "Jiu",
  就: "Jiu",
  局: "Ju",
  拒: "Ju",
  具: "Ju",
  剧: "Ju",
  据: "Ju",
  距: "Ju",
  聚: "Ju",
  决: "Jue",
  绝: "Jue",
  均: "YunJun",
  卡: "QiaKa",
  开: "Kai",
  看: "Kan",
  可: "KeGe",
  克: "Ke",
  客: "QiaKe",
  空: "Kong",
  控: "QiangKong",
  骷: "Ku",
  块: "KuaiYue",
  快: "Kuai",
  宽: "Kuan",
  狂: "JueKuang",
  扩: "Kuo",
  廓: "Kuo",
  垃: "La",
  拉: "La",
  来: "Lai",
  莱: "Lai",
  兰: "Lan",
  栏: "Lan",
  蓝: "LaLan",
  老: "Lao",
  乐: "LeYue",
  了: "LiaoLe",
  雷: "Lei",
  垒: "Lei",
  类: "Lei",
  冷: "LingLeng",
  离: "LiChi",
  漓: "Li",
  黎: "Li",
  里: "Li",
  力: "Li",
  立: "WeiLi",
  丽: "Li",
  利: "Li",
  励: "Li",
  莉: "ChiLi",
  粒: "Li",
  连: "Lian",
  练: "Lian",
  链: "Lian",
  亮: "Liang",
  量: "Liang",
  疗: "Liao",
  聊: "LiaoLiu",
  料: "Liao",
  烈: "Lie",
  猎: "QueXiLie",
  裂: "Lie",
  林: "Lin",
  灵: "Ling",
  领: "Ling",
  流: "Liu",
  榴: "Liu",
  髅: "Lou",
  卢: "Lu",
  陆: "LuLiu",
  录: "Lu",
  路: "LuoLu",
  率: "LvShuaiLve",
  绿: "LuLv",
  滤: "Lv",
  乱: "Luan",
  轮: "Lun",
  罗: "Luo",
  螺: "Luo",
  落: "LaLaoLuo",
  麻: "Ma",
  马: "Ma",
  玛: "Ma",
  买: "Mai",
  脉: "MaiMo",
  满: "Man",
  慢: "Man",
  玫: "Mei",
  梅: "Mei",
  每: "Mei",
  美: "Mei",
  魅: "Mei",
  盟: "MengMing",
  米: "Mi",
  面: "Mian",
  描: "MaoMiao",
  瞄: "Miao",
  秒: "Miao",
  灭: "Mie",
  名: "Ming",
  命: "Ming",
  模: "MuMo",
  末: "MeMo",
  莫: "MuMo",
  默: "Mo",
  目: "Mu",
  墓: "Mu",
  幕: "ManMu",
  嗯: "NgN",
  那: "NaNaiNuoNeiNe",
  纳: "Na",
  娜: "NaNuo",
  南: "NanNa",
  难: "Nan",
  内: "NeiRuiNa",
  能: "TaiXiongNengNai",
  尼: "Ni",
  你: "Ni",
  黏: "Nian",
  钮: "Niu",
  努: "Nu",
  怒: "Nu",
  女: "RuNv",
  噢: "OYuAo",
  哦: "EO",
  帕: "MoPa",
  排: "BaiPai",
  牌: "Pai",
  叛: "Pan",
  跑: "BoPao",
  炮: "BaoPao",
  佩: "Pei",
  喷: "Pen",
  碰: "Peng",
  批: "Pi",
  频: "Pin",
  品: "Pin",
  平: "PingBengBingPian",
  屏: "PingBing",
  泊: "BoPo",
  破: "Po",
  普: "Pu",
  漆: "QieQi",
  旗: "Qi",
  启: "Qi",
  起: "Qi",
  弃: "Qi",
  器: "Qi",
  前: "QianJian",
  钱: "Qian",
  歉: "Qian",
  枪: "Qiang",
  强: "JiangQiang",
  墙: "Qiang",
  巧: "Qiao",
  切: "QiQie",
  侵: "Qin",
  青: "JingQing",
  轻: "Qing",
  清: "Qing",
  情: "Qing",
  求: "Qiu",
  球: "Qiu",
  区: "QuOu",
  驱: "Qu",
  取: "Qu",
  去: "Qu",
  圈: "JuanQuan",
  全: "Quan",
  拳: "Quan",
  却: "Que",
  群: "Qun",
  燃: "Ran",
  扰: "YouRao",
  热: "Re",
  人: "Ren",
  认: "Ren",
  任: "LinRen",
  日: "Ri",
  融: "Rong",
  如: "Ru",
  入: "Ru",
  锐: "Rui",
  萨: "Sa",
  赛: "Sai",
  散: "San",
  色: "SeShai",
  森: "Sen",
  杀: "Sha",
  刹: "ChaSha",
  莎: "ShaSuoSui",
  山: "Shan",
  闪: "Shan",
  善: "Shan",
  伤: "Shang",
  商: "Shang",
  赏: "Shang",
  上: "Shang",
  烧: "Shao",
  少: "Shao",
  哨: "ShaoSaoXiao",
  设: "She",
  射: "SheYiYe",
  身: "ShenJuan",
  深: "Shen",
  什: "ShenShi",
  神: "Shen",
  升: "Sheng",
  生: "Sheng",
  声: "ShengQing",
  圣: "ShengKu",
  胜: "ShengQingXing",
  剩: "Sheng",
  失: "YiShi",
  施: "ShiYi",
  时: "Shi",
  实: "Shi",
  拾: "SheJieShi",
  矢: "Shi",
  使: "Shi",
  始: "Shi",
  士: "Shi",
  氏: "ShiZhiJing",
  世: "Shi",
  市: "ShiFu",
  示: "ZhiQiShi",
  式: "ShiTe",
  事: "ZiShi",
  势: "Shi",
  视: "Shi",
  试: "Shi",
  室: "Shi",
  是: "ShiTi",
  适: "ShiKuo",
  噬: "Shi",
  收: "Shou",
  手: "Shou",
  守: "Shou",
  首: "Shou",
  受: "ShouDao",
  狩: "Shou",
  兽: "Shou",
  售: "ShuShou",
  输: "Shu",
  鼠: "Shu",
  术: "ShuZhu",
  束: "Shu",
  述: "Shu",
  数: "ShuShuo",
  刷: "Shua",
  双: "Shuang",
  水: "Shui",
  睡: "Shui",
  瞬: "Shun",
  斯: "ShiSi",
  撕: "XiSi",
  死: "Si",
  寺: "ShiSi",
  送: "Song",
  苏: "Su",
  素: "Su",
  速: "Su",
  算: "Suan",
  随: "Sui",
  梭: "SuoXun",
  所: "Suo",
  索: "Suo",
  锁: "Suo",
  塔: "TaDa",
  胎: "Tai",
  台: "SiTaiYi",
  太: "TaTai",
  态: "Tai",
  坛: "Tan",
  坦: "Tan",
  叹: "YouYiTan",
  探: "XianTan",
  桃: "ZhaoTiaoTao",
  特: "Te",
  提: "ShiChiDiTi",
  体: "BenCuiTi",
  替: "Ti",
  天: "Tian",
  添: "Tian",
  填: "ChenZhenTian",
  挑: "TaoDiaoTiao",
  条: "Tiao",
  跳: "TiaoDiaoTao",
  铁: "Tie",
  厅: "Ting",
  庭: "Ting",
  停: "Ting",
  通: "Tong",
  头: "Tou",
  突: "Tu",
  图: "Tu",
  徒: "Tu",
  团: "QiuTuan",
  推: "Tui",
  退: "Tui",
  吞: "TianTun",
  托: "Tuo",
  陀: "TuoDuo",
  瓦: "Wa",
  哇: "HuaGuiWa",
  外: "Wai",
  完: "WanKuan",
  玩: "Wan",
  万: "MoWan",
  亡: "WangWu",
  王: "YuWang",
  往: "Wang",
  望: "Wang",
  危: "Wei",
  威: "Wei",
  微: "Wei",
  围: "Wei",
  维: "Wei",
  为: "Wei",
  未: "Wei",
  位: "WeiLi",
  温: "WenYun",
  文: "Wen",
  稳: "Wen",
  问: "Wen",
  涡: "GuoWo",
  我: "Wo",
  沃: "Wo",
  无: "MoWu",
  伍: "Wu",
  武: "Wu",
  务: "Wu",
  坞: "Wu",
  物: "Wu",
  误: "Wu",
  雾: "Wu",
  吸: "Xi",
  西: "Xi",
  息: "Xi",
  悉: "Xi",
  袭: "Xi",
  洗: "XiXian",
  喜: "ChiXi",
  戏: "HuXi",
  细: "Xi",
  下: "Xia",
  先: "Xian",
  弦: "Xian",
  显: "Xian",
  险: "Xian",
  现: "Xian",
  线: "Xian",
  限: "WenXian",
  陷: "Xian",
  相: "Xiang",
  香: "Xiang",
  箱: "Xiang",
  向: "Xiang",
  象: "Xiang",
  像: "Xiang",
  消: "Xiao",
  销: "Xiao",
  小: "Xiao",
  效: "Xiao",
  协: "Xie",
  胁: "Xie",
  携: "Xie",
  械: "Xie",
  谢: "Xie",
  心: "Xin",
  新: "Xin",
  信: "XinShen",
  星: "Xing",
  行: "XingHangHeng",
  形: "Xing",
  型: "Xing",
  兴: "Xing",
  姓: "XingSheng",
  性: "Xing",
  雄: "Xiong",
  修: "Xiu",
  秀: "Xiu",
  墟: "Xu",
  需: "RuNuoRuanXu",
  序: "Xu",
  绪: "Xu",
  续: "Xu",
  宣: "Xuan",
  旋: "Xuan",
  漩: "Xuan",
  选: "Xuan",
  眩: "HuanJuanXuan",
  学: "Xue",
  雪: "Xue",
  寻: "XunXin",
  循: "Xun",
  训: "Xun",
  雅: "Ya",
  娅: "Ya",
  呀: "XiaYa",
  烟: "YinYan",
  延: "Yan",
  严: "Yan",
  颜: "Yan",
  眼: "WenYan",
  验: "Yan",
  焰: "Yan",
  药: "Yao",
  要: "Yao",
  耶: "YeXie",
  野: "ShuYe",
  业: "Ye",
  夜: "Ye",
  一: "Yi",
  伊: "Yi",
  移: "YiChi",
  已: "SiYi",
  以: "SiYi",
  义: "Yi",
  易: "Yi",
  益: "Yi",
  意: "Yi",
  因: "Yin",
  音: "Yin",
  银: "Yin",
  引: "Yin",
  隐: "Yin",
  应: "Ying",
  英: "YingYang",
  鹰: "Ying",
  迎: "Ying",
  营: "Ying",
  影: "Ying",
  映: "YangYing",
  勇: "Yong",
  涌: "YongChong",
  用: "Yong",
  优: "You",
  幽: "You",
  游: "LiuYou",
  鱿: "You",
  友: "You",
  有: "YouWei",
  右: "You",
  诱: "You",
  于: "XuWeiYu",
  余: "TuXuYu",
  与: "Yu",
  屿: "Yu",
  语: "Yu",
  育: "YuZhouYo",
  预: "Yu",
  域: "Yu",
  阈: "Yu",
  御: "YaYu",
  元: "Yuan",
  园: "WanYuan",
  原: "Yuan",
  圆: "Yuan",
  援: "YuanHuan",
  源: "Yuan",
  远: "Yuan",
  院: "Yuan",
  月: "RuYue",
  跃: "Yue",
  晕: "Yun",
  云: "Yun",
  运: "Yun",
  再: "Zai",
  在: "Zai",
  载: "Zai",
  暂: "Zan",
  赞: "Zan",
  造: "CaoZao",
  则: "Ze",
  择: "ZhaiZe",
  增: "CengZeng",
  渣: "Zha",
  炸: "Zha",
  占: "TieZhan",
  战: "Zhan",
  站: "Zhan",
  长: "ZhangChang",
  障: "Zhang",
  爪: "ZhuaZhao",
  找: "ZhaoHua",
  罩: "Zhao",
  遮: "Zhe",
  者: "Zhe",
  这: "ZheZhei",
  着: "ZhuoZhaoZhe",
  真: "Zhen",
  阵: "Zhen",
  镇: "Zhen",
  震: "ShenZhen",
  整: "Zheng",
  正: "Zheng",
  帧: "Zheng",
  之: "ZhuZhi",
  支: "ZhiQi",
  知: "Zhi",
  直: "Zhi",
  值: "Zhi",
  止: "Zhi",
  指: "Zhi",
  至: "ZhiDie",
  志: "Zhi",
  制: "Zhi",
  帜: "Zhi",
  治: "ZhiChi",
  质: "Zhi",
  秩: "Zhi",
  智: "Zhi",
  置: "Zhi",
  中: "Zhong",
  终: "Zhong",
  衷: "Zhong",
  重: "TongZhongChong",
  洲: "Zhou",
  逐: "ZhouZhuDiTun",
  主: "Zhu",
  住: "Zhu",
  助: "ChuZhu",
  注: "ZhuZhou",
  柱: "Zhu",
  筑: "Zhu",
  抓: "Zhua",
  转: "ZhuanZhuai",
  庄: "PengZhuang",
  装: "Zhuang",
  状: "Zhuang",
  撞: "Zhuang",
  追: "TuiDuiZhui",
  锥: "Zhui",
  坠: "Zhui",
  准: "Zhun",
  资: "Zi",
  紫: "Zi",
  字: "Zi",
  自: "Zi",
  子: "Zi",
  踪: "Zong",
  总: "Zong",
  走: "Zou",
  阻: "ZuZhu",
  组: "Zu",
  最: "CuoZui",
  罪: "Zui",
  醉: "Zui",
  左: "Zuo",
  作: "Zuo",
  坐: "Zuo",
  做: "Zuo",
};

let 常量 = {
  按钮: [
    {
      名称: "技能1",
      标签: ["按钮"],
      提示: "绑定技能1的按钮。",
      图标: ["images/ow/input/button.png", "images/ow/input/gray/button.png"],
    },
    {
      名称: "技能2",
      标签: ["按钮"],
      提示: "绑定技能2的按钮。",
      图标: ["images/ow/input/button.png", "images/ow/input/gray/button.png"],
    },
    {
      名称: "蹲下",
      标签: ["按钮"],
      提示: "绑定蹲下的按钮。",
      图标: ["images/ow/input/button.png", "images/ow/input/gray/button.png"],
    },
    {
      名称: "互动",
      标签: ["按钮"],
      提示: "绑定互动的按钮。",
      图标: ["images/ow/input/button.png", "images/ow/input/gray/button.png"],
    },
    {
      名称: "跳跃",
      标签: ["按钮"],
      提示: "绑定跳跃的按钮。",
      图标: ["images/ow/input/button.png", "images/ow/input/gray/button.png"],
    },
    {
      名称: "近身攻击",
      标签: ["按钮"],
      提示: "绑定近身攻击的按钮。",
      图标: ["images/ow/input/button.png", "images/ow/input/gray/button.png"],
    },
    {
      名称: "主要攻击模式",
      标签: ["按钮"],
      提示: "绑定主要攻击模式的按钮。",
      图标: ["images/ow/input/left.png", "images/ow/input/gray/left.png"],
    },
    {
      名称: "装填",
      标签: ["按钮"],
      提示: "绑定装填的按钮。",
      图标: ["images/ow/input/button.png", "images/ow/input/gray/button.png"],
    },
    {
      名称: "辅助攻击模式",
      标签: ["按钮"],
      提示: "绑定辅助攻击模式的按钮。",
      图标: ["images/ow/input/right.png", "images/ow/input/gray/right.png"],
    },
    {
      名称: "终极技能",
      标签: ["按钮"],
      提示: "绑定终极技能的按钮。",
      图标: ["images/ow/input/button.png", "images/ow/input/gray/button.png"],
    },
  ],
  截取: [
    {
      名称: "根据表面截取",
      标签: ["截取", "地图"],
      提示: "一个仅用于“创建地图文本”或“创建地图进度条文本”的截取选项。",
    },
    {
      名称: "不要截取",
      标签: ["截取", "地图"],
      提示: "一个仅用于“创建地图文本”或“创建地图进度条文本”的截取选项。",
    },
  ],
  颜色: [
    {
      名称: "白色",
      标签: ["颜色"],
      数值: [255, 255, 255, 255],
      图标: "images/ow/color/white.png",
      提示: "一个默认颜色选项。等效自定义颜色(255, 255, 255, 255)。",
    },
    {
      名称: "黄色",
      标签: ["颜色"],
      数值: [255, 255, 0, 255],
      图标: "images/ow/color/yellow.png",
      提示: "一个默认颜色选项。等效自定义颜色(255, 255, 0, 255)。",
    },
    {
      名称: "绿色",
      标签: ["颜色"],
      数值: [69, 255, 87, 255],
      图标: "images/ow/color/green.png",
      提示: "一个默认颜色选项。等效自定义颜色(69, 255, 87, 255)。",
    },
    {
      名称: "紫色",
      标签: ["颜色"],
      数值: [100, 50, 255, 255],
      图标: "images/ow/color/violet.png",
      提示: "一个默认颜色选项。等效自定义颜色(100, 50, 255, 255)。",
    },
    {
      名称: "红色",
      标签: ["颜色"],
      数值: [200, 0, 19, 255],
      图标: "images/ow/color/red.png",
      提示: "一个默认颜色选项。等效自定义颜色(200, 0, 19, 255)。",
    },
    {
      名称: "蓝色",
      标签: ["颜色"],
      数值: [39, 170, 255, 255],
      图标: "images/ow/color/blue.png",
      提示: "一个默认颜色选项。等效自定义颜色(39, 170, 255, 255)。",
    },
    {
      名称: "队伍1",
      标签: ["颜色选项", "队伍颜色选项"],
      数值: [39, 170, 255, 255],
      图标: "images/ow/color/team1.png",
      提示: "一个队伍颜色选项, 默认为蓝色。等效自定义颜色(39, 170, 255, 255)。",
    },
    {
      名称: "队伍2",
      标签: ["颜色选项", "队伍颜色选项"],
      数值: [200, 0, 19, 255],
      图标: "images/ow/color/team2.png",
      提示: "一个队伍颜色选项, 默认为红色。等效自定义颜色(200, 0, 19, 255)。",
    },
    {
      名称: "水绿色",
      标签: ["颜色"],
      数值: [0, 234, 234, 255],
      图标: "images/ow/color/aqua.png",
      提示: "一个默认颜色选项。等效自定义颜色(0, 234, 234, 255)。",
    },
    {
      名称: "橙色",
      标签: ["颜色"],
      数值: [236, 153, 0, 255],
      图标: "images/ow/color/orange.png",
      提示: "一个默认颜色选项。等效自定义颜色(236, 153, 0, 255)。",
    },
    {
      名称: "天蓝色",
      标签: ["颜色"],
      数值: [108, 190, 244, 255],
      图标: "images/ow/color/sky_blue.png",
      提示: "一个默认颜色选项。等效自定义颜色(108, 190, 244, 255)。",
    },
    {
      名称: "青绿色",
      标签: ["颜色"],
      数值: [0, 230, 151, 255],
      图标: "images/ow/color/turquoise.png",
      提示: "一个默认颜色选项。等效自定义颜色(0, 230, 151, 255)。",
    },
    {
      名称: "灰绿色",
      标签: ["颜色"],
      数值: [160, 232, 27, 255],
      图标: "images/ow/color/lime_green.png",
      提示: "一个默认颜色选项。等效自定义颜色(160, 232, 27, 255)。",
    },
    {
      名称: "亮紫色",
      标签: ["颜色"],
      数值: [161, 73, 197, 255],
      图标: "images/ow/color/purple.png",
      提示: "一个默认颜色选项。等效自定义颜色(161, 73, 197, 255)。",
    },
    {
      名称: "黑色",
      标签: ["颜色"],
      数值: [0, 0, 0, 255],
      图标: "images/ow/color/black.png",
      提示: "一个默认颜色选项。等效自定义颜色(0, 0, 0, 255)。",
    },
    {
      名称: "玫红",
      标签: ["颜色"],
      数值: [255, 50, 145, 255],
      图标: "images/ow/color/rose.png",
      提示: "一个默认颜色选项。等效自定义颜色(255, 50, 145, 255)。",
    },
    {
      名称: "灰色",
      标签: ["颜色"],
      数值: [127, 127, 127, 255],
      图标: "images/ow/color/gray.png",
      提示: "一个默认颜色选项。等效自定义颜色(127, 127, 127, 255)。",
    },
  ],
  交流: [
    {
      名称: "收到",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "不行",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "抱歉",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "好的",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "感谢",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "撤退",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "推进",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "前进",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "集合",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "再见",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "问候",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "不用谢",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "我上了",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "倒计时",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "敌人来袭",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "需要治疗",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "需要帮助",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "做好准备",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "正在进攻",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "正在防守",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "正在赶来",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "继续攻击",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "我跟着你",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "喷漆上",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "喷漆左",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "喷漆右",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "喷漆下",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "语音（上）",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "语音（左）",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "语音（右）",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "语音（下）",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "表情（上）",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "表情（左）",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "表情（右）",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "表情（下）",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
    {
      名称: "终极技能状态",
      标签: ["交流"],
      提示: "一个交流选项。",
    },
  ],
  英雄数据: [
    {
      名称: "所有造成伤害量",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "对屏障造成伤害量",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "阻挡伤害量",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "承受伤害量",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "阵亡",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "消灭",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "地形阵亡",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "地形消灭",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "协助防守",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "协助进攻",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "最后一击",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "对英雄造成伤害量",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "治疗量",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "最佳瞬间消灭",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "瞬间消灭",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "目标攻防消灭",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "单独消灭",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "获得终极技能",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "使用终极技能",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "武器命中率",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "暴击命中率",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "暴击",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "受到治疗量",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "开镜命中率",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "开镜暴击率",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "开镜暴击消灭",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "开镜暴击",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "开镜命中",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "开镜射击",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "自我治疗量",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "射击次数",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "射击命中",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
    {
      名称: "射击未命中",
      标签: ["数据", "英雄"],
      提示: "一个英雄数据选项。",
    },
  ],
  玩家数据: [
    {
      名称: "所有造成伤害量",
      标签: ["数据", "玩家"],
      提示: "一个玩家数据选项。",
    },
    {
      名称: "对屏障造成伤害量",
      标签: ["数据", "玩家"],
      提示: "一个玩家数据选项。",
    },
    {
      名称: "阻挡伤害量",
      标签: ["数据", "玩家"],
      提示: "一个玩家数据选项。",
    },
    {
      名称: "承受伤害量",
      标签: ["数据", "玩家"],
      提示: "一个玩家数据选项。",
    },
    {
      名称: "阵亡",
      标签: ["数据", "玩家"],
      提示: "一个玩家数据选项。",
    },
    {
      名称: "消灭",
      标签: ["数据", "玩家"],
      提示: "一个玩家数据选项。",
    },
    {
      名称: "地形阵亡",
      标签: ["数据", "玩家"],
      提示: "一个玩家数据选项。",
    },
    {
      名称: "地形消灭",
      标签: ["数据", "玩家"],
      提示: "一个玩家数据选项。",
    },
    {
      名称: "协助防守",
      标签: ["数据", "玩家"],
      提示: "一个玩家数据选项。",
    },
    {
      名称: "协助进攻",
      标签: ["数据", "玩家"],
      提示: "一个玩家数据选项。",
    },
    {
      名称: "最后一击",
      标签: ["数据", "玩家"],
      提示: "一个玩家数据选项。",
    },
    {
      名称: "对英雄造成伤害量",
      标签: ["数据", "玩家"],
      提示: "一个玩家数据选项。",
    },
    {
      名称: "治疗量",
      标签: ["数据", "玩家"],
      提示: "一个玩家数据选项。",
    },
    {
      名称: "最佳瞬间消灭",
      标签: ["数据", "玩家"],
      提示: "一个玩家数据选项。",
    },
    {
      名称: "瞬间消灭",
      标签: ["数据", "玩家"],
      提示: "一个玩家数据选项。",
    },
    {
      名称: "目标攻防消灭",
      标签: ["数据", "玩家"],
      提示: "一个玩家数据选项。",
    },
    {
      名称: "单独消灭",
      标签: ["数据", "玩家"],
      提示: "一个玩家数据选项。",
    },
    {
      名称: "获得终极技能",
      标签: ["数据", "玩家"],
      提示: "一个玩家数据选项。",
    },
    {
      名称: "使用终极技能",
      标签: ["数据", "玩家"],
      提示: "一个玩家数据选项。",
    },
    {
      名称: "武器命中率",
      标签: ["数据", "玩家"],
      提示: "一个玩家数据选项。",
    },
  ],
  光束效果: [
    {
      名称: "有益光束",
      标签: ["光束", "基础效果"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "有害光束",
      标签: ["光束", "基础效果"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "抓钩光束",
      标签: ["光束", "基础效果"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "布丽吉塔连枷链光束",
      标签: ["光束", "光束效果"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "“回声”聚焦光线光束",
      标签: ["光束", "光束效果"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "“狂鼠”陷阱链光束",
      标签: ["光束", "光束效果"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "“天使”治疗光束",
      标签: ["光束", "光束效果"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "“天使”强化光束",
      标签: ["光束", "光束效果"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "莫伊拉生化之球治疗光束",
      标签: ["光束", "光束效果"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "莫伊拉生化之球伤害光束",
      标签: ["光束", "光束效果"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "莫伊拉生化之触连接光束",
      标签: ["光束", "光束效果"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "莫伊拉聚合射线光束",
      标签: ["光束", "光束效果"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "奥丽莎站住别动连线光束",
      标签: ["光束", "光束效果"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "奥丽莎强化光束",
      标签: ["光束", "光束效果"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "“秩序之光”光子发射器光束",
      标签: ["光束", "光束效果"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "“秩序之光”哨戒炮光束",
      标签: ["光束", "光束效果"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "托比昂炮台视线光束",
      标签: ["光束", "光束效果"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "温斯顿特斯拉炮光束",
      标签: ["光束", "光束效果"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "查莉娅粒子光束",
      标签: ["光束", "光束效果"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "智械切割者光束",
      标签: ["光束", "光束效果"],
      提示: "一个光束效果选项。",
      图标: "",
    },
  ],
  播放效果: [
    {
      名称: "有益爆炸",
      标签: ["播放", "基础效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "有害爆炸",
      标签: ["播放", "基础效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "环状爆炸",
      标签: ["播放", "基础效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "有益选择效果",
      标签: ["播放", "基础效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "有害选择效果",
      标签: ["播放", "基础效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "正面状态施加声音",
      标签: ["播放", "基础声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "负面状态施加声音",
      标签: ["播放", "基础声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "状态爆炸声音",
      标签: ["播放", "基础声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "环状爆炸声音",
      标签: ["播放", "基础声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "爆炸声音",
      标签: ["播放", "基础声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "卡西迪闪光弹击晕效果",
      标签: ["播放", "减益状态效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“黑影”黑客入侵完成开始效果",
      标签: ["播放", "减益状态效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "治疗目标激活效果",
      标签: ["播放", "增益状态效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“黑影”位移传动材料效果",
      标签: ["播放", "增益状态效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "安娜生物手雷增疗声音",
      标签: ["播放", "增益效果和减益效果声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "安娜生物手雷禁疗声音",
      标签: ["播放", "增益效果和减益效果声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "安娜麻醉镖声音",
      标签: ["播放", "增益效果和减益效果声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“死神”幽灵形态声音",
      标签: ["播放", "增益效果和减益效果声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“黑影”位移传动声音",
      标签: ["播放", "增益效果和减益效果声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“士兵：76”疾跑开始声音",
      标签: ["播放", "增益效果和减益效果声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "安娜生物手雷爆炸声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "艾什延时雷管爆炸声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "巴蒂斯特生化榴弹枪爆炸声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“堡垒”坦克炮爆炸声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "布丽吉塔流星飞锤范围治疗声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "布丽吉塔恢复包击中声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "布丽吉塔恢复包护甲声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "D.Va微型飞弹爆炸声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "D.Va自毁爆炸声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“末日铁拳”上勾重拳跳跃声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“末日铁拳”上勾重拳击中声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“末日铁拳”毁天灭地击中声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“回声”黏性炸弹爆炸声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“狂鼠”榴弹发射器爆炸声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“狂鼠”震荡地雷爆炸声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“狂鼠”炸弹轮胎爆炸声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "半藏音初始脉冲声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "卢西奥音障施放声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "卡西迪闪光弹爆炸声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "莫伊拉消散消失声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "莫伊拉消散重现声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "奥丽莎站住别动内爆声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“法老之鹰”火箭发射器爆炸声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“法老之鹰”震荡冲击声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“法老之鹰”火箭弹幕爆炸声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "莱因哈特烈焰打击目标击中声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“西格玛”超能之球内爆声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“西格玛”质量吸附击中声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“黑影”标志声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“黑影”位移传动消失声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“黑影”位移传动重现声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“黑影”电磁脉冲爆炸声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“秩序之光”传送面板重现声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“猎空”闪回消失声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“猎空”闪回重现声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“黑百合”剧毒诡雷爆炸声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "温斯顿喷射背包着陆声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“破坏球”重力坠击击中声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“破坏球”地雷禁区爆炸声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "查莉娅粒子炮爆炸声音",
      标签: ["播放", "爆炸声音"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "布丽吉塔恢复包击中效果",
      标签: ["播放", "能量爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "布丽吉塔恢复包护甲效果",
      标签: ["播放", "能量爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "布丽吉塔流星飞锤范围治疗效果",
      标签: ["播放", "能量爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "D.Va微型飞弹爆炸效果",
      标签: ["播放", "能量爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "D.Va自毁爆炸效果",
      标签: ["播放", "能量爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“回声”黏性炸弹爆炸效果",
      标签: ["播放", "能量爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "半藏音初始脉冲效果",
      标签: ["播放", "能量爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "卢西奥音障施放效果",
      标签: ["播放", "能量爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "莫伊拉消散消失效果",
      标签: ["播放", "能量爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "莫伊拉消散重现效果",
      标签: ["播放", "能量爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "奥丽莎站住别动内爆效果",
      标签: ["播放", "能量爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“西格玛”超能之球内爆效果",
      标签: ["播放", "能量爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“黑影”标志效果",
      标签: ["播放", "能量爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“黑影”位移传动消失效果",
      标签: ["播放", "能量爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“黑影”位移传动重现效果",
      标签: ["播放", "能量爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“黑影”电磁脉冲爆炸效果",
      标签: ["播放", "能量爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“秩序之光”传送面板重现效果",
      标签: ["播放", "能量爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“猎空”闪回消失效果",
      标签: ["播放", "能量爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“猎空“闪回重现效果",
      标签: ["播放", "能量爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "查莉娅粒子炮爆炸效果",
      标签: ["播放", "能量爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "安娜生物手雷爆炸效果",
      标签: ["播放", "运动爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "艾什延时雷管爆炸效果",
      标签: ["播放", "运动爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "巴蒂斯特生化榴弹枪爆炸效果",
      标签: ["播放", "运动爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“堡垒”坦克炮爆炸效果",
      标签: ["播放", "运动爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“末日铁拳”上勾重拳跳跃效果",
      标签: ["播放", "运动爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“末日铁拳”上勾重拳击中效果",
      标签: ["播放", "运动爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“末日铁拳”毁天灭地击中效果",
      标签: ["播放", "运动爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“狂鼠”榴弹发射器爆炸效果",
      标签: ["播放", "运动爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“狂鼠”震荡地雷爆炸效果",
      标签: ["播放", "运动爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“狂鼠”炸弹轮胎爆炸效果",
      标签: ["播放", "运动爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "卡西迪闪光弹爆炸效果",
      标签: ["播放", "运动爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“法老之鹰”火箭发射器爆炸效果",
      标签: ["播放", "运动爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“法老之鹰”震荡冲击效果",
      标签: ["播放", "运动爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“法老之鹰”火箭弹幕爆炸效果",
      标签: ["播放", "运动爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "莱因哈特烈焰打击目标击中效果",
      标签: ["播放", "运动爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“西格玛”质量吸附击中效果",
      标签: ["播放", "运动爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“黑百合“剧毒诡雷爆炸效果",
      标签: ["播放", "运动爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "温斯顿喷射背包着陆效果",
      标签: ["播放", "运动爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“破坏球”重力坠击击中效果",
      标签: ["播放", "运动爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
    {
      名称: "“破坏球”地雷禁区爆炸效果",
      标签: ["播放", "运动爆炸效果"],
      提示: "一个播放效果选项。",
      图标: "",
    },
  ],
  效果: [
    {
      名称: "球体",
      标签: ["效果", "基础效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "光柱",
      标签: ["效果", "基础效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "球",
      标签: ["效果", "基础效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "环",
      标签: ["效果", "基础效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "云",
      标签: ["效果", "基础效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "火花",
      标签: ["效果", "基础效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "有益光环",
      标签: ["效果", "基础效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "有害光环",
      标签: ["效果", "基础效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "能量声音",
      标签: ["效果", "基础效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "拾取音效",
      标签: ["效果", "基础效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "有益光环声音",
      标签: ["效果", "基础效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "负面光环音效",
      标签: ["效果", "基础效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "火花声音",
      标签: ["效果", "基础效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "烟雾声音",
      标签: ["效果", "基础效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "诱饵声音",
      标签: ["效果", "基础效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "信标声音",
      标签: ["效果", "基础效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "安娜生物手雷禁疗效果",
      标签: ["效果", "减益状态效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "安娜麻醉镖效果",
      标签: ["效果", "减益状态效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "艾什延时雷管燃烧粒子效果",
      标签: ["效果", "减益状态效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "艾什延时雷管燃烧材料效果",
      标签: ["效果", "减益状态效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "卡西迪闪光弹击晕效果",
      标签: ["效果", "减益状态效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "美冰冻效果",
      标签: ["效果", "减益状态效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "“西格玛”引力乱流目标效果",
      标签: ["效果", "减益状态效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "“黑影”黑客入侵完成循环效果",
      标签: ["效果", "减益状态效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "“黑百合”剧毒诡雷目标效果",
      标签: ["效果", "减益状态效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "温斯顿特斯拉炮目标效果",
      标签: ["效果", "减益状态效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "禅雅塔乱目标效果",
      标签: ["效果", "减益状态效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "治疗目标效果",
      标签: ["效果", "增益状态效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "治疗目标激活效果",
      标签: ["效果", "增益状态效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "安娜生物手雷增疗效果",
      标签: ["效果", "增益状态效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "安娜纳米激素强化效果",
      标签: ["效果", "增益状态效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "巴蒂斯特维生力场保护效果",
      标签: ["效果", "增益状态效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "“回声”复制效果",
      标签: ["效果", "增益状态效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "卢西奥音障保护效果",
      标签: ["效果", "增益状态效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "“天使”伤害强化效果",
      标签: ["效果", "增益状态效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "“死神”幽灵形态效果",
      标签: ["效果", "增益状态效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "“士兵：76”疾跑效果",
      标签: ["效果", "增益状态效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "托比昂热力过载效果",
      标签: ["效果", "增益状态效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "温斯顿原始暴怒效果",
      标签: ["效果", "增益状态效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "“破坏球”感应护盾目标效果",
      标签: ["效果", "增益状态效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "“破坏球”重力坠击火焰效果",
      标签: ["效果", "增益状态效果"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "安娜纳米激素强化声音",
      标签: ["效果", "增益效果和减益效果声音"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "巴蒂斯特维生力场保护声音",
      标签: ["效果", "增益效果和减益效果声音"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "“回声”复制声音",
      标签: ["效果", "增益效果和减益效果声音"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "卢西奥音障保护声音",
      标签: ["效果", "增益效果和减益效果声音"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "美冰冻声音",
      标签: ["效果", "增益效果和减益效果声音"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "“天使”伤害强化声音",
      标签: ["效果", "增益效果和减益效果声音"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "“西格玛”引力乱流目标声音",
      标签: ["效果", "增益效果和减益效果声音"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "“黑影”黑客入侵进行声音",
      标签: ["效果", "增益效果和减益效果声音"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "“黑影”黑客入侵完成声音",
      标签: ["效果", "增益效果和减益效果声音"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "托比昂热力过载声音",
      标签: ["效果", "增益效果和减益效果声音"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "“黑百合“剧毒诡雷目标声音",
      标签: ["效果", "增益效果和减益效果声音"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "温斯顿特斯拉炮目标声音",
      标签: ["效果", "增益效果和减益效果声音"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "温斯顿原始暴怒声音",
      标签: ["效果", "增益效果和减益效果声音"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "“破坏球”感应护盾目标声音",
      标签: ["效果", "增益效果和减益效果声音"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "“破坏球”重力坠击火焰声音",
      标签: ["效果", "增益效果和减益效果声音"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "禅雅塔乱目标声音",
      标签: ["效果", "增益效果和减益效果声音"],
      提示: "一个效果选项。",
      图标: "",
    },
    {
      名称: "“回声”聚焦光线光束声音",
      标签: ["效果", "光束声音"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "“狂鼠”陷阱链声音",
      标签: ["效果", "光束声音"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "“天使”治疗光束声音",
      标签: ["效果", "光束声音"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "“天使”强化光束声音",
      标签: ["效果", "光束声音"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "莫伊拉生化之触连接声音",
      标签: ["效果", "光束声音"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "莫伊拉生化之球伤害声音",
      标签: ["效果", "光束声音"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "莫伊拉生化之球治疗声音",
      标签: ["效果", "光束声音"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "莫伊拉聚合射线声音",
      标签: ["效果", "光束声音"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "奥丽莎强化声音",
      标签: ["效果", "光束声音"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "奥丽莎站住别动连线声音",
      标签: ["效果", "光束声音"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "“秩序之光”光子发射器声音",
      标签: ["效果", "光束声音"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "温斯顿特斯拉炮声音",
      标签: ["效果", "光束声音"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "查莉娅粒子炮爆炸声音",
      标签: ["效果", "光束声音"],
      提示: "一个光束效果选项。",
      图标: "",
    },
    {
      名称: "智械切割者光束声音",
      标签: ["效果", "光束声音"],
      提示: "一个光束效果选项。",
      图标: "",
    },
  ],
  子程序行为: [
    {
      名称: "重新开始规则",
      标签: ["子程序", "行为"],
      提示: "一个仅用于“开始规则”的子程序行为选项。",
    },
    {
      名称: "无动作",
      标签: ["子程序", "行为"],
      提示: "一个仅用于“开始规则”的子程序行为选项。",
    },
  ],
  生命类型: [
    {
      名称: "生命值",
      标签: ["生命类型"],
      提示: "一个生命类型选项。",
    },
    {
      名称: "护甲",
      标签: ["生命类型"],
      提示: "一个生命类型选项。",
    },
    {
      名称: "护盾",
      标签: ["生命类型"],
      提示: "一个生命类型选项。",
    },
  ],
  英雄: [
    {
      名称: "安娜",
      标签: ["英雄", "支援"],
      提示: "作为守望先锋的副指挥官，安娜·艾玛莉利用她的技巧和专长保护家园和最亲密的人。",
      图标: "images/ow/hero/support/ana/icon.png",
      生命: {
        自由: "200",
        职责: "200",
      },
      技能: {
        生化步枪: {
          图标: "images/ow/hero/support/ana/weapon.png",
          绑定: ["主要攻击模式", "辅助攻击模式"],
          提示: "安娜的步枪能够射出治疗队友和对敌人造成持续伤害的子弹。而她步枪上的瞄准镜能够让她进行更加精确的射击。",
        },
        纳米激素: {
          图标: [
            "images/ow/hero/support/ana/ultimate.png",
            "images/ow/hero/support/ana/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
          提示: "安娜在给一名队友注射战斗激素后，造成的伤害更高，而受到敌人的伤害更少。",
        },
        麻醉镖: {
          图标: [
            "images/ow/hero/support/ana/ability1.png",
            "images/ow/hero/support/ana/gray/ability1.png",
          ],
          绑定: ["技能1"],
          提示: "安娜用她的手枪发射飞镖，而飞镖能够让敌人失去意识(但任何的伤害都能唤醒敌人)。",
        },
        生物手雷: {
          图标: [
            "images/ow/hero/support/ana/ability2.png",
            "images/ow/hero/support/ana/gray/ability2.png",
          ],
          绑定: ["技能2"],
          提示: "受到手雷影响的队友在一段时间内所受到的治疗量增加，而受到手雷影响的敌人在一段时间内无法接受治疗。",
        },
      },
    },
    {
      名称: "艾什",
      标签: ["英雄", "输出"],
      提示: "艾什是死局帮的领袖，这个帮派在美国西南部非常有影响。",
      图标: "images/ow/hero/damage/ashe/icon.png",
      生命: {
        自由: "200",
        职责: "200",
      },
      技能: {
        "“毒蛇”": {
          图标: "images/ow/hero/damage/ashe/weapon.png",
          绑定: ["主要攻击模式", "辅助攻击模式"],
        },
        召唤鲍勃: {
          图标: [
            "images/ow/hero/damage/ashe/ultimate.png",
            "images/ow/hero/damage/ashe/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        短筒猎枪: {
          图标: [
            "images/ow/hero/damage/ashe/ability1.png",
            "images/ow/hero/damage/ashe/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        延时雷管: {
          图标: [
            "images/ow/hero/damage/ashe/ability2.png",
            "images/ow/hero/damage/ashe/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
      },
    },
    {
      名称: "巴蒂斯特",
      标签: ["英雄", "支援"],
      提示: "巴蒂斯特是一位精英战地医疗兵，曾担任黑爪特工，但现在的他致力于使用自己的能力去帮助那些饱受战火袭扰的人们。",
      图标: "images/ow/hero/support/baptiste/icon.png",
      生命: {
        自由: "200",
        职责: "200",
      },
      技能: {
        生化榴弹枪: {
          图标: "images/ow/hero/support/baptiste/weapon1.png",
          绑定: ["主要攻击模式"],
          提示: "弹药索引为 0。",
        },
        生化榴弹: {
          图标: "images/ow/hero/support/baptiste/weapon2.png",
          绑定: ["辅助攻击模式"],
          提示: "弹药索引为 1。",
        },
        增幅矩阵: {
          图标: [
            "images/ow/hero/support/baptiste/ultimate.png",
            "images/ow/hero/support/baptiste/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        愈合冲击: {
          图标: [
            "images/ow/hero/support/baptiste/ability1.png",
            "images/ow/hero/support/baptiste/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        维生力场: {
          图标: [
            "images/ow/hero/support/baptiste/ability2.png",
            "images/ow/hero/support/baptiste/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
        动力战靴: {
          图标: [
            "images/ow/hero/support/baptiste/passive.png",
            "images/ow/hero/support/baptiste/gray/passive.png",
          ],
          绑定: ["跳跃", "被动"],
          提示: "在蓄力后可以跳得更高。",
        },
      },
    },
    {
      名称: "堡垒",
      标签: ["英雄", "输出"],
      提示: "曾在智械危机中身为前线战斗单位，充满好奇心的“堡垒”现在成为了一名探险者，被自然之美深深吸引的同时也警惕着人性之恶。",
      图标: "images/ow/hero/damage/bastion/icon.png",
      生命: {
        自由: "200",
        职责: "200",
        护甲: "100",
      },
      技能: {
        侦察模式: {
          图标: "images/ow/hero/damage/bastion/weapon1.png",
          绑定: ["主要攻击模式"],
        },
        强攻模式: {
          图标: "images/ow/hero/damage/bastion/weapon2.png",
          绑定: ["主要攻击模式"],
          提示: "切换模式状态下的武器。无需装弹，故无法设置弹药。",
        },
        "A-36战术榴弹": {
          图标: [
            "images/ow/hero/damage/bastion/secondaryfire.png",
            "images/ow/hero/damage/bastion/gray/secondaryfire.png",
          ],
          绑定: ["辅助攻击模式"],
        },
        火炮模式: {
          图标: [
            "images/ow/hero/damage/bastion/ultimate.png",
            "images/ow/hero/damage/bastion/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        切换模式: {
          图标: [
            "images/ow/hero/damage/bastion/ability1.png",
            "images/ow/hero/damage/bastion/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        抗击装甲: {
          图标: [
            "images/ow/hero/damage/bastion/passive.png",
            "images/ow/hero/damage/bastion/gray/passive.png",
          ],
          绑定: ["被动"],
          提示: "降低切换模式后所受的伤害。",
        },
      },
    },
    {
      名称: "布丽吉塔",
      标签: ["英雄", "支援"],
      提示: "布丽吉塔·林德霍姆是莱因哈特·威尔海姆的追随者，她曾经是一名机械工程师，现在则穿上盔甲踏上战场，保卫这个世界。",
      图标: "images/ow/hero/support/brigitte/icon.png",
      生命: {
        自由: "150",
        职责: "150",
        护甲: "50",
        屏障: "300",
      },
      技能: {
        火箭连枷: {
          图标: "images/ow/hero/support/brigitte/weapon.png",
          绑定: ["主要攻击模式"],
          提示: "举盾时不可用。",
        },
        屏障护盾: {
          图标: [
            "images/ow/hero/support/brigitte/secondaryfire1.png",
            "images/ow/hero/support/brigitte/gray/secondaryfire1.png",
          ],
          绑定: ["辅助攻击模式"],
        },
        能量盾击: {
          图标: [
            "images/ow/hero/support/brigitte/secondaryfire2.png",
            "images/ow/hero/support/brigitte/gray/secondaryfire2.png",
          ],
          绑定: ["辅助攻击模式 + 主要攻击模式"],
          提示: "仅在举盾时可用。作为事件技能时为“主要攻击模式”。",
        },
        集结号令: {
          图标: [
            "images/ow/hero/support/brigitte/ultimate.png",
            "images/ow/hero/support/brigitte/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        流星飞锤: {
          图标: [
            "images/ow/hero/support/brigitte/ability1.png",
            "images/ow/hero/support/brigitte/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        恢复包: {
          图标: [
            "images/ow/hero/support/brigitte/ability2.png",
            "images/ow/hero/support/brigitte/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
        鼓舞士气: {
          图标: [
            "images/ow/hero/support/brigitte/passive.png",
            "images/ow/hero/support/brigitte/gray/passive.png",
          ],
          绑定: ["被动"],
        },
      },
    },
    {
      名称: "末日铁拳",
      标签: ["英雄", "重装"],
      提示: "“末日铁拳”是“黑爪”的领导者之一，他坚信只有将世界带向一场新的战争才能让人类变得更加强大。",
      图标: "images/ow/hero/tank/doomfist/icon.png",
      生命: {
        自由: "300",
        职责: "450",
      },
      技能: {
        手炮: {
          图标: "images/ow/hero/tank/doomfist/weapon.png",
          绑定: ["主要攻击模式"],
          提示: "无法手动装填，但可以设置弹药。",
        },
        火箭重拳: {
          图标: [
            "images/ow/hero/tank/doomfist/secondaryfire.png",
            "images/ow/hero/tank/doomfist/gray/secondaryfire.png",
          ],
          绑定: ["辅助攻击模式"],
        },
        毁天灭地: {
          图标: [
            "images/ow/hero/tank/doomfist/ultimate.png",
            "images/ow/hero/tank/doomfist/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        裂地重拳: {
          图标: [
            "images/ow/hero/tank/doomfist/ability1.png",
            "images/ow/hero/tank/doomfist/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        悍猛格挡: {
          图标: [
            "images/ow/hero/tank/doomfist/ability2.png",
            "images/ow/hero/tank/doomfist/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
        最佳防守: {
          图标: [
            "images/ow/hero/tank/doomfist/passive.png",
            "images/ow/hero/tank/doomfist/gray/passive.png",
          ],
          绑定: ["被动"],
          提示: "用技能命中敌人后，自身可生成临时生命值。",
        },
      },
    },
    {
      名称: "D.Va",
      标签: ["英雄", "重装"],
      提示: "D.Va曾经是一名职业玩家，而现在则利用自己的技巧驾驶一台尖端机甲保卫国家。",
      图标: "images/ow/hero/tank/dva/icon.png",
      生命: {
        自由: "200",
        职责: "350",
        护甲: "300",
      },
      技能: {
        聚变机炮: {
          图标: "images/ow/hero/tank/dva/weapon1.png",
          绑定: ["主要攻击模式"],
          提示: "使用时会降低D.Va的移动速度。",
        },
        光枪: {
          图标: "images/ow/hero/tank/dva/weapon2.png",
          绑定: ["主要攻击模式"],
          提示: "不在机甲内时为光枪。",
        },
        防御矩阵: {
          图标: [
            "images/ow/hero/tank/dva/secondaryfire.png",
            "images/ow/hero/tank/dva/gray/secondaryfire.png",
          ],
          绑定: ["辅助攻击模式"],
        },
        自毁: {
          图标: [
            "images/ow/hero/tank/dva/ultimate1.png",
            "images/ow/hero/tank/dva/gray/ultimate1.png",
          ],
          绑定: ["终极技能"],
          提示: "将机甲设定为自爆模式，爆炸会对附近大范围的敌人造成巨额伤害。。",
        },
        呼叫机甲: {
          图标: [
            "images/ow/hero/tank/dva/ultimate2.png",
            "images/ow/hero/tank/dva/gray/ultimate2.png",
          ],
          绑定: ["终极技能"],
          提示: "不在机甲内时为召唤机甲。",
        },
        推进器: {
          图标: [
            "images/ow/hero/tank/dva/ability1.png",
            "images/ow/hero/tank/dva/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        微型飞弹: {
          图标: [
            "images/ow/hero/tank/dva/ability2.png",
            "images/ow/hero/tank/dva/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
        弹射: {
          图标: [
            "images/ow/hero/tank/dva/passive.png",
            "images/ow/hero/tank/dva/gray/passive.png",
          ],
          绑定: ["被动"],
        },
      },
    },
    {
      名称: "回声",
      标签: ["英雄", "输出"],
      提示: "“回声”是守望先锋成员米娜·廖博士设计制造的机器人，搭载了可以高速学习适应的先进人工智能程序。",
      图标: "images/ow/hero/damage/echo/icon.png",
      生命: {
        自由: "200",
        职责: "200",
      },
      技能: {
        三角射击: {
          图标: "images/ow/hero/damage/echo/weapon.png",
          绑定: ["主要攻击模式"],
        },
        黏性炸弹: {
          图标: [
            "images/ow/hero/damage/echo/secondaryfire.png",
            "images/ow/hero/damage/echo/gray/secondaryfire.png",
          ],
          绑定: ["辅助攻击模式"],
        },
        人格复制: {
          图标: [
            "images/ow/hero/damage/echo/ultimate.png",
            "images/ow/hero/damage/echo/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        飞行: {
          图标: [
            "images/ow/hero/damage/echo/ability1.png",
            "images/ow/hero/damage/echo/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        聚焦光线: {
          图标: [
            "images/ow/hero/damage/echo/ability2.png",
            "images/ow/hero/damage/echo/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
        滑翔: {
          图标: [
            "images/ow/hero/damage/echo/passive.png",
            "images/ow/hero/damage/echo/gray/passive.png",
          ],
          绑定: ["跳跃", "被动"],
        },
      },
    },
    {
      名称: "源氏",
      标签: ["英雄", "输出"],
      提示: "半机械忍者岛田源氏已经接受了他曾经排斥的强化躯体，并因此发现了更高境界的人性。",
      图标: "images/ow/hero/damage/genji/icon.png",
      生命: {
        自由: "200",
        职责: "200",
      },
      技能: {
        镖: {
          图标: "images/ow/hero/damage/genji/weapon.png",
          绑定: ["主要攻击模式", "辅助攻击模式"],
        },
        斩: {
          图标: [
            "images/ow/hero/damage/genji/ultimate.png",
            "images/ow/hero/damage/genji/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        影: {
          图标: [
            "images/ow/hero/damage/genji/ability1.png",
            "images/ow/hero/damage/genji/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        闪: {
          图标: [
            "images/ow/hero/damage/genji/ability2.png",
            "images/ow/hero/damage/genji/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
        灵: {
          图标: [
            "images/ow/hero/damage/genji/passive.png",
            "images/ow/hero/damage/genji/gray/passive.png",
          ],
          绑定: ["跳跃", "被动"],
          提示: "可以攀爬墙壁并且在空中二段跳。正在攀爬时视为“在墙上”。",
        },
      },
    },
    {
      名称: "破坏球",
      标签: ["英雄", "重装"],
      提示: "“破坏球”的驾驶员哈蒙德是一只仓鼠，经过基因改造，他的智力发生了突变式进化。哈蒙德在世界各地探索，不断寻求着新的冒险。",
      图标: "images/ow/hero/tank/wrecking-ball/icon.png",
      生命: {
        自由: "300",
        职责: "450",
        护甲: "100",
        护盾: "150",
      },
      技能: {
        四联火炮: {
          图标: "images/ow/hero/tank/wrecking-ball/weapon.png",
          绑定: ["主要攻击模式"],
        },
        工程抓钩: {
          图标: [
            "images/ow/hero/tank/wrecking-ball/secondaryfire.png",
            "images/ow/hero/tank/wrecking-ball/gray/secondaryfire.png",
          ],
          绑定: ["辅助攻击模式"],
        },
        地雷禁区: {
          图标: [
            "images/ow/hero/tank/wrecking-ball/ultimate.png",
            "images/ow/hero/tank/wrecking-ball/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        动力铁球: {
          图标: [
            "images/ow/hero/tank/wrecking-ball/ability1.png",
            "images/ow/hero/tank/wrecking-ball/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        感应护盾: {
          图标: [
            "images/ow/hero/tank/wrecking-ball/ability2.png",
            "images/ow/hero/tank/wrecking-ball/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
        重力坠击: {
          图标: [
            "images/ow/hero/tank/wrecking-ball/crouch.png",
            "images/ow/hero/tank/wrecking-ball/gray/crouch.png",
          ],
          绑定: ["蹲下"],
        },
      },
    },
    {
      名称: "半藏",
      标签: ["英雄", "输出"],
      提示: "作为箭术和忍术大师，岛田半藏一直都在追求极致完美的技艺以证明自己是最强大的武士。",
      图标: "images/ow/hero/damage/hanzo/icon.png",
      生命: {
        自由: "200",
        职责: "200",
      },
      技能: {
        风: {
          图标: "images/ow/hero/damage/hanzo/weapon.png",
          绑定: ["主要攻击模式", "辅助攻击模式"],
          提示: "用辅助攻击模式取消拉弓。",
        },
        竜: {
          图标: [
            "images/ow/hero/damage/hanzo/ultimate.png",
            "images/ow/hero/damage/hanzo/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        音: {
          图标: [
            "images/ow/hero/damage/hanzo/ability1.png",
            "images/ow/hero/damage/hanzo/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        岚: {
          图标: [
            "images/ow/hero/damage/hanzo/ability2.png",
            "images/ow/hero/damage/hanzo/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
        跃: {
          图标: [
            "images/ow/hero/damage/hanzo/jump.png",
            "images/ow/hero/damage/hanzo/gray/jump.png",
          ],
          绑定: ["跳跃"],
        },
        攀: {
          图标: [
            "images/ow/hero/damage/hanzo/passive.png",
            "images/ow/hero/damage/hanzo/gray/passive.png",
          ],
          绑定: ["跳跃", "被动"],
          提示: "可以攀爬墙壁。正在攀爬时视为“在墙上”。",
        },
      },
    },
    {
      名称: "渣客女王",
      标签: ["英雄", "重装"],
      提示: "曾经的废民奥代萨·“代斯”·斯通用她辛辣的笑容和无情的铁腕统治着渣客镇。",
      图标: "images/ow/hero/tank/junker-queen/icon.png",
      生命: {
        自由: "300",
        职责: "450",
      },
      技能: {
        散弹枪: {
          图标: "images/ow/hero/tank/junker-queen/weapon.png",
          绑定: ["主要攻击模式"],
        },
        锯齿利刃: {
          图标: [
            "images/ow/hero/tank/junker-queen/secondaryfire.png",
            "images/ow/hero/tank/junker-queen/gray/secondaryfire.png",
          ],
          绑定: ["辅助攻击模式", "近身攻击"],
          提示: "仅在被丢出时可进行正常近战。",
        },
        轰翻天: {
          图标: [
            "images/ow/hero/tank/junker-queen/ultimate.png",
            "images/ow/hero/tank/junker-queen/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        命令怒吼: {
          图标: [
            "images/ow/hero/tank/junker-queen/ability1.png",
            "images/ow/hero/tank/junker-queen/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        血斩: {
          图标: [
            "images/ow/hero/tank/junker-queen/ability2.png",
            "images/ow/hero/tank/junker-queen/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
        狂血奔涌: {
          图标: [
            "images/ow/hero/tank/junker-queen/passive.png",
            "images/ow/hero/tank/junker-queen/gray/passive.png",
          ],
          绑定: ["被动"],
        },
      },
    },
    {
      名称: "狂鼠",
      标签: ["英雄", "输出"],
      提示: "“狂鼠”是一个满脑子都是爆炸的渣客，只为了混乱和破坏而活。",
      图标: "images/ow/hero/damage/junkrat/icon.png",
      生命: {
        自由: "200",
        职责: "200",
      },
      技能: {
        榴弹发射器: {
          图标: "images/ow/hero/damage/junkrat/weapon.png",
          绑定: ["主要攻击模式"],
        },
        炸弹轮胎: {
          图标: [
            "images/ow/hero/damage/junkrat/ultimate.png",
            "images/ow/hero/damage/junkrat/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        震荡地雷: {
          图标: [
            "images/ow/hero/damage/junkrat/ability1.png",
            "images/ow/hero/damage/junkrat/gray/ability1.png",
          ],
          绑定: ["技能1", "辅助攻击模式"],
          提示: "用 技能1 部署，按 辅助攻击模式 引爆。",
        },
        捕兽夹: {
          图标: [
            "images/ow/hero/damage/junkrat/ability2.png",
            "images/ow/hero/damage/junkrat/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
        临别礼物: {
          图标: [
            "images/ow/hero/damage/junkrat/passive.png",
            "images/ow/hero/damage/junkrat/gray/passive.png",
          ],
          绑定: ["被动"],
          提示: "被击杀后，在原地丢下若干快速引爆的榴弹。",
        },
      },
    },
    {
      名称: "雾子",
      标签: ["英雄", "支援"],
      提示: "岛田家族衰亡后，雾子便开始为恢复铁坂的和平而战。",
      图标: "images/ow/hero/support/kiriko/icon.png",
      生命: {
        自由: "200",
        职责: "200",
      },
      技能: {
        锥: {
          图标: "images/ow/hero/support/kiriko/weapon2.png",
          绑定: ["辅助攻击模式"],
          提示: "由于一个问题，无法通过地图工坊动作更改弹药。",
        },
        符: {
          图标: "images/ow/hero/support/kiriko/weapon1.png",
          绑定: ["主要攻击模式"],
          提示: "无法更改弹药。",
        },
        狐: {
          图标: [
            "images/ow/hero/support/kiriko/ultimate.png",
            "images/ow/hero/support/kiriko/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        瞬: {
          图标: [
            "images/ow/hero/support/kiriko/ability1.png",
            "images/ow/hero/support/kiriko/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        铃: {
          图标: [
            "images/ow/hero/support/kiriko/ability2.png",
            "images/ow/hero/support/kiriko/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
        攀: {
          图标: [
            "images/ow/hero/support/kiriko/passive.png",
            "images/ow/hero/support/kiriko/gray/passive.png",
          ],
          绑定: ["跳跃", "被动"],
          提示: "可以攀爬墙壁。正在攀爬时视为“在墙上”。",
        },
      },
    },
    {
      名称: "卢西奥",
      标签: ["英雄", "支援"],
      提示: "卢西奥是一位国际名人，通过音乐和巡演激发社会正能量。",
      图标: "images/ow/hero/support/lucio/icon.png",
      生命: {
        自由: "200",
        职责: "200",
      },
      技能: {
        音速扩音器: {
          图标: "images/ow/hero/support/lucio/weapon.png",
          绑定: ["主要攻击模式"],
        },
        音波: {
          图标: [
            "images/ow/hero/support/lucio/secondaryfire.png",
            "images/ow/hero/support/lucio/gray/secondaryfire.png",
          ],
          绑定: ["辅助攻击模式"],
        },
        音障: {
          图标: [
            "images/ow/hero/support/lucio/ultimate.png",
            "images/ow/hero/support/lucio/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        切歌: {
          图标: [
            "images/ow/hero/support/lucio/ability1.png",
            "images/ow/hero/support/lucio/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        强音: {
          图标: [
            "images/ow/hero/support/lucio/ability2.png",
            "images/ow/hero/support/lucio/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
        滑墙: {
          图标: [
            "images/ow/hero/support/lucio/passive.png",
            "images/ow/hero/support/lucio/gray/passive.png",
          ],
          绑定: ["跳跃", "技能2"],
          提示: "跃上墙面并在其上滑动。滑墙时视为“在墙上”。",
        },
      },
    },
    {
      名称: "卡西迪",
      标签: ["英雄", "输出"],
      提示: "科尔·卡西迪依靠手中值得信赖的“维和者”四处亡命，以自己的方式伸张正义。",
      图标: "images/ow/hero/damage/cassidy/icon.png",
      生命: {
        自由: "225",
        职责: "225",
      },
      技能: {
        维和者: {
          图标: "images/ow/hero/damage/cassidy/weapon.png",
          绑定: ["主要攻击模式", "辅助攻击模式"],
        },
        神射手: {
          图标: [
            "images/ow/hero/damage/cassidy/ultimate.png",
            "images/ow/hero/damage/cassidy/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        战术翻滚: {
          图标: [
            "images/ow/hero/damage/cassidy/ability1.png",
            "images/ow/hero/damage/cassidy/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        磁性手雷: {
          图标: [
            "images/ow/hero/damage/cassidy/ability2.png",
            "images/ow/hero/damage/cassidy/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
      },
    },
    {
      名称: "美",
      标签: ["英雄", "输出"],
      提示: "美是一名为了保护环境而选择战斗的科学家。",
      图标: "images/ow/hero/damage/mei/icon.png",
      生命: {
        自由: "250",
        职责: "250",
      },
      技能: {
        冰霜冲击枪: {
          图标: "images/ow/hero/damage/mei/weapon.png",
          绑定: ["主要攻击模式", "辅助攻击模式"],
        },
        暴雪: {
          图标: [
            "images/ow/hero/damage/mei/ultimate.png",
            "images/ow/hero/damage/mei/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        急冻: {
          图标: [
            "images/ow/hero/damage/mei/ability1.png",
            "images/ow/hero/damage/mei/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        冰墙: {
          图标: [
            "images/ow/hero/damage/mei/ability2.png",
            "images/ow/hero/damage/mei/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
      },
    },
    {
      名称: "天使",
      标签: ["英雄", "支援"],
      提示: "对那些在她照料下的人来说，“天使”是名副其实的守护天使：她是一位顶尖的治疗者、天才科学家以及坚定的和平使者。",
      图标: "images/ow/hero/support/mercy/icon.png",
      生命: {
        自由: "200",
        职责: "200",
      },
      技能: {
        天使之杖: {
          图标: "images/ow/hero/support/mercy/weapon1.png",
          绑定: ["主要攻击模式", "辅助攻击模式"],
        },
        天使冲击枪: {
          图标: "images/ow/hero/support/mercy/weapon2.png",
          绑定: ["主要攻击模式"],
        },
        女武神: {
          图标: [
            "images/ow/hero/support/mercy/ultimate.png",
            "images/ow/hero/support/mercy/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        守护天使: {
          图标: [
            "images/ow/hero/support/mercy/ability1.png",
            "images/ow/hero/support/mercy/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        重生: {
          图标: [
            "images/ow/hero/support/mercy/ability2.png",
            "images/ow/hero/support/mercy/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
        同情愈疗: {
          图标: [
            "images/ow/hero/support/mercy/passive.png",
            "images/ow/hero/support/mercy/gray/passive.png",
          ],
          绑定: ["被动"],
        },
      },
    },
    {
      名称: "莫伊拉",
      标签: ["英雄", "支援"],
      提示: "黑爪的科学家莫伊拉·奥德莱恩有着杰出的才华，但她的工作也引起了诸多争议。她是基因工程方面的顶尖专家，研究的方向是如何对生命最基本的单元加以改进。",
      图标: "images/ow/hero/support/moira/icon.png",
      生命: {
        自由: "200",
        职责: "200",
      },
      技能: {
        生化之触: {
          图标: "images/ow/hero/support/moira/weapon.png",
          绑定: ["主要攻击模式", "辅助攻击模式"],
          提示: "治疗队友，吸取敌人。",
        },
        "生化之触-光束": {
          图标: [
            "images/ow/hero/support/moira/secondaryfire.png",
            "images/ow/hero/support/moira/gray/secondaryfire.png",
          ],
          绑定: ["辅助攻击模式"],
          提示: "吸取敌人。",
        },
        聚合射线: {
          图标: [
            "images/ow/hero/support/moira/ultimate.png",
            "images/ow/hero/support/moira/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        消散: {
          图标: [
            "images/ow/hero/support/moira/ability1.png",
            "images/ow/hero/support/moira/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        生化之球: {
          图标: [
            "images/ow/hero/support/moira/ability2.png",
            "images/ow/hero/support/moira/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
      },
    },
    {
      名称: "奥丽莎",
      标签: ["英雄", "重装"],
      提示: "奥丽莎是用一台在努巴尼昙花一现的 OR15 系列防御机器人的零件组装而成的。尽管她还有很多要学，但现在的奥丽莎已经成为了这座城市的守护者。",
      图标: "images/ow/hero/tank/orisa/icon.png",
      生命: {
        自由: "125",
        职责: "275",
        护甲: "275",
      },
      技能: {
        强化聚变驱动器: {
          图标: "images/ow/hero/tank/orisa/weapon.png",
          绑定: ["主要攻击模式"],
        },
        能量标枪: {
          图标: [
            "images/ow/hero/tank/orisa/secondaryfire.png",
            "images/ow/hero/tank/orisa/gray/secondaryfire.png",
          ],
          绑定: ["辅助攻击模式"],
        },
        撼地猛刺: {
          图标: [
            "images/ow/hero/tank/orisa/ultimate.png",
            "images/ow/hero/tank/orisa/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        强固防御: {
          图标: [
            "images/ow/hero/tank/orisa/ability1.png",
            "images/ow/hero/tank/orisa/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        标枪旋击: {
          图标: [
            "images/ow/hero/tank/orisa/ability2.png",
            "images/ow/hero/tank/orisa/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
      },
    },
    {
      名称: "法老之鹰",
      标签: ["英雄", "输出"],
      提示: "法芮尔·艾玛莉骨子里就是一个恪守岗位的人。她来自一个军功卓越的军人世家，贡献与荣耀就是她最高的追求。",
      图标: "images/ow/hero/damage/pharah/icon.png",
      生命: {
        自由: "200",
        职责: "200",
      },
      技能: {
        火箭发射器: {
          图标: "images/ow/hero/damage/pharah/weapon.png",
          绑定: ["主要攻击模式"],
        },
        火箭弹幕: {
          图标: [
            "images/ow/hero/damage/pharah/ultimate.png",
            "images/ow/hero/damage/pharah/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        推进背包: {
          图标: [
            "images/ow/hero/damage/pharah/ability1.png",
            "images/ow/hero/damage/pharah/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        震荡冲击: {
          图标: [
            "images/ow/hero/damage/pharah/ability2.png",
            "images/ow/hero/damage/pharah/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
        悬浮背包: {
          图标: [
            "images/ow/hero/damage/pharah/passive.png",
            "images/ow/hero/damage/pharah/gray/passive.png",
          ],
          绑定: ["辅助攻击模式", "跳跃", "被动"],
        },
      },
    },
    {
      名称: "死神",
      标签: ["英雄", "输出"],
      提示: "关于这个黑衣人的传闻并不多，只知道大家都称他为“死神”。虽然没人知道他的真实身份和动机，但有一点是可以肯定的，他的出现意味着死亡。",
      图标: "images/ow/hero/damage/reaper/icon.png",
      生命: {
        自由: "250",
        职责: "250",
      },
      技能: {
        地狱火霰弹枪: {
          图标: "images/ow/hero/damage/reaper/weapon.png",
          绑定: ["主要攻击模式"],
        },
        死亡绽放: {
          图标: [
            "images/ow/hero/damage/reaper/ultimate.png",
            "images/ow/hero/damage/reaper/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        暗影步: {
          图标: [
            "images/ow/hero/damage/reaper/ability1.png",
            "images/ow/hero/damage/reaper/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        幽灵形态: {
          图标: [
            "images/ow/hero/damage/reaper/ability2.png",
            "images/ow/hero/damage/reaper/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
        收割: {
          图标: [
            "images/ow/hero/damage/reaper/passive.png",
            "images/ow/hero/damage/reaper/gray/passive.png",
          ],
          绑定: ["被动"],
        },
      },
    },
    {
      名称: "莱因哈特",
      标签: ["英雄", "重装"],
      提示: "莱因哈特·威尔海姆的行事作风就像一个属于过去的勇士，时刻铭记着骑士的信条：无畏、公正、勇敢。",
      图标: "images/ow/hero/tank/reinhardt/icon.png",
      生命: {
        自由: "175",
        职责: "325",
        护甲: "300",
        屏障: "1200",
      },
      技能: {
        火箭重锤: {
          图标: "images/ow/hero/tank/reinhardt/weapon.png",
          绑定: ["主要攻击模式"],
        },
        屏障力场: {
          图标: [
            "images/ow/hero/tank/reinhardt/secondaryfire.png",
            "images/ow/hero/tank/reinhardt/gray/secondaryfire.png",
          ],
          绑定: ["辅助攻击模式"],
        },
        裂地猛击: {
          图标: [
            "images/ow/hero/tank/reinhardt/ultimate.png",
            "images/ow/hero/tank/reinhardt/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        冲锋: {
          图标: [
            "images/ow/hero/tank/reinhardt/ability1.png",
            "images/ow/hero/tank/reinhardt/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        烈焰打击: {
          图标: [
            "images/ow/hero/tank/reinhardt/ability2.png",
            "images/ow/hero/tank/reinhardt/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
      },
    },
    {
      名称: "路霸",
      标签: ["英雄", "重装"],
      提示: "“路霸”是一个心狠手辣的暴徒，因残忍和肆意破坏而臭名昭著。",
      图标: "images/ow/hero/tank/roadhog/icon.png",
      生命: {
        自由: "550",
        职责: "700",
      },
      技能: {
        爆裂枪: {
          图标: "images/ow/hero/tank/roadhog/weapon.png",
          绑定: ["主要攻击模式", "辅助攻击模式"],
        },
        鸡飞狗跳: {
          图标: [
            "images/ow/hero/tank/roadhog/ultimate.png",
            "images/ow/hero/tank/roadhog/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        链钩: {
          图标: [
            "images/ow/hero/tank/roadhog/ability1.png",
            "images/ow/hero/tank/roadhog/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        呼吸器: {
          图标: [
            "images/ow/hero/tank/roadhog/ability2.png",
            "images/ow/hero/tank/roadhog/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
      },
    },
    {
      名称: "西格玛",
      标签: ["英雄", "重装"],
      提示: "希尔伯伦·德·柯伊伯博士是一位成就不凡的天体物理学家，在一场实验事故后，他获得了操控引力的力量。目前他正在黑爪的操纵下为他们效力。",
      图标: "images/ow/hero/tank/sigma/icon.png",
      生命: {
        自由: "200",
        职责: "350",
        护盾: "200",
        屏障: "700",
      },
      技能: {
        超能之球: {
          图标: "images/ow/hero/tank/sigma/weapon.png",
          绑定: ["主要攻击模式"],
        },
        实验屏障: {
          图标: [
            "images/ow/hero/tank/sigma/secondaryfire.png",
            "images/ow/hero/tank/sigma/gray/secondaryfire.png",
          ],
          绑定: ["辅助攻击模式"],
        },
        引力乱流: {
          图标: [
            "images/ow/hero/tank/sigma/ultimate.png",
            "images/ow/hero/tank/sigma/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        动能俘获: {
          图标: [
            "images/ow/hero/tank/sigma/ability1.png",
            "images/ow/hero/tank/sigma/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        质量吸附: {
          图标: [
            "images/ow/hero/tank/sigma/ability2.png",
            "images/ow/hero/tank/sigma/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
      },
    },
    {
      名称: "索杰恩",
      标签: ["英雄", "输出"],
      提示: "“索杰恩”的躯体几乎均由机械强化部件组成，她是一位杰出的战术家，疾恶好善不曾动摇。战场之上，她是不可或缺的盟友……亦或是令人胆寒的敌人。",
      图标: "images/ow/hero/damage/sojourn/icon.png",
      生命: {
        自由: "200",
        职责: "200",
      },
      技能: {
        电磁炮: {
          图标: "images/ow/hero/damage/sojourn/weapon.png",
          绑定: ["主要攻击模式", "辅助攻击模式"],
          提示: "无法通过修改技能资源或“伤害”动作来调整电磁炮的能量值。",
        },
        机体超频: {
          图标: [
            "images/ow/hero/damage/sojourn/ultimate.png",
            "images/ow/hero/damage/sojourn/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        机动滑铲: {
          图标: [
            "images/ow/hero/damage/sojourn/ability1.png",
            "images/ow/hero/damage/sojourn/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        干扰弹: {
          图标: [
            "images/ow/hero/damage/sojourn/ability2.png",
            "images/ow/hero/damage/sojourn/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
      },
    },
    {
      名称: "士兵：76",
      标签: ["英雄", "输出"],
      提示: "被全球通缉的独行侠“士兵：76”独自一人发动了一场旨在查出守望先锋解散真相的战争。",
      图标: "images/ow/hero/damage/soldier-76/icon.png",
      生命: {
        自由: "200",
        职责: "200",
      },
      技能: {
        重型脉冲步枪: {
          图标: "images/ow/hero/damage/soldier-76/weapon.png",
          绑定: ["主要攻击模式"],
        },
        螺旋飞弹: {
          图标: [
            "images/ow/hero/damage/soldier-76/secondaryfire.png",
            "images/ow/hero/damage/soldier-76/gray/secondaryfire.png",
          ],
          绑定: ["辅助攻击模式"],
        },
        战术目镜: {
          图标: [
            "images/ow/hero/damage/soldier-76/ultimate.png",
            "images/ow/hero/damage/soldier-76/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        疾跑: {
          图标: [
            "images/ow/hero/damage/soldier-76/ability1.png",
            "images/ow/hero/damage/soldier-76/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        生物力场: {
          图标: [
            "images/ow/hero/damage/soldier-76/ability2.png",
            "images/ow/hero/damage/soldier-76/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
      },
    },
    {
      名称: "黑影",
      标签: ["英雄", "输出"],
      提示: "作为全球最臭名昭著的黑客，“黑影”利用信息与情报操控权贵。",
      图标: "images/ow/hero/damage/sombra/icon.png",
      生命: {
        自由: "200",
        职责: "200",
      },
      技能: {
        自动手枪: {
          图标: "images/ow/hero/damage/sombra/weapon.png",
          绑定: ["主要攻击模式"],
        },
        黑客入侵: {
          图标: [
            "images/ow/hero/damage/sombra/secondaryfire.png",
            "images/ow/hero/damage/sombra/gray/secondaryfire.png",
          ],
          绑定: ["辅助攻击模式"],
        },
        电磁脉冲: {
          图标: [
            "images/ow/hero/damage/sombra/ultimate.png",
            "images/ow/hero/damage/sombra/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        隐秘潜行: {
          图标: [
            "images/ow/hero/damage/sombra/ability1.png",
            "images/ow/hero/damage/sombra/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        位移传动: {
          图标: [
            "images/ow/hero/damage/sombra/ability2.png",
            "images/ow/hero/damage/sombra/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
        相时而动: {
          图标: [
            "images/ow/hero/damage/sombra/passive.png",
            "images/ow/hero/damage/sombra/gray/passive.png",
          ],
          绑定: ["被动"],
          提示: "可以透过墙体侦测到严重受伤的敌人。",
        },
      },
    },
    {
      名称: "秩序之光",
      标签: ["英雄", "输出"],
      提示: "“秩序之光”可以在真正意义上扭曲现实。通过控制高强度光束，她可以将世界改造成自己想象中的模样，实现一个完美、有序的社会。",
      图标: "images/ow/hero/damage/symmetra/icon.png",
      生命: {
        自由: "100",
        职责: "100",
        护盾: "125",
      },
      技能: {
        光子发射器: {
          图标: "images/ow/hero/damage/symmetra/weapon.png",
          绑定: ["主要攻击模式", "辅助攻击模式"],
        },
        光子屏障: {
          图标: [
            "images/ow/hero/damage/symmetra/ultimate.png",
            "images/ow/hero/damage/symmetra/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        哨戒炮: {
          图标: [
            "images/ow/hero/damage/symmetra/ability1.png",
            "images/ow/hero/damage/symmetra/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        传送面板: {
          图标: [
            "images/ow/hero/damage/symmetra/ability2.png",
            "images/ow/hero/damage/symmetra/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
      },
    },
    {
      名称: "托比昂",
      标签: ["英雄", "输出"],
      提示: "托比昂可以使用铆钉枪远距离或近距离作战，也可以布置一个炮台自动攻击敌人。他的锻造锤既可以修理炮台，也可以近身作战。他还可以射出高额伤害的熔岩陷阱持续伤害敌人。",
      图标: "images/ow/hero/damage/torbjorn/icon.png",
      生命: {
        自由: "200",
        职责: "200",
        护甲: "50",
      },
      技能: {
        铆钉枪: {
          图标: "images/ow/hero/damage/torbjorn/weapon1.png",
          绑定: ["主要攻击模式", "辅助攻击模式"],
        },
        锻造锤: {
          图标: "images/ow/hero/damage/torbjorn/weapon2.png",
          绑定: ["主要攻击模式"],
        },
        熔火核心: {
          图标: [
            "images/ow/hero/damage/torbjorn/ultimate.png",
            "images/ow/hero/damage/torbjorn/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        热力过载: {
          图标: [
            "images/ow/hero/damage/torbjorn/ability1.png",
            "images/ow/hero/damage/torbjorn/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        部署炮台: {
          图标: [
            "images/ow/hero/damage/torbjorn/ability2.png",
            "images/ow/hero/damage/torbjorn/gray/ability2.png",
          ],
          绑定: ["技能2"],
          提示: "按 互动 摧毁。部署到炮台可射击前无法主动摧毁。",
        },
      },
    },
    {
      名称: "猎空",
      标签: ["英雄", "输出"],
      提示: "前守望先锋成员“猎空”是一位可以进行时间跳跃的冒险家，为了正义而不懈努力着。",
      图标: "images/ow/hero/damage/tracer/icon.png",
      生命: {
        自由: "150",
        职责: "150",
      },
      技能: {
        脉冲双枪: {
          图标: "images/ow/hero/damage/tracer/weapon.png",
          绑定: ["主要攻击模式"],
        },
        脉冲炸弹: {
          图标: [
            "images/ow/hero/damage/tracer/ultimate.png",
            "images/ow/hero/damage/tracer/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        闪现: {
          图标: [
            "images/ow/hero/damage/tracer/ability1.png",
            "images/ow/hero/damage/tracer/gray/ability1.png",
          ],
          绑定: ["辅助攻击模式", "技能1"],
        },
        闪回: {
          图标: [
            "images/ow/hero/damage/tracer/ability2.png",
            "images/ow/hero/damage/tracer/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
      },
    },
    {
      名称: "黑百合",
      标签: ["英雄", "输出"],
      提示: "“黑百合”是一位完美的刺客：耐心、果断、无情。没有任何情感且事后毫无悔意。",
      图标: "images/ow/hero/damage/widowmaker/icon.png",
      生命: {
        自由: "175",
        职责: "175",
      },
      技能: {
        黑百合之吻: {
          图标: "images/ow/hero/damage/widowmaker/weapon.png",
          绑定: ["主要攻击模式", "辅助攻击模式"],
        },
        红外侦测: {
          图标: [
            "images/ow/hero/damage/widowmaker/ultimate.png",
            "images/ow/hero/damage/widowmaker/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        抓钩: {
          图标: [
            "images/ow/hero/damage/widowmaker/ability1.png",
            "images/ow/hero/damage/widowmaker/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        剧毒诡雷: {
          图标: [
            "images/ow/hero/damage/widowmaker/ability2.png",
            "images/ow/hero/damage/widowmaker/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
      },
    },
    {
      名称: "温斯顿",
      标签: ["英雄", "重装"],
      提示: "作为一个拥有高等智慧并被基因改造的大猩猩，温斯顿无疑是一位出色的科学家和代表着人类潜力的勇士。",
      图标: "images/ow/hero/tank/winston/icon.png",
      生命: {
        自由: "200",
        职责: "350",
        护甲: "200",
        屏障: "650",
      },
      技能: {
        特斯拉炮: {
          图标: "images/ow/hero/tank/winston/weapon.png",
          绑定: ["主要攻击模式", "辅助攻击模式"],
        },
        原始暴怒: {
          图标: [
            "images/ow/hero/tank/winston/ultimate.png",
            "images/ow/hero/tank/winston/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        喷射背包: {
          图标: [
            "images/ow/hero/tank/winston/ability1.png",
            "images/ow/hero/tank/winston/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        屏障发射器: {
          图标: [
            "images/ow/hero/tank/winston/ability2.png",
            "images/ow/hero/tank/winston/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
      },
    },
    {
      名称: "查莉娅",
      标签: ["英雄", "重装"],
      提示: "查莉娅是世界上最强壮的女运动员之一。在战争期间，为了家人、朋友和祖国，毅然放弃了个人荣誉。",
      图标: "images/ow/hero/tank/zarya/icon.png",
      生命: {
        自由: "100",
        职责: "250",
        护盾: "225",
      },
      技能: {
        粒子炮: {
          图标: "images/ow/hero/tank/zarya/weapon.png",
          绑定: ["主要攻击模式", "辅助攻击模式"],
          提示: "无法通过修改技能资源或“伤害”动作来调整粒子炮的能量值。",
        },
        重力喷涌: {
          图标: [
            "images/ow/hero/tank/zarya/ultimate.png",
            "images/ow/hero/tank/zarya/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        粒子屏障: {
          图标: [
            "images/ow/hero/tank/zarya/ability1.png",
            "images/ow/hero/tank/zarya/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        投射屏障: {
          图标: [
            "images/ow/hero/tank/zarya/ability2.png",
            "images/ow/hero/tank/zarya/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
        能量转换: {
          图标: [
            "images/ow/hero/tank/zarya/passive.png",
            "images/ow/hero/tank/zarya/gray/passive.png",
          ],
          绑定: ["被动"],
        },
      },
    },
    {
      名称: "禅雅塔",
      标签: ["英雄", "支援"],
      提示: "禅雅塔是一位游走于世界寻找灵魂升华之道的机械僧侣。据说任何有幸遇到他的人，其生命轨迹也会发生改变。",
      图标: "images/ow/hero/support/zenyatta/icon.png",
      生命: {
        自由: "50",
        职责: "50",
        护盾: "150",
      },
      技能: {
        灭: {
          图标: "images/ow/hero/support/zenyatta/weapon.png",
          绑定: ["主要攻击模式", "辅助攻击模式"],
        },
        圣: {
          图标: [
            "images/ow/hero/support/zenyatta/ultimate.png",
            "images/ow/hero/support/zenyatta/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        谐: {
          图标: [
            "images/ow/hero/support/zenyatta/ability1.png",
            "images/ow/hero/support/zenyatta/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        乱: {
          图标: [
            "images/ow/hero/support/zenyatta/ability2.png",
            "images/ow/hero/support/zenyatta/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
        蹬: {
          图标: [
            "images/ow/hero/support/zenyatta/passive.png",
            "images/ow/hero/support/zenyatta/gray/passive.png",
          ],
          绑定: ["近身攻击", "被动"],
          提示: "近身攻击伤害提高50%，击退效果大幅提高。",
        },
      },
    },
    {
      名称: "拉玛刹",
      标签: ["英雄", "重装"],
      提示: "拉玛刹有过很多身份：士兵、僧侣、革命者。如今身为“归零者”领袖的他为智械而战，不惜一切代价。",
      图标: "images/ow/hero/tank/ramattra/icon.png",
      生命: {
        自由: "300",
        职责: "450",
        屏障: "1000",
      },
      技能: {
        虚空加速器: {
          图标: "images/ow/hero/tank/ramattra/weapon1.png",
          绑定: ["主要攻击模式"],
        },
        猛拳: {
          图标: "images/ow/hero/tank/ramattra/weapon2.png",
          绑定: ["主要攻击模式"],
        },
        虚空屏障: {
          图标: [
            "images/ow/hero/tank/ramattra/secondaryfire1.png",
            "images/ow/hero/tank/ramattra/gray/secondaryfire1.png",
          ],
          绑定: ["辅助攻击模式"],
        },
        铁臂: {
          图标: [
            "images/ow/hero/tank/ramattra/secondaryfire2.png",
            "images/ow/hero/tank/ramattra/gray/secondaryfire2.png",
          ],
          绑定: ["辅助攻击模式"],
        },
        诛: {
          图标: [
            "images/ow/hero/tank/ramattra/ultimate.png",
            "images/ow/hero/tank/ramattra/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        天罚形态: {
          图标: [
            "images/ow/hero/tank/ramattra/ability1.png",
            "images/ow/hero/tank/ramattra/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        吞噬漩涡: {
          图标: [
            "images/ow/hero/tank/ramattra/ability2.png",
            "images/ow/hero/tank/ramattra/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
      },
    },
    {
      名称: "生命之梭",
      标签: ["英雄", "支援"],
      提示: "生物光技术的杰出创造者，将植物物质和光结合在一起，他梦想着治愈世界。",
      图标: "images/ow/hero/support/lifeweaver/icon.png",
      生命: {
        自由: "200",
        职责: "200",
      },
      技能: {
        愈疗灵花: {
          图标: "images/ow/hero/support/lifeweaver/weapon1.png",
          绑定: ["主要攻击模式"],
        },
        棘刺箭雨: {
          图标: "images/ow/hero/support/lifeweaver/weapon2.png",
          绑定: ["主要攻击模式"],
        },
        花瓣平台: {
          图标: [
            "images/ow/hero/support/lifeweaver/secondaryfire.png",
            "images/ow/hero/support/lifeweaver/gray/secondaryfire.png",
          ],
          绑定: ["辅助攻击模式"],
        },
        生命之树: {
          图标: [
            "images/ow/hero/support/lifeweaver/ultimate.png",
            "images/ow/hero/support/lifeweaver/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        回春疾行: {
          图标: [
            "images/ow/hero/support/lifeweaver/ability1.png",
            "images/ow/hero/support/lifeweaver/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        生命之握: {
          图标: [
            "images/ow/hero/support/lifeweaver/ability2.png",
            "images/ow/hero/support/lifeweaver/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
      },
    },
    {
      名称: "伊拉锐",
      标签: ["英雄", "支援"],
      提示: "接受过太阳丝线强化改造过的伊拉锐会用太阳之力瓦解敌人。",
      图标: "images/ow/hero/support/illari/icon.png",
      生命: {
        自由: "200",
        职责: "200",
      },
      技能: {
        阳焰步枪: {
          图标: "images/ow/hero/support/illari/weapon.png",
          绑定: ["主要攻击模式", "辅助攻击模式"],
        },
        桎梏灼日: {
          图标: [
            "images/ow/hero/support/illari/ultimate.png",
            "images/ow/hero/support/illari/gray/ultimate.png",
          ],
          绑定: ["终极技能"],
        },
        烈日冲击: {
          图标: [
            "images/ow/hero/support/illari/ability1.png",
            "images/ow/hero/support/illari/gray/ability1.png",
          ],
          绑定: ["技能1"],
        },
        治疗光塔: {
          图标: [
            "images/ow/hero/support/illari/ability2.png",
            "images/ow/hero/support/illari/gray/ability2.png",
          ],
          绑定: ["技能2"],
        },
      },
    },
  ],
  HUD位置: [
    {
      名称: "左边",
      标签: ["HUD", "位置"],
      提示: "一个HUD位置选项。",
    },
    {
      名称: "顶部",
      标签: ["HUD", "位置"],
      提示: "一个HUD位置选项。",
    },
    {
      名称: "右边",
      标签: ["HUD", "位置"],
      提示: "一个HUD位置选项。",
    },
  ],
  图标: [
    {
      名称: "箭头：向下",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/1.png", "images/ow/icon/gray/1.png"],
    },
    {
      名称: "箭头：向左",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/2.png", "images/ow/icon/gray/2.png"],
    },
    {
      名称: "箭头：向右",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/3.png", "images/ow/icon/gray/3.png"],
    },
    {
      名称: "箭头：向上",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/4.png", "images/ow/icon/gray/4.png"],
    },
    {
      名称: "星形",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/5.png", "images/ow/icon/gray/5.png"],
    },
    {
      名称: "箭矢",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/6.png", "images/ow/icon/gray/6.png"],
    },
    {
      名称: "对号",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/7.png", "images/ow/icon/gray/7.png"],
    },
    {
      名称: "圆圈",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/8.png", "images/ow/icon/gray/8.png"],
    },
    {
      名称: "梅花",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/9.png", "images/ow/icon/gray/9.png"],
    },
    {
      名称: "方块",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/10.png", "images/ow/icon/gray/10.png"],
    },
    {
      名称: "晕眩",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/11.png", "images/ow/icon/gray/11.png"],
    },
    {
      名称: "感叹号",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/12.png", "images/ow/icon/gray/12.png"],
    },
    {
      名称: "眼睛",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/13.png", "images/ow/icon/gray/13.png"],
    },
    {
      名称: "火焰",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/14.png", "images/ow/icon/gray/14.png"],
    },
    {
      名称: "旗帜",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/15.png", "images/ow/icon/gray/15.png"],
    },
    {
      名称: "光晕",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/16.png", "images/ow/icon/gray/16.png"],
    },
    {
      名称: "高兴",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/17.png", "images/ow/icon/gray/17.png"],
    },
    {
      名称: "红桃",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/18.png", "images/ow/icon/gray/18.png"],
    },
    {
      名称: "满月",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/19.png", "images/ow/icon/gray/19.png"],
    },
    {
      名称: "拒绝",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/20.png", "images/ow/icon/gray/20.png"],
    },
    {
      名称: "加号",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/21.png", "images/ow/icon/gray/21.png"],
    },
    {
      名称: "剧毒",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/22.png", "images/ow/icon/gray/22.png"],
    },
    {
      名称: "剧毒2",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/23.png", "images/ow/icon/gray/23.png"],
    },
    {
      名称: "问号",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/24.png", "images/ow/icon/gray/24.png"],
    },
    {
      名称: "辐射",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/25.png", "images/ow/icon/gray/25.png"],
    },
    {
      名称: "回收",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/26.png", "images/ow/icon/gray/26.png"],
    },
    {
      名称: "宽环",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/27.png", "images/ow/icon/gray/27.png"],
    },
    {
      名称: "细环",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/28.png", "images/ow/icon/gray/28.png"],
    },
    {
      名称: "难过",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/29.png", "images/ow/icon/gray/29.png"],
    },
    {
      名称: "骷髅",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/30.png", "images/ow/icon/gray/30.png"],
    },
    {
      名称: "黑桃",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/31.png", "images/ow/icon/gray/31.png"],
    },
    {
      名称: "螺旋",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/32.png", "images/ow/icon/gray/32.png"],
    },
    {
      名称: "停止",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/33.png", "images/ow/icon/gray/33.png"],
    },
    {
      名称: "垃圾箱",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/34.png", "images/ow/icon/gray/34.png"],
    },
    {
      名称: "警告",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/35.png", "images/ow/icon/gray/35.png"],
    },
    {
      名称: "X",
      标签: ["图标"],
      提示: "一个用于“创建图标”或“图标字符串”的图标选项。",
      图标: ["images/ow/icon/36.png", "images/ow/icon/gray/36.png"],
    },
  ],
  屏障视线检测: [
    {
      名称: "屏障不会阻挡视线",
      标签: ["视线检测", "屏障"],
      提示: "一个屏障视线检测选项。",
    },
    {
      名称: "敌方屏障阻挡视线",
      标签: ["视线检测", "屏障"],
      提示: "一个屏障视线检测选项。",
    },
    {
      名称: "所有屏障阻挡视线",
      标签: ["视线检测", "屏障"],
      提示: "一个屏障视线检测选项。",
    },
  ],
  视线检测: [
    {
      名称: "关闭",
      标签: ["视线检测"],
      提示: "一个视线检测选项。",
    },
    {
      名称: "表面",
      标签: ["视线检测"],
      提示: "一个视线检测选项。",
    },
    {
      名称: "表面及全部屏障",
      标签: ["视线检测"],
      提示: "一个视线检测选项。",
    },
    {
      名称: "表面及敌方屏障",
      标签: ["视线检测"],
      提示: "一个视线检测选项。",
    },
  ],
  地图: [
    {
      名称: "阿育陀耶",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "黑森林",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "圣诞节黑森林",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "暴雪世界",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "圣诞节暴雪世界",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "釜山",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "春节釜山城区",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "春节釜山寺院",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "城堡",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "吉拉德堡",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "万圣节吉拉德堡",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "皇家赛道",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "斗兽场",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "多拉多",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "生态监测站：南极洲",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "圣诞节生态监测站：南极洲",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "艾兴瓦尔德",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "万圣节艾兴瓦尔德",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "埃斯佩兰萨",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "花村",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "圣诞节花村",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "哈瓦那",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "好莱坞",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "万圣节好莱坞",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "“地平线”月球基地",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "伊利奥斯",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "伊利奥斯灯塔",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "伊利奥斯废墟",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "伊利奥斯深井",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "怪鼠复仇",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "渣客镇",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "铁坂",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "国王大道",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "圣诞节国王大道",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "漓江塔控制中心",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "春节漓江塔控制中心",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "漓江塔庭院",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "春节漓江塔庭院",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "漓江塔夜市",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "春节漓江塔夜市",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "漓江塔",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "春节漓江塔",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "马莱温多",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "中城",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "墓园",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "尼泊尔",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "尼泊尔圣所",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "尼泊尔圣坛",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "尼泊尔村庄",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "圣诞节尼泊尔村庄",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "新皇后街",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "努巴尼",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "绿洲城",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "绿洲城中心",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "绿洲城花园",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "绿洲城大学",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "帕拉伊苏",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "巴黎",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "佩特拉",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "训练靶场",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "里阿尔托",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "66号公路",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "阿努比斯神殿",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "沃斯卡娅工业区",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "监测站：直布罗陀",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "地图工坊室内",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "地图工坊空地",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "地图工坊空地（夜间）",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "地图工坊绿幕",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "地图工坊岛屿",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "地图工坊岛屿（夜间）",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "香巴里寺院",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "爪兰蒂斯",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "南极半岛",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "新渣客城",
      标签: ["地图"],
      提示: "一张地图。",
    },
    {
      名称: "苏拉瓦萨",
      标签: ["地图"],
      提示: "一张地图。",
    },
  ],
  模式: [
    {
      名称: "攻防作战",
      标签: ["模式"],
      提示: "一个模式选项。",
    },
    {
      名称: "赏金猎手",
      标签: ["模式"],
      提示: "一个模式选项。",
    },
    {
      名称: "占领要点",
      标签: ["模式"],
      提示: "一个模式选项。",
    },
    {
      名称: "勇夺锦旗",
      标签: ["模式"],
      提示: "一个模式选项。",
    },
    {
      名称: "决斗先锋",
      标签: ["模式"],
      提示: "一个模式选项。",
    },
    {
      名称: "运载目标",
      标签: ["模式"],
      提示: "一个模式选项。",
    },
    {
      名称: "死斗",
      标签: ["模式"],
      提示: "一个模式选项。",
    },
    {
      名称: "融冰决斗",
      标签: ["模式"],
      提示: "一个模式选项。",
    },
    {
      名称: "攻击护送",
      标签: ["模式"],
      提示: "一个模式选项。",
    },
    {
      名称: "怪鼠复仇",
      标签: ["模式"],
      提示: "一个模式选项。",
    },
    {
      名称: "雪球攻势",
      标签: ["模式"],
      提示: "一个模式选项。",
    },
    {
      名称: "训练靶场",
      标签: ["模式"],
      提示: "一个模式选项。",
    },
    {
      名称: "机动推进",
      标签: ["模式"],
      提示: "一个模式选项。",
    },
    {
      名称: "突击模式",
      标签: ["模式"],
      提示: "一个模式选项。",
    },
    {
      名称: "雪球死斗",
      标签: ["模式"],
      提示: "一个模式选项。",
    },
    {
      名称: "团队死斗",
      标签: ["模式"],
      提示: "一个模式选项。",
    },
    {
      名称: "雪域狩猎",
      标签: ["模式"],
      提示: "一个模式选项。",
    },
    {
      名称: "路霸的小鱿抓抓乐",
      标签: ["模式"],
      提示: "一个模式选项。",
    },
    {
      名称: "星际守望：银河救兵",
      标签: ["模式"],
      提示: "一个模式选项。",
    },
    {
      名称: "闪点作战",
      标签: ["模式"],
      提示: "一个模式选项。",
    },
  ],
  相反运动: [
    {
      名称: "取消相反运动",
      标签: ["运动", "行为"],
      提示: "一个用于“施加推力”的相反运动行为选项。",
    },
    {
      名称: "取消相反运动XYZ",
      标签: ["运动", "行为"],
      提示: "一个用于“施加推力”的相反运动行为选项。",
    },
    {
      名称: "合并相反运动",
      标签: ["运动", "行为"],
      提示: "一个用于“施加推力”的相反运动行为选项。",
    },
  ],
  操作: [
    {
      名称: "加",
      标签: ["操作"],
      提示: "一个变量操作选项。",
    },
    {
      名称: "减",
      标签: ["操作"],
      提示: "一个变量操作选项。",
    },
    {
      名称: "乘",
      标签: ["操作"],
      提示: "一个变量操作选项。",
    },
    {
      名称: "除",
      标签: ["操作"],
      提示: "一个变量操作选项。",
    },
    {
      名称: "最小",
      标签: ["操作"],
      提示: "一个变量操作选项。",
    },
    {
      名称: "最大",
      标签: ["操作"],
      提示: "一个变量操作选项。",
    },
    {
      名称: "根据值从数组中移除",
      标签: ["操作"],
      提示: "一个变量操作选项。",
    },
    {
      名称: "根据索引从数组中移除",
      标签: ["操作"],
      提示: "一个变量操作选项。",
    },
    {
      名称: "添加至数组",
      标签: ["操作"],
      提示: "一个变量操作选项。",
    },
    {
      名称: "余数",
      标签: ["操作"],
      提示: "一个变量操作选项。",
    },
    {
      名称: "乘方",
      标签: ["操作"],
      提示: "一个变量操作选项。",
    },
  ],
  轮廓: [
    {
      名称: "默认",
      标签: ["轮廓"],
      提示: "一个用于“开始强制设置轮廓”的轮廓类型选项。",
    },
    {
      名称: "遮蔽",
      标签: ["轮廓"],
      提示: "一个用于“开始强制设置轮廓”的类型选项。",
    },
    {
      名称: "总是",
      标签: ["轮廓"],
      提示: "一个用于“开始强制设置轮廓”的类型选项。",
    },
  ],
  弹道爆炸声音: [
    {
      名称: "爆炸声音",
      标签: ["弹道爆炸声音", "基础声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "状态爆炸声音",
      标签: ["弹道爆炸声音", "基础声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "环状爆炸声音",
      标签: ["弹道爆炸声音", "基础声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "安娜生物手雷爆炸声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "艾什延时雷管爆炸声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "巴蒂斯特生化榴弹枪爆炸声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "“堡垒”坦克炮爆炸声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "布丽吉塔流星飞锤范围治疗声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "布丽吉塔恢复包击中声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "布丽吉塔恢复包护甲声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "D.Va微型飞弹爆炸声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "D.Va自毁爆炸声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "“末日铁拳”上勾重拳跳跃声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "“末日铁拳”上勾重拳击中声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "“末日铁拳”毁天灭地击中声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "“回声”黏性炸弹爆炸声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "“狂鼠”榴弹发射器爆炸声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "“狂鼠”震荡地雷爆炸声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "“狂鼠”炸弹轮胎爆炸声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "半藏音初始脉冲声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "卢西奥音障施放声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "卡西迪闪光弹爆炸声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "莫伊拉消散消失声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "莫伊拉消散重现声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "奥丽莎站住别动内爆声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "“法老之鹰”火箭发射器爆炸声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "“法老之鹰”震荡冲击声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "“法老之鹰”火箭弹幕爆炸声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "莱因哈特烈焰打击目标击中声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "“西格玛”超能之球内爆声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "“西格玛”质量吸附击中声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "“黑影”标志声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "“黑影”位移传动消失声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "“黑影”位移传动重现声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "“黑影”电磁脉冲爆炸声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "“秩序之光”传送面板重现声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "“猎空”闪回消失声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "“猎空”闪回重现声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "“黑百合”剧毒诡雷爆炸声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "温斯顿喷射背包着陆声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "“破坏球”重力坠击击中声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "“破坏球”地雷禁区爆炸声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
    {
      名称: "查莉娅粒子炮爆炸声音",
      标签: ["弹道爆炸声音", "爆炸声音"],
      提示: "一个弹道爆炸声音选项。",
      图标: "",
    },
  ],
  弹道爆炸效果: [
    {
      名称: "有益爆炸",
      标签: ["弹道爆炸", "基础效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "有害爆炸",
      标签: ["弹道爆炸", "基础效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "环状爆炸",
      标签: ["弹道爆炸", "基础效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "布丽吉塔恢复包击中效果",
      标签: ["弹道爆炸", "能量爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "布丽吉塔恢复包护甲效果",
      标签: ["弹道爆炸", "能量爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "布丽吉塔流星飞锤范围治疗效果",
      标签: ["弹道爆炸", "能量爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "D.Va微型飞弹爆炸效果",
      标签: ["弹道爆炸", "能量爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "D.Va自毁爆炸效果",
      标签: ["弹道爆炸", "能量爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "“回声”黏性炸弹爆炸效果",
      标签: ["弹道爆炸", "能量爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "半藏音初始脉冲效果",
      标签: ["弹道爆炸", "能量爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "卢西奥音障施放效果",
      标签: ["弹道爆炸", "能量爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "莫伊拉消散消失效果",
      标签: ["弹道爆炸", "能量爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "莫伊拉消散重现效果",
      标签: ["弹道爆炸", "能量爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "奥丽莎站住别动内爆效果",
      标签: ["弹道爆炸", "能量爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "“西格玛”超能之球内爆效果",
      标签: ["弹道爆炸", "能量爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "“黑影”标志效果",
      标签: ["弹道爆炸", "能量爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "“黑影”位移传动消失效果",
      标签: ["弹道爆炸", "能量爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "“黑影”位移传动重现效果",
      标签: ["弹道爆炸", "能量爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "“黑影”电磁脉冲爆炸效果",
      标签: ["弹道爆炸", "能量爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "“秩序之光”传送面板重现效果",
      标签: ["弹道爆炸", "能量爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "“猎空”闪回消失效果",
      标签: ["弹道爆炸", "能量爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "“猎空“闪回重现效果",
      标签: ["弹道爆炸", "能量爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "查莉娅粒子炮爆炸效果",
      标签: ["弹道爆炸", "能量爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "安娜生物手雷爆炸效果",
      标签: ["弹道爆炸", "运动爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "艾什延时雷管爆炸效果",
      标签: ["弹道爆炸", "运动爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "巴蒂斯特生化榴弹枪爆炸效果",
      标签: ["弹道爆炸", "运动爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "“堡垒”坦克炮爆炸效果",
      标签: ["弹道爆炸", "运动爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "“末日铁拳”上勾重拳跳跃效果",
      标签: ["弹道爆炸", "运动爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "“末日铁拳”上勾重拳击中效果",
      标签: ["弹道爆炸", "运动爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "“末日铁拳”毁天灭地击中效果",
      标签: ["弹道爆炸", "运动爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "“狂鼠”榴弹发射器爆炸效果",
      标签: ["弹道爆炸", "运动爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "“狂鼠”震荡地雷爆炸效果",
      标签: ["弹道爆炸", "运动爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "“狂鼠”炸弹轮胎爆炸效果",
      标签: ["弹道爆炸", "运动爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "卡西迪闪光弹爆炸效果",
      标签: ["弹道爆炸", "运动爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "“法老之鹰”火箭发射器爆炸效果",
      标签: ["弹道爆炸", "运动爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "“法老之鹰”震荡冲击效果",
      标签: ["弹道爆炸", "运动爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "“法老之鹰”火箭弹幕爆炸效果",
      标签: ["弹道爆炸", "运动爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "莱因哈特烈焰打击目标击中效果",
      标签: ["弹道爆炸", "运动爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "“西格玛”质量吸附击中效果",
      标签: ["弹道爆炸", "运动爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "“黑百合“剧毒诡雷爆炸效果",
      标签: ["弹道爆炸", "运动爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "温斯顿喷射背包着陆效果",
      标签: ["弹道爆炸", "运动爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "“破坏球”重力坠击击中效果",
      标签: ["弹道爆炸", "运动爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
    {
      名称: "“破坏球”地雷禁区爆炸效果",
      标签: ["弹道爆炸", "运动爆炸效果"],
      提示: "一个弹道爆炸效果选项。",
      图标: "",
    },
  ],
  弹道生命行为: [
    {
      名称: "伤害",
      标签: ["弹道", "生命", "行为"],
      提示: "一个弹道生命行为选项。",
      图标: "",
    },
    {
      名称: "治疗",
      标签: ["弹道", "生命", "行为"],
      提示: "一个弹道生命行为选项。",
      图标: "",
    },
  ],
  弹道: [
    {
      名称: "球弹道",
      标签: ["弹道", "基础弹道"],
      提示: "一个弹道选项。",
      图标: "",
    },
    {
      名称: "巴蒂斯特生化榴弹枪",
      标签: ["弹道", "扩展弹道"],
      提示: "一个弹道选项。",
      图标: "",
    },
    {
      名称: "“堡垒”A-36战术榴弹",
      标签: ["弹道", "扩展弹道"],
      提示: "一个弹道选项。",
      图标: "",
    },
    {
      名称: "“回声”黏性炸弹",
      标签: ["弹道", "扩展弹道"],
      提示: "一个弹道选项。",
      图标: "",
    },
    {
      名称: "源氏“镖”",
      标签: ["弹道", "扩展弹道"],
      提示: "一个弹道选项。",
      图标: "",
    },
    {
      名称: "卢西奥音速扩音器",
      标签: ["弹道", "扩展弹道"],
      提示: "一个弹道选项。",
      图标: "",
    },
    {
      名称: "美冰锥",
      标签: ["弹道", "扩展弹道"],
      提示: "一个弹道选项。",
      图标: "",
    },
    {
      名称: "“天使”天使冲击枪",
      标签: ["弹道", "扩展弹道"],
      提示: "一个弹道选项。",
      图标: "",
    },
    {
      名称: "莫伊拉伤害生化之球",
      标签: ["弹道", "扩展弹道"],
      提示: "一个弹道选项。",
      图标: "",
    },
    {
      名称: "莫伊拉治疗生化之球",
      标签: ["弹道", "扩展弹道"],
      提示: "一个弹道选项。",
      图标: "",
    },
    {
      名称: "奥丽莎聚变驱动器",
      标签: ["弹道", "扩展弹道"],
      提示: "一个弹道选项。",
      图标: "",
    },
    {
      名称: "“法老之鹰”火箭",
      标签: ["弹道", "扩展弹道"],
      提示: "一个弹道选项。",
      图标: "",
    },
    {
      名称: "莱因哈特烈焰打击",
      标签: ["弹道", "扩展弹道"],
      提示: "一个弹道选项。",
      图标: "",
    },
    {
      名称: "“路霸”爆裂枪",
      标签: ["弹道", "扩展弹道"],
      提示: "一个弹道选项。",
      图标: "",
    },
    {
      名称: "“路霸”爆裂枪废铁球",
      标签: ["弹道", "扩展弹道"],
      提示: "一个弹道选项。",
      图标: "",
    },
    {
      名称: "西格玛超能之球",
      标签: ["弹道", "扩展弹道"],
      提示: "一个弹道选项。",
      图标: "",
    },
    {
      名称: "“秩序之光”光子发射器",
      标签: ["弹道", "扩展弹道"],
      提示: "一个弹道选项。",
      图标: "",
    },
    {
      名称: "拉玛刹吞噬漩涡能量球",
      标签: ["弹道", "扩展弹道"],
      提示: "一个弹道选项。",
      图标: "",
    },
    {
      名称: "查莉娅重力喷涌",
      标签: ["弹道", "扩展弹道"],
      提示: "一个弹道选项。",
      图标: "",
    },
    {
      名称: "查莉娅粒子炮",
      标签: ["弹道", "扩展弹道"],
      提示: "一个弹道选项。",
      图标: "",
    },
  ],
  加速刷新: [
    {
      名称: "无",
      标签: ["加速", "刷新"],
      提示: "一个仅用于“开始加速”的刷新选项。",
    },
    {
      名称: "方向，速率，及最大速度",
      标签: ["加速", "刷新"],
      提示: "一个仅用于“开始加速”的刷新选项。",
    },
  ],
  助攻刷新: [
    {
      名称: "无",
      标签: ["刷新", "助攻"],
      提示: "一个仅用于“开始助攻”的刷新选项。",
    },
    {
      名称: "助攻者和目标",
      标签: ["刷新", "助攻"],
      提示: "一个仅用于“开始助攻”的刷新选项。",
    },
  ],
  追踪频率刷新: [
    {
      名称: "全部禁用",
      标签: ["刷新", "追踪", "速率"],
      提示: "一个仅用于“追踪全局变量频率”或“追踪玩家变量频率”的刷新选项。",
    },
    {
      名称: "速率及最终值",
      标签: ["刷新", "追踪", "速率"],
      提示: "一个仅用于“追踪全局变量频率”或“追踪玩家变量频率”的刷新选项。",
    },
  ],
  持续追踪刷新: [
    {
      名称: "全部禁用",
      标签: ["刷新", "追踪", "持续时间"],
      提示: "一个仅用于“持续追踪全局变量”或“持续追踪玩家变量”的刷新选项。",
    },
    {
      名称: "终点及持续时间",
      标签: ["刷新", "追踪", "持续时间"],
      提示: "一个仅用于“持续追踪全局变量”或“持续追踪玩家变量”的刷新选项。",
    },
  ],
  伤害调整刷新: [
    {
      名称: "无",
      标签: ["刷新", "伤害调整"],
      提示: "一个仅用于“开始伤害调整”的刷新选项。",
    },
    {
      名称: "受伤害者和伤害者",
      标签: ["刷新", "伤害调整"],
      提示: "一个仅用于“开始伤害调整”的刷新选项。",
    },
    {
      名称: "受伤害者，伤害者及伤害百分比",
      标签: ["刷新", "伤害调整"],
      提示: "一个仅用于“开始伤害调整”的刷新选项。",
    },
  ],
  效果刷新: [
    {
      名称: "无",
      标签: ["刷新", "效果"],
      提示: "一个仅用于“创建效果”或“创建光束效果”的刷新选项。",
    },
    {
      名称: "可见",
      标签: ["刷新", "效果"],
      提示: "一个仅用于“创建效果”或“创建光束效果”的刷新选项。",
    },
    {
      名称: "颜色",
      标签: ["刷新", "效果"],
      提示: "一个仅用于“创建效果”或“创建光束效果”的刷新选项。",
    },
    {
      名称: "可见和颜色",
      标签: ["刷新", "效果"],
      提示: "一个仅用于“创建效果”或“创建光束效果”的刷新选项。",
    },
    {
      名称: "位置和半径",
      标签: ["刷新", "效果"],
      提示: "一个仅用于“创建效果”或“创建光束效果”的刷新选项。",
    },
    {
      名称: "位置，半径和颜色",
      标签: ["刷新", "效果"],
      提示: "一个仅用于“创建效果”或“创建光束效果”的刷新选项。",
    },
    {
      名称: "可见，位置和半径",
      标签: ["刷新", "效果"],
      提示: "一个仅用于“创建效果”或“创建光束效果”的刷新选项。",
    },
    {
      名称: "可见，位置，半径和颜色",
      标签: ["刷新", "效果"],
      提示: "一个仅用于“创建效果”或“创建光束效果”的刷新选项。",
    },
  ],
  朝向刷新: [
    {
      名称: "无",
      标签: ["刷新", "朝向"],
      提示: "一个仅用于“开始朝向”的刷新选项。",
    },
    {
      名称: "方向及角速率",
      标签: ["刷新", "朝向"],
      提示: "一个仅用于“开始朝向”的刷新选项。",
    },
  ],
  友善刷新: [
    {
      名称: "无",
      标签: ["刷新", "友善"],
      提示: "一个友善刷新选项。",
    },
    {
      名称: "可见",
      标签: ["刷新", "友善"],
      提示: "一个友善刷新选项。",
    },
    {
      名称: "友善",
      标签: ["刷新", "友善"],
      提示: "一个友善刷新选项。",
    },
    {
      名称: "可见，友善",
      标签: ["刷新", "友善"],
      提示: "一个友善刷新选项。",
    },
    {
      名称: "位置，方向和大小",
      标签: ["刷新", "友善"],
      提示: "一个友善刷新选项。",
    },
    {
      名称: "友善，位置，方向和大小",
      标签: ["刷新", "友善"],
      提示: "一个友善刷新选项。",
    },
    {
      名称: "可见，友善，位置，方向和大小",
      标签: ["刷新", "友善"],
      提示: "一个友善刷新选项。",
    },
  ],
  治疗调整刷新: [
    {
      名称: "无",
      标签: ["刷新", "治疗调整"],
      提示: "一个仅用于“开始治疗调整”的刷新选项。",
    },
    {
      名称: "受治疗者和治疗者",
      标签: ["刷新", "治疗调整"],
      提示: "一个仅用于“开始治疗调整”的刷新选项。",
    },
    {
      名称: "受治疗者，治疗者及治疗百分比",
      标签: ["刷新", "治疗调整"],
      提示: "一个仅用于“开始治疗调整”的刷新选项。",
    },
  ],
  HUD进度条刷新: [
    {
      名称: "无",
      标签: ["刷新", "HUD", "进度条"],
      提示: "一个仅用于“创建进度条HUD文本”的刷新选项。",
    },
    {
      名称: "可见",
      标签: ["刷新", "HUD", "进度条"],
      提示: "一个仅用于“创建进度条HUD文本”的刷新选项。",
    },
    {
      名称: "颜色",
      标签: ["刷新", "HUD", "进度条"],
      提示: "一个仅用于“创建进度条HUD文本”的刷新选项。",
    },
    {
      名称: "可见和颜色",
      标签: ["刷新", "HUD", "进度条"],
      提示: "一个仅用于“创建进度条HUD文本”的刷新选项。",
    },
    {
      名称: "值",
      标签: ["刷新", "HUD", "进度条"],
      提示: "一个仅用于“创建进度条HUD文本”的刷新选项。",
    },
    {
      名称: "值和颜色",
      标签: ["刷新", "HUD", "进度条"],
      提示: "一个仅用于“创建进度条HUD文本”的刷新选项。",
    },
    {
      名称: "可见和值",
      标签: ["刷新", "HUD", "进度条"],
      提示: "一个仅用于“创建进度条HUD文本”的刷新选项。",
    },
    {
      名称: "可见，值和颜色",
      标签: ["刷新", "HUD", "进度条"],
      提示: "一个仅用于“创建进度条HUD文本”的刷新选项。",
    },
  ],
  HUD文本刷新: [
    {
      名称: "无",
      标签: ["刷新", "HUD", "文本"],
      提示: "一个仅用于“创建HUD文本”的刷新选项。",
    },
    {
      名称: "可见",
      标签: ["刷新", "HUD", "文本"],
      提示: "一个仅用于“创建HUD文本”的刷新选项。",
    },
    {
      名称: "颜色",
      标签: ["刷新", "HUD", "文本"],
      提示: "一个仅用于“创建HUD文本”的刷新选项。",
    },
    {
      名称: "可见和颜色",
      标签: ["刷新", "HUD", "文本"],
      提示: "一个仅用于“创建HUD文本”的刷新选项。",
    },
    {
      名称: "字符串",
      标签: ["刷新", "HUD", "文本"],
      提示: "一个仅用于“创建HUD文本”的刷新选项。",
    },
    {
      名称: "字符串和颜色",
      标签: ["刷新", "HUD", "文本"],
      提示: "一个仅用于“创建HUD文本”的刷新选项。",
    },
    {
      名称: "可见和字符串",
      标签: ["刷新", "HUD", "文本"],
      提示: "一个仅用于“创建HUD文本”的刷新选项。",
    },
    {
      名称: "可见，字符串和颜色",
      标签: ["刷新", "HUD", "文本"],
      提示: "一个仅用于“创建HUD文本”的刷新选项。",
    },
    {
      名称: "可见性和排序",
      标签: ["刷新", "HUD", "文本"],
      提示: "一个仅用于“创建HUD文本”的刷新选项。",
    },
    {
      名称: "可见，排序规则和颜色",
      标签: ["刷新", "HUD", "文本"],
      提示: "一个仅用于“创建HUD文本”的刷新选项。",
    },
    {
      名称: "可见性，排序规则和字符串",
      标签: ["刷新", "HUD", "文本"],
      提示: "一个仅用于“创建HUD文本”的刷新选项。",
    },
    {
      名称: "可见，排序规则，字符串和颜色",
      标签: ["刷新", "HUD", "文本"],
      提示: "一个仅用于“创建HUD文本”的刷新选项。",
    },
    {
      名称: "排序",
      标签: ["刷新", "HUD", "文本"],
      提示: "一个仅用于“创建HUD文本”的刷新选项。",
    },
    {
      名称: "排序规则和颜色",
      标签: ["刷新", "HUD", "文本"],
      提示: "一个仅用于“创建HUD文本”的刷新选项。",
    },
    {
      名称: "排序规则和字符串",
      标签: ["刷新", "HUD", "文本"],
      提示: "一个仅用于“创建HUD文本”的刷新选项。",
    },
    {
      名称: "排序规则，字符串和颜色",
      标签: ["刷新", "HUD", "文本"],
      提示: "一个仅用于“创建HUD文本”的刷新选项。",
    },
  ],
  图标刷新: [
    {
      名称: "无",
      标签: ["刷新", "图标"],
      提示: "一个图标刷新选项。",
    },
    {
      名称: "可见",
      标签: ["刷新", "图标"],
      提示: "一个图标刷新选项。",
    },
    {
      名称: "颜色",
      标签: ["刷新", "图标"],
      提示: "一个图标刷新选项。",
    },
    {
      名称: "可见和颜色",
      标签: ["刷新", "图标"],
      提示: "一个图标刷新选项。",
    },
    {
      名称: "可见和位置",
      标签: ["刷新", "图标"],
      提示: "一个图标刷新选项。",
    },
    {
      名称: "可见，位置和颜色",
      标签: ["刷新", "图标"],
      提示: "一个图标刷新选项。",
    },
    {
      名称: "位置",
      标签: ["刷新", "图标"],
      提示: "一个图标刷新选项。",
    },
    {
      名称: "位置和颜色",
      标签: ["刷新", "图标"],
      提示: "一个图标刷新选项。",
    },
  ],
  地图进度条刷新: [
    {
      名称: "无",
      标签: ["刷新", "地图", "进度条"],
      提示: "一个仅用于“创建进度条地图文本”的刷新选项。",
    },
    {
      名称: "可见",
      标签: ["刷新", "地图", "进度条"],
      提示: "一个仅用于“创建进度条地图文本”的刷新选项。",
    },
    {
      名称: "颜色",
      标签: ["刷新", "地图", "进度条"],
      提示: "一个仅用于“创建进度条地图文本”的刷新选项。",
    },
    {
      名称: "可见和颜色",
      标签: ["刷新", "地图", "进度条"],
      提示: "一个仅用于“创建进度条地图文本”的刷新选项。",
    },
    {
      名称: "值",
      标签: ["刷新", "地图", "进度条"],
      提示: "一个仅用于“创建进度条地图文本”的刷新选项。",
    },
    {
      名称: "值和颜色",
      标签: ["刷新", "地图", "进度条"],
      提示: "一个仅用于“创建进度条地图文本”的刷新选项。",
    },
    {
      名称: "可见和值",
      标签: ["刷新", "地图", "进度条"],
      提示: "一个仅用于“创建进度条地图文本”的刷新选项。",
    },
    {
      名称: "可见，值和颜色",
      标签: ["刷新", "地图", "进度条"],
      提示: "一个仅用于“创建进度条地图文本”的刷新选项。",
    },
    {
      名称: "可见和位置",
      标签: ["刷新", "地图", "进度条"],
      提示: "一个仅用于“创建进度条地图文本”的刷新选项。",
    },
    {
      名称: "可见，位置和颜色",
      标签: ["刷新", "地图", "进度条"],
      提示: "一个仅用于“创建进度条地图文本”的刷新选项。",
    },
    {
      名称: "位置",
      标签: ["刷新", "地图", "进度条"],
      提示: "一个仅用于“创建进度条地图文本”的刷新选项。",
    },
    {
      名称: "位置和颜色",
      标签: ["刷新", "地图", "进度条"],
      提示: "一个仅用于“创建进度条地图文本”的刷新选项。",
    },
    {
      名称: "位置和值",
      标签: ["刷新", "地图", "进度条"],
      提示: "一个仅用于“创建进度条地图文本”的刷新选项。",
    },
    {
      名称: "位置，值和颜色",
      标签: ["刷新", "地图", "进度条"],
      提示: "一个仅用于“创建进度条地图文本”的刷新选项。",
    },
    {
      名称: "可见，位置和值",
      标签: ["刷新", "地图", "进度条"],
      提示: "一个仅用于“创建进度条地图文本”的刷新选项。",
    },
    {
      名称: "可见，位置，值和颜色",
      标签: ["刷新", "地图", "进度条"],
      提示: "一个仅用于“创建进度条地图文本”的刷新选项。",
    },
  ],
  地图文本刷新: [
    {
      名称: "无",
      标签: ["刷新", "地图", "文本"],
      提示: "一个仅用于“创建地图文本”的刷新选项。",
    },
    {
      名称: "可见",
      标签: ["刷新", "地图", "文本"],
      提示: "一个仅用于“创建地图文本”的刷新选项。",
    },
    {
      名称: "颜色",
      标签: ["刷新", "地图", "文本"],
      提示: "一个仅用于“创建地图文本”的刷新选项。",
    },
    {
      名称: "可见和颜色",
      标签: ["刷新", "地图", "文本"],
      提示: "一个仅用于“创建地图文本”的刷新选项。",
    },
    {
      名称: "字符串",
      标签: ["刷新", "地图", "文本"],
      提示: "一个仅用于“创建地图文本”的刷新选项。",
    },
    {
      名称: "字符串和颜色",
      标签: ["刷新", "地图", "文本"],
      提示: "一个仅用于“创建地图文本”的刷新选项。",
    },
    {
      名称: "可见和字符串",
      标签: ["刷新", "地图", "文本"],
      提示: "一个仅用于“创建地图文本”的刷新选项。",
    },
    {
      名称: "可见，字符串和颜色",
      标签: ["刷新", "地图", "文本"],
      提示: "一个仅用于“创建地图文本”的刷新选项。",
    },
    {
      名称: "可见和位置",
      标签: ["刷新", "地图", "文本"],
      提示: "一个仅用于“创建地图文本”的刷新选项。",
    },
    {
      名称: "可见，位置和颜色",
      标签: ["刷新", "地图", "文本"],
      提示: "一个仅用于“创建地图文本”的刷新选项。",
    },
    {
      名称: "可见，位置和字符串",
      标签: ["刷新", "地图", "文本"],
      提示: "一个仅用于“创建地图文本”的刷新选项。",
    },
    {
      名称: "可见，位置，字符串和颜色",
      标签: ["刷新", "地图", "文本"],
      提示: "一个仅用于“创建地图文本”的刷新选项。",
    },
  ],
  阈值刷新: [
    {
      名称: "无",
      标签: ["刷新", "阈值"],
      提示: "一个仅用于“开始定向阈值”的刷新选项。",
    },
    {
      名称: "方向和幅度",
      标签: ["刷新", "阈值"],
      提示: "一个仅用于“开始定向阈值”的刷新选项。",
    },
  ],
  相对: [
    {
      名称: "至地图",
      标签: ["坐标", "参照"],
      提示: "一个坐标相对选项。",
    },
    {
      名称: "至玩家",
      标签: ["坐标", "参照"],
      提示: "一个坐标相对选项。",
    },
  ],
  取整: [
    {
      名称: "上",
      标签: ["取整"],
      提示: "一个取整方式选项。",
    },
    {
      名称: "下",
      标签: ["取整"],
      提示: "一个取整方式选项。",
    },
    {
      名称: "至最近",
      标签: ["取整"],
      提示: "一个取整方式选项。",
    },
  ],
  状态: [
    {
      名称: "沉睡",
      标签: ["状态"],
      提示: "一种玩家状态选项。",
    },
    {
      名称: "点燃",
      标签: ["状态"],
      提示: "一种玩家状态选项。",
    },
    {
      名称: "冰冻",
      标签: ["状态"],
      提示: "一种玩家状态选项。",
    },
    {
      名称: "被入侵",
      标签: ["状态"],
      提示: "一种玩家状态选项。",
    },
    {
      名称: "无敌",
      标签: ["状态"],
      提示: "一种玩家状态选项。",
    },
    {
      名称: "击倒",
      标签: ["状态"],
      提示: "一种玩家状态选项。",
    },
    {
      名称: "相移",
      标签: ["状态"],
      提示: "一种玩家状态选项。",
    },
    {
      名称: "定身",
      标签: ["状态"],
      提示: "一种玩家状态选项。",
    },
    {
      名称: "击晕",
      标签: ["状态"],
      提示: "一种玩家状态选项。",
    },
    {
      名称: "无法杀死",
      标签: ["状态"],
      提示: "一种玩家状态选项。",
    },
  ],
  字符串: [
    {
      名称: '""',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"*"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"----------"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"#{0}"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"-> {0}"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"<-> {0}"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"<- {0}"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0} ->"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0} <->"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0} <-"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0} -> {1}"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0} - {1}"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0} != {1}"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0} * {1}"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0} / {1}"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0} + {1}"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0} <-> {1}"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0} <- {1}"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0} <= {1}"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0} < {1}"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0} == {1}"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0} = {1}"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0} >= {1}"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0} > {1}"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0} {1}"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0} : {1} : {2}"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0} {1} {2}"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"({0})"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"¡{0}!"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"¿{0}?"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0} 米"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0} 米/秒"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0}%"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0}:"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0}:{1}"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0}和{1}"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0}对阵{1}"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0}秒"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0}！"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0}！！"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0}！！！"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0}，{1}"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0}，{1}和{2}"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0}：{1}"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0}：{1}和{2}"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0}？"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0}？？"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"{0}？？？"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"！"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"！！"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"！！！"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"……"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"？"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"？？"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"？？？"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"技能"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"技能1"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"技能2"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"警报"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"存活"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"盟友"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"弹药"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"角度"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"进攻"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已进攻"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在进攻"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"尝试"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"平均"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"躲避"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已躲避"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在躲避"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"后"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"差"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"屏蔽"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已屏蔽"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在屏蔽"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"最佳"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"优秀"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"加注"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"阻挡"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已阻挡"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在阻挡"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"蓝色"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"奖励"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"首领"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已购买"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"建造"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在建造"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已建造"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"点燃"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在点燃"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已点燃"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"购买"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在购买"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"夺取"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已夺取"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在夺取"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"危险"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"中"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"接受挑战"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"魅力"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"追击"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已追击"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在追击"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"检查点"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"云朵"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"梅花"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"连击"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"到这儿来"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"条件"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"恭喜"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"连接"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已连接"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在连接"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"建筑"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"控制点"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"冷却时间"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"腐化"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已腐化"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在腐化"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"货币"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"严重"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"蹲下"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已蹲下"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在蹲下"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"当前"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"当前盟友"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"当前尝试"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"当前检查点"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"当前敌人"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"当前形态"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"当前游戏"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"当前英雄"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"当前人质"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"当前等级"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"当前任务"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"当前对象"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"当前目标点"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"当前阶段"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"当前玩家"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"当前回合"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"当前目标"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"当前升级"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"伤害"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已伤害"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在伤害"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已死亡"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"发牌"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在发牌"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已发牌"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"牌堆"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"战败"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"防守"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已防守"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在防守"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"防御"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"送达"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已送达"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在送达"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"深度"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"干扰"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已干扰"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在干扰"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"摧毁"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已摧毁"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在摧毁"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"探测"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"被探测"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在探测"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"灵巧"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"方块"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"死亡"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"弃牌"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已弃牌"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在弃牌"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"断开"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已断开"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在断开"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"距离"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"躲闪"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已躲闪"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在躲闪"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"罩子"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"下"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"下载"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已下载"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在下载"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"平局"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在抽牌"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已抽牌"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"掉落"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已掉落"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在掉落"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在死亡"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"东"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"消灭"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已消灭"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在消灭"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"敌人"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"进入"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"护送"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已护送"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在护送"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"离开"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"经验值"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"极端"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"面向"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在面向"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已失败"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"即将失败"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"失败"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"跌落"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已跌落"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在跌落"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"远"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"快"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"较快"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"最快"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"失误"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"最终"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"最终盟友"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"最终尝试"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"最终检查点"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"最终敌人"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"最终形态"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"最终游戏"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"最终英雄"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"最终人质"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"最终物品"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"最终等级"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"最终任务"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"最终对象"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"最终目标点"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"最终阶段"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"最终玩家"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"最终回合"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"最终目标"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"最终时间"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"最终升级"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"寻找"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在寻找"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"结束"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已结束"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在结束"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已飞行"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"飞行"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在飞行"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"收起"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已收起"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在收起"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"表格"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"前"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已找到"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"冰冻"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在冰冻"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已冰冻"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"游戏"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"战败场数"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"胜利场数"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"前往"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"终点"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在前往"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"好"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"好运"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"再见"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"绿色"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"有罪"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"入侵"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已入侵"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在入侵"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"手牌"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"治疗"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已治疗"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"治疗者"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在治疗"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"红桃"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"心"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"高度"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"问候"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"求助"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"此处"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"英雄"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已隐藏"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"隐藏"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在隐藏"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"最高得分"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"击中"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在击中"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"嗯"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"人质"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"哈"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"狩猎"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已狩猎 "',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"猎人"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在狩猎"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"我放弃了"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"我尽力了"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"在视野中"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"收入"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在前来"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"初始"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"初始盟友"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"初始尝试"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"初始检查点"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"初始敌人"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"初始形态"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"初始游戏"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"初始英雄"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"初始人质"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"初始等级"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"初始任务"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"初始对象"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"初始目标点"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"初始阶段"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"初始玩家"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"初始回合"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"初始目标"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"初始升级"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"无罪"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"内"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"智力"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"互动"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"不可见"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"物品"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"加入"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已加入"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在加入"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"跳跃"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在跳跃"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"击杀"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"连杀"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"队长"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"最少"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"左"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"更少"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"等级"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"等级下降"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"等级提升"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"生命"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"受限"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"读取"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已读取"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在读取"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"坐标"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"锁定"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已锁定"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在锁定"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"败者"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"较大"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"轻微"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"较小"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"任务"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"放弃的任务"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"任务完成"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"失败的任务"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"适中"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"金钱"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"怪物"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"更多"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"最多"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"我的错"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"近"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"最新高分"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"最新记录"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"下一个"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"下一批盟友"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"下一个盟友"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"下一次尝试"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"下一个检查点"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"下一批敌人"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"下一个敌人"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"下一个表格"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"下一个游戏"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"下一个英雄"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"下一批英雄"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"下一个人质"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"下一批人质"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"下一个等级"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"下一个任务"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"下一批对象"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"下一个目标点"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"下一个对象"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"下一个阶段"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"下一个玩家"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"下一批玩家"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"下一个回合"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"下一个目标"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"下一批目标"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"下一个升级 "',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"表现不错"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"否"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"不用了"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"空"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"普通"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"北"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"东北"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"西北"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"算了吧"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"对象"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"目标点"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"获取"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已获取"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在获取"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"关闭"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"开启"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"噢"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"啊呀"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"优化"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已优化"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在优化"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"不在视野中"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在远去"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"外"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"上方"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"加时"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"参与者"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"运载目标"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"阶段"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"选取"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已选取"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在选取"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"堆"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"打出"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已打出"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"玩家"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在打出"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"点"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"获得分数"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"失去分数"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"位置"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"能量"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"强化"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"价格"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"主要攻击模式"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"飞弹"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"保护"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已保护"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在保护"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已净化"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"净化"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在净化"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"亮紫色"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"复活"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已复活"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在复活"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"排名"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"等级 A"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"等级 B"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"等级 C"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"等级 D"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"等级 E"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"等级 F"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"等级 S"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已抵达"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"就绪"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"记录"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"恢复"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已恢复"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在恢复"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"红色"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"剩余"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"营救"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已营救 "',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在营救"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"资源"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"揭示"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已揭示"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在揭示"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"撤销"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已撤销"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在撤销"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"右"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"回合"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"战败回合数"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"胜利回合数"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"运行"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在运行"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"安全"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"保存"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已保存"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在保存"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"分数"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"辅助攻击模式"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"选择"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已选择"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在选择"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"出售"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在出售"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"服务器负载"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"服务器负载平均值"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"服务器负载峰值"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"撕裂"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已撕裂"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在撕裂"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"商店"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"洗牌"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已洗牌"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"击沉"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在击沉"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"跳过"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已跳过"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在跳过"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"沉睡"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在沉睡"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已沉睡"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"慢"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"较慢"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"最慢"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已出售"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"抱歉"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"南"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"东南"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"西南"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"黑桃"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"火花"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"孵化"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已孵化"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在孵化"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"速度"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"球体"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"球形"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"稳定"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已稳定"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在稳定"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"存放宠物"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"星星"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"群星"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"开始"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已开始"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在开始"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"状态"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"停止"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"走开"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已停止 "',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在停止"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"阻止"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已阻止"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在阻止"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"力量"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"击晕"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已击晕"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在击晕"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"次佳"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"成功"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"绝杀局"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已击沉"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"强烈"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"生存"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已生存"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在生存"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"目标"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"队伍"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"队友"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"极差"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"衷心感谢"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"感谢"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"太棒了"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"威胁"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"威胁等级"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"时间"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"总计"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"交易"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已交易"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在交易"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"叛徒"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"转移"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已转移"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在转移"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"再来试试"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"炮台"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"呃"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"终极技能"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"下方"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"未知"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"不受限"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"解锁"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已解锁"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在解锁"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"不安全"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"不稳定"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"上"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"升级"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"上传"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"已上传"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在上传"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"使用技能 1"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"使用技能 2"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"使用终极技能"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"胜利"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"可见"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"漩涡"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"等待"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"正在等待"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"墙壁"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"警告"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"欢迎"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"称赞"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"西"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"白色"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"关键牌"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"胜者"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"感知"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"较差"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"最差"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"哇哦"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"黄色"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"是"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"你"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"你失败了"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"你胜利了"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
    {
      名称: '"区域"',
      标签: ["字符串"],
      提示: "一个内置字符串选项。支持多语言。",
    },
  ],
  队伍: [
    {
      名称: "队伍1",
      标签: ["队伍"],
      提示: "表示默认颜色为蓝的队伍。用于“条件”或“行动”中的队伍选项。",
    },
    {
      名称: "队伍2",
      标签: ["队伍"],
      提示: "表示默认颜色为红的队伍。用于“条件”或“行动”中的队伍选项。",
    },
    {
      名称: "双方",
      标签: ["队伍"],
      提示: "表示两支队伍或非团队模式（例如“死斗”）的所有玩家。用于“条件”或“行动”中的队伍选项。",
    },
  ],
  阈值行为: [
    {
      名称: "替换现有阈值",
      标签: ["阈值", "行为"],
      提示: "一个仅用于“开始定向阈值”的行为选项。",
    },
    {
      名称: "添加至现有阈值",
      标签: ["阈值", "行为"],
      提示: "一个仅用于“开始定向阈值”的行为选项。",
    },
  ],
  转换: [
    {
      名称: "旋转",
      标签: ["矢量", "转换"],
      提示: "一个矢量转换选项。",
    },
    {
      名称: "旋转并转换",
      标签: ["矢量", "转换"],
      提示: "一个矢量转换选项。",
    },
  ],
  可见: [
    {
      名称: "全部",
      标签: ["可见"],
      提示: "一个玩家可见选项。",
    },
    {
      名称: "敌人",
      标签: ["可见"],
      提示: "一个玩家可见选项。",
    },
    {
      名称: "全部禁用",
      标签: ["可见"],
      提示: "一个玩家可见选项。",
    },
  ],
  观战: [
    {
      名称: "默认可见度",
      标签: ["观战", "可见"],
      提示: "一个观战可见选项。",
    },
    {
      名称: "始终可见",
      标签: ["观战", "可见"],
      提示: "一个观战可见选项。",
    },
    {
      名称: "始终不可见",
      标签: ["观战", "可见"],
      提示: "一个观战可见选项。",
    },
  ],
  等待行为: [
    {
      名称: "无视条件",
      标签: ["等待", "行为"],
      提示: "动作列表的执行不会被中断。",
    },
    {
      名称: "当为“假”时中止",
      标签: ["等待", "行为"],
      提示: "如果此规则中任何一项条件变为假，则中止执行动作列表。",
    },
    {
      名称: "当为“真”时重新开始",
      标签: ["等待", "行为"],
      提示: "如果条件列表从假转变为真，或者规则中的事件在为真的条件下再次发生，则从第一项动作开始重新执行动作列表。",
    },
  ],
};

let 规则 = {
  事件: {
    选项: {
      "持续 - 全局": {
        标签: ["事件"],
        提示: "当比赛开始时，创建此规则的单一副本。此副本在整场比赛中保持激活状态。",
      },

      "持续 - 每名玩家": {
        标签: ["事件"],
        提示: "当玩家加入比赛时，为每位玩家创建此规则的副本。此副本会保持激活，直至玩家离开比赛或比赛结束。每个副本都会独立追踪并执行条件和行动。",
      },

      玩家造成伤害: {
        标签: ["事件"],
        提示: "当玩家造成伤害时执行规则。",
      },

      玩家造成最后一击: {
        标签: ["事件"],
        提示: "当玩家造成最后一击时执行规则。",
      },

      玩家造成治疗: {
        标签: ["事件"],
        提示: "当玩家造成治疗时执行规则。",
      },

      玩家造成击退: {
        标签: ["事件"],
        提示: "当玩家造成击退时执行规则. ",
      },

      玩家阵亡: {
        标签: ["事件"],
        提示: "当玩家阵亡时执行规则。",
      },

      玩家参与消灭: {
        标签: ["事件"],
        提示: "当玩家参与消灭时执行规则。",
      },

      玩家加入比赛: {
        标签: ["事件"],
        提示: "当玩家加入比赛时执行规则。",
      },

      玩家离开比赛: {
        标签: ["事件"],
        提示: "当玩家离开比赛时执行规则。",
      },

      玩家受到治疗: {
        标签: ["事件"],
        提示: "当玩家受到治疗时执行规则。",
      },

      玩家受到击退: {
        标签: ["事件"],
        提示: "当玩家受到击退时执行规则. ",
      },

      玩家受到伤害: {
        标签: ["事件"],
        提示: "当玩家受到伤害时执行规则。",
      },

      子程序: {
        标签: ["事件"],
        提示: "当被“调用子程序“或”开始规则”动作调用时执行该规则。",
      },
    },

    队伍: {
      队伍1: {
        标签: ["事件", "队伍"],
        提示: "表示默认颜色为蓝的队伍。仅用于“规则事件”中的队伍选项。",
      },

      队伍2: {
        标签: ["事件", "队伍"],
        提示: "表示默认颜色为红的队伍。仅用于“规则事件”中的队伍选项。",
      },

      双方: {
        标签: ["事件", "队伍"],
        提示: "表示两支队伍或非团队模式（例如“死斗”）的所有玩家。仅用于“规则事件”中的队伍选项。",
      },
    },

    玩家: {
      全部: {
        标签: ["事件", "玩家"],
        顺序: "000",
        提示: "表示所有栏位的玩家。",
      },

      "栏位 0": {
        标签: ["事件", "玩家"],
        顺序: "001",
        提示: "表示第0个栏位的玩家。",
      },

      "栏位 1": {
        标签: ["事件", "玩家"],
        顺序: "002",
        提示: "表示第1个栏位的玩家。",
      },

      "栏位 2": {
        标签: ["事件", "玩家"],
        顺序: "003",
        提示: "表示第2个栏位的玩家。",
      },

      "栏位 3": {
        标签: ["事件", "玩家"],
        顺序: "004",
        提示: "表示第3个栏位的玩家。",
      },

      "栏位 4": {
        标签: ["事件", "玩家"],
        顺序: "005",
        提示: "表示第4个栏位的玩家。",
      },

      "栏位 5": {
        标签: ["事件", "玩家"],
        顺序: "006",
        提示: "表示第5个栏位的玩家。",
      },

      "栏位 6": {
        标签: ["事件", "玩家"],
        顺序: "007",
        提示: "表示第6个栏位的玩家。",
      },

      "栏位 7": {
        标签: ["事件", "玩家"],
        顺序: "008",
        提示: "表示第7个栏位的玩家。",
      },

      "栏位 8": {
        标签: ["事件", "玩家"],
        顺序: "009",
        提示: "表示第8个栏位的玩家。",
      },

      "栏位 9": {
        标签: ["事件", "玩家"],
        顺序: "010",
        提示: "表示第9个栏位的玩家。",
      },

      "栏位 10": {
        标签: ["事件", "玩家"],
        顺序: "011",
        提示: "表示第10个栏位的玩家。",
      },

      "栏位 11": {
        标签: ["事件", "玩家"],
        顺序: "012",
        提示: "表示第11个栏位的玩家。",
      },
    },
  },

  条件: {
    "If-Then-Else": {
      参数: [
        {
          名称: "If",
          类型: "条件",
          默认: "真",
          提示: "如果此条件为真，则结果为Then后面的值。否则结果为Else后面的值。",
        },
        {
          名称: "Then",
          类型: "条件",
          默认: "0",
          提示: "如果条件为真，则结果是这个值。",
        },
        {
          名称: "Else",
          类型: "条件",
          默认: "0",
          提示: "如果条件不为真，则结果是这个值。",
        },
      ],
      格式: "(${1:真} ? ${2:0} : ${3:0})",
      返回: ["条件"],
      标签: ["条件", "流程控制"],
      提示: "如果If后面的条件为真，则结果为Then后面的值。否则结果为Else后面的值。",
    },
    比较: {
      参数: [
        {
          名称: "值",
          类型: "条件",
          默认: "0",
          提示: "比较式的左边。如果操作为“==”或“!=”，则可以为任意类型的值。否则此值应为实数。",
        },
        {
          名称: "比较",
          类型: "比较",
          默认: "==",
          提示: "比较式的中间符号。表示两个值的比较关系。",
        },
        {
          名称: "值",
          类型: "条件",
          默认: "0",
          提示: "比较式的右边。如果操作为“==”或“!=”，则可以为任意类型的值。否则此值应为实数。",
        },
      ],
      格式: "(${1:0} ${2:==} ${3:0})",
      返回: ["布尔"],
      标签: ["条件", "布尔运算"],
      提示: "比较输入的两个值的结果，如果相等则为“真”反之为“假”。",
    },
    X方向分量: {
      参数: [
        {
          名称: "值",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "要获取X方向分量的矢量。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "方向"],
      提示: "指定矢量在X方向上的分量，通常代表向左的量。",
    },
    Y方向分量: {
      参数: [
        {
          名称: "值",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "要获取Y方向分量的矢量。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "方向"],
      提示: "指定矢量在Y方向上的分量，通常代表向上的量。",
    },
    Z方向分量: {
      参数: [
        {
          名称: "值",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "要获取Z方向分量的矢量。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "方向"],
      提示: "指定矢量在Z方向上的分量，通常代表向前的量。",
    },
    上: {
      返回: ["矢量"],
      标签: ["条件", "方向"],
      提示: "方向性矢量 (0, 1, 0) 的简写，此矢量指向上方。",
    },
    上一个伤害调整ID: {
      返回: ["实体"],
      标签: ["条件", "ID"],
      提示: "此ID值代表最后一个事件玩家(或全局)所执行的“开始伤害调整”动作。",
    },
    上一个助攻ID: {
      返回: ["实体"],
      标签: ["条件", "ID"],
      提示: "此ID值代表最后一个时间玩家（或全局）所执行的“开始助攻”动作。",
    },
    上一个持续伤害效果ID: {
      返回: ["实体"],
      标签: ["条件", "ID"],
      提示: "此ID值代表最后一个事件玩家（或全局）所执行的”持续伤害“动作。",
    },
    上一个持续治疗效果ID: {
      返回: ["实体"],
      标签: ["条件", "ID"],
      提示: "此ID值代表最后一个事件玩家（或全局）所执行的”持续治疗“动作。",
    },
    上一个文本ID: {
      返回: ["实体"],
      标签: ["条件", "ID"],
      提示: "代表由事件玩家创建的（或由全局创建的）通过“创建HUD文本”、“创建地图文本”、“创建进度条HUD文本”或“创建进度条地图文本”动作所创建的最后一段文本。",
    },
    上一个治疗调整ID: {
      返回: ["实体"],
      标签: ["条件", "ID"],
      提示: "此ID值代表最后一个事件玩家（或全局）所执行的”开始治疗调整“动作。",
    },
    下: {
      返回: ["矢量"],
      标签: ["条件", "方向"],
      提示: "方向性矢量 (0, -1 ,0) 的简写，此矢量指向下方。",
    },
    与此方向的垂直角度: {
      参数: [
        {
          名称: "方向",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "对此方向矢量获取水平角度，单位为度。此矢量在计算开始前进行统一化。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "角度"],
      提示: "与指定方向矢量的垂直夹角，单位为度。",
    },
    与此方向的水平角度: {
      参数: [
        {
          名称: "方向",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "对此方向矢量获取垂直角度，单位为度。此矢量在计算开始前进行统一化。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "角度"],
      提示: "与指定方向矢量的水平夹角，单位为度。",
    },
    与此角度的相对方向: {
      参数: [
        {
          名称: "水平角度",
          类型: "条件",
          默认: "0",
          提示: "用于构建结果矢量的水平角度，单位为度。",
        },
        {
          名称: "垂直角度",
          类型: "条件",
          默认: "0",
          提示: "用于构建结果矢量的垂直角度，单位为度。",
        },
      ],
      返回: ["矢量"],
      标签: ["条件", "方向"],
      提示: "指向指定角度的单位长度矢量。",
    },
    主机玩家: {
      返回: ["实体"],
      标签: ["条件", "主机"],
      提示: "当前自定游戏的主机玩家。如果当前的主机玩家离开了比赛，该值会改变。",
    },
    事件为急救包: {
      返回: ["布尔"],
      标签: ["条件", "事件"],
      提示: "此规则正在处理的事件中的治疗是否来自于急救包。",
    },
    事件为环境事件: {
      返回: ["布尔"],
      标签: ["条件", "事件"],
      提示: "此规则正在处理的事件中的消灭是否是由环境引起的。",
    },
    事件伤害: {
      返回: ["数字"],
      标签: ["条件", "事件"],
      提示: "此规则所处理的事件中被攻击者受到的伤害数值。",
    },
    事件技能: {
      返回: ["按钮"],
      标签: ["条件", "事件"],
      提示: "此规则当前处理的事件中的技能所对应的按键。",
    },
    事件方向: {
      返回: ["矢量"],
      标签: ["条件"],
      提示: "此规则当前处理的事件来自哪个方向。",
    },
    事件暴击: {
      返回: ["布尔"],
      标签: ["条件", "事件"],
      提示: "此规则处理的伤害是否为暴击（如爆头伤害）。",
    },
    事件治疗: {
      返回: ["数字"],
      标签: ["条件", "事件"],
      提示: "此规则所处理的事件中被治疗者受到的治疗数值。",
    },
    事件玩家: {
      返回: ["实体"],
      标签: ["条件", "事件"],
      提示: "正在执行此规则的玩家，由事件指定。可能与攻击者或被攻击者为同一人。",
    },
    全局: {
      返回: ["全局"],
      标签: ["条件", "全局"],
      提示: "一个全局变量的当前值，全局变量即属于游戏本身的变量。",
    },
    队伍1: {
      标签: ["条件", "队伍"],
      提示: "表示默认颜色为蓝的队伍。",
    },
    队伍2: {
      标签: ["条件", "队伍"],
      提示: "表示默认颜色为红的队伍。",
    },
    所有队伍: {
      标签: ["条件", "队伍"],
      提示: "表示两支队伍或非团队模式（例如“死斗”）的所有玩家。",
    },
    从数组中移除: {
      参数: [
        {
          名称: "数组",
          类型: "条件",
          默认: "空数组",
          提示: "从此数列中移除值。",
        },
        {
          名称: "值",
          类型: "条件",
          默认: "0",
          提示: "要从数列中移除的值（如果能找到）。如果值本身是一个数列，则所有匹配的元素都将被移除。",
        },
      ],
      返回: ["数组"],
      标签: ["条件", "数组"],
      提示: "一个数组的复制，移除一个或更多的值（如果能找到）。",
    },
    以弧度为单位的反余弦值: {
      参数: [
        {
          名称: "值",
          类型: "条件",
          默认: "0",
          提示: "为函数输入值。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "数学运算"],
      提示: "指定值的反余弦值，以弧度为单位。",
    },
    以弧度为单位的反正切值: {
      参数: [
        {
          名称: "分子",
          类型: "条件",
          默认: "0",
          提示: "为函数输入分子。",
        },
        {
          名称: "分母",
          类型: "条件",
          默认: "0",
          提示: "为函数输入分母。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "数学运算"],
      提示: "指定分子及分母的反正切值（通常称为Atan2），以弧度为单位。",
    },
    以弧度为单位的反正弦值: {
      参数: [
        {
          名称: "值",
          类型: "条件",
          默认: "0",
          提示: "为函数输入值。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "数学运算"],
      提示: "指定值的反正弦值，以弧度为单位。",
    },
    以角度为单位的反余弦值: {
      参数: [
        {
          名称: "值",
          类型: "条件",
          默认: "0",
          提示: "为函数输入值。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "数学运算"],
      提示: "指定值的反余弦值，以角度为单位。",
    },
    以角度为单位的反正切值: {
      参数: [
        {
          名称: "分子",
          类型: "条件",
          默认: "0",
          提示: "为函数输入分子。",
        },
        {
          名称: "分母",
          类型: "条件",
          默认: "0",
          提示: "为函数输入分母。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "数学运算"],
      提示: "指定分子及分母的反正切值（通常称为Atan2），以角度为单位。",
    },
    以角度为单位的反正弦值: {
      参数: [
        {
          名称: "值",
          类型: "条件",
          默认: "0",
          提示: "为函数输入值。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "数学运算"],
      提示: "指定值的反正弦值，以角度为单位。",
    },
    伤害调整数量: {
      返回: ["数字"],
      标签: ["条件", "数量"],
      提示: "由“开始伤害调整”动作启动的伤害调整副本的当前数量。",
    },
    作为进攻队伍: {
      参数: [
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "检查此队伍的职责。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "判断"],
      提示: "指定队伍是否是进攻方。如果游戏模式不是攻防作战、护送、或攻击",
    },
    假: {
      返回: ["布尔"],
      标签: ["条件", "布尔"],
      提示: "布尔值，假。",
    },
    全部英雄: {
      返回: ["数组"],
      标签: ["条件", "英雄"],
      提示: "此数组包括了所有英雄。",
    },
    具有状态: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家的状态。",
        },
        {
          名称: "状态",
          类型: "状态",
          选项: 常量.状态,
          提示: "要检测的状态。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "状态"],
      提示: "指定玩家是否具有指定状态，无论此状态是通过“设置状态”行为获得的还是除命令以外的游戏机制获得的。",
    },
    分数: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家的分数。",
        },
      ],
      标签: ["条件", "分数"],
      提示: "一名玩家当前的得分。如果游戏不是自由混战模式，则结果为0。",
    },
    前: {
      返回: ["矢量"],
      标签: ["条件", "方向"],
      提示: "方向性矢量 (0, 0, 1) 的简写，此矢量指向前方。",
    },
    助攻数量: {
      返回: ["数字"],
      标签: ["条件", "数量"],
      提示: "由“开始助攻”动作启动的助攻副本的当前数量。",
    },
    单次赋值: {
      参数: [
        {
          名称: "输入值",
          类型: "条件",
          默认: "空",
          提示: "此值在每个动作或条件中只赋值一次。",
        },
      ],
      返回: ["条件"],
      标签: ["条件", "赋值"],
      提示: "结果为通过给定动作或条件提供给“输入值”参数的第一个值（当一个可重新赋值的值与一个动作相关联时，此选项可以用来有选择性地对此值的特定部分不重新赋值）。",
    },
    占领要点模式占领点解锁: {
      返回: ["布尔"],
      标签: ["条件", "判断"],
      提示: "占领要点模式中占领点是否解锁。",
    },
    占领要点模式得分百分比: {
      参数: [
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "获取此队伍的得分百分比。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "百分比"],
      提示: "指定队伍在占领要点模式中的得分百分比。",
    },
    占领要点模式正在得分的队伍: {
      返回: ["队伍"],
      标签: ["条件", "队伍"],
      提示: "该队伍正在占领要点模式中积累得分百分比。如果双方队伍都没有在积累得分，则结果为“全部”。",
    },
    取整: {
      参数: [
        {
          名称: "值",
          类型: "条件",
          默认: "0",
          提示: "要取整的值。",
        },
        {
          名称: "取整方式",
          类型: "取整",
          选项: 常量.取整,
          提示: "决定此值取整的方式。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "数学运算"],
      提示: "指定值取整后的值。",
    },
    受治疗者: {
      返回: ["实体"],
      标签: ["条件", "玩家"],
      提示: "根据此规则处理的事件中受到治疗的玩家。可能与治疗者或事件玩家是同一个人。",
    },
    可用英雄: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家可用的英雄。",
        },
      ],
      返回: ["数组"],
      标签: ["条件", "英雄"],
      提示: "此数组中包括指定玩家当前可以选择的英雄。",
    },
    右: {
      返回: ["矢量"],
      标签: ["条件", "方向"],
      提示: "方向性矢量 (-1 ,0 ,0) 的简写，此矢量指向右方。",
    },
    后: {
      返回: ["矢量"],
      标签: ["条件", "方向"],
      提示: "方向性矢量 (0, 0, -1) 的简写，此矢量指向后方。",
    },
    向量: {
      参数: [
        {
          名称: "开始位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "位移矢量的起点。",
        },
        {
          名称: "结束位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "位移矢量的终点。",
        },
      ],
      返回: ["矢量"],
      标签: ["条件", "方向"],
      提示: "从一个位置到另一个位置的位移矢量。",
    },
    团队得分: {
      参数: [
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "获取此队伍的得分。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "分数"],
      提示: "指定队伍当前的得分。在自由混战模式中结果为0。",
    },
    图标字符串: {
      参数: [
        {
          名称: "图标",
          类型: "图标",
          选项: 常量.图标,
          提示: "要显示的图标",
        },
      ],
      返回: ["字符串"],
      标签: ["条件", "图标"],
      提示: "可以在字符串中使用图标（每个字符串最多4个图标）。",
    },
    在地面上: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家是否处于地面上。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "判断"],
      提示: "玩家是否位于地面上（或可行走的表面上）。",
    },
    在墙上: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家的滑墙状态。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "判断"],
      提示: "玩家是否位于墙体上（滑墙或爬墙）。",
    },
    在夺旗模式中开始绝杀局: {
      返回: ["布尔"],
      标签: ["条件", "判断"],
      提示: "当前勇夺锦旗游戏是否处于绝杀局状态。",
    },
    在目标点上: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家的目标点状态。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "判断"],
      提示: "指定玩家是否正在运载目标或占领点上。",
    },
    在视线内: {
      参数: [
        {
          名称: "开始位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "用于进行视线检测的起点位置。如果此处填入一名玩家, 则使用从此玩家脚部向上2米的位置。",
        },
        {
          名称: "结束位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "用于进行视线检测的终点位置。如果此处填入一名玩家, 则使用从此玩家脚部向上2米的位置。",
        },
        {
          名称: "屏障",
          类型: "屏障视线检测",
          选项: 常量.屏障视线检测,
          提示: "定义屏障是否影响视线判断。如果要考察屏障是否属于敌方, 则以游戏开始时玩家所在的队伍（如果有的话）为准。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "判断"],
      提示: "两个位置是否在彼此的视线内。",
    },
    在视野内: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此名玩家的视野。",
        },
        {
          名称: "坐标",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "检测此坐标是否在视角内。",
        },
        {
          名称: "视角",
          类型: "条件",
          默认: "45",
          提示: "用于比较的视角, 单位为度。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "判断"],
      提示: "检测一个坐标是否位于玩家的视角内。",
    },
    在重生室中: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家的重生室状态。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "判断"],
      提示: "指定玩家是否正在重生室内（恢复生命值且可更换英雄）。",
    },
    地图: {
      参数: [
        {
          名称: "地图",
          类型: "地图",
          选项: 常量.地图,
          提示: "一个地图。",
        },
      ],
      返回: ["地图"],
      标签: ["条件", "地图"],
      提示: "一个地图常量。",
    },
    地图工坊设置实数: {
      参数: [
        {
          名称: "类别",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "此类别的名字，可以用来找到此设置。",
        },
        {
          名称: "名称",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "此设置的名称。",
        },
        {
          名称: "默认",
          类型: "数字",
          默认: "0",
          提示: "此项设置的默认值。",
        },
        {
          名称: "最小",
          类型: "数字",
          默认: "0",
          提示: "此设置所允许的最小值",
        },
        {
          名称: "最大",
          类型: "数字",
          默认: "0",
          提示: "此设置所允许的最大值",
        },
        {
          名称: "排序",
          类型: "数字",
          默认: "0",
          提示: "此设置与其他同类别设置的排序关系。排序较高的设置会在排序较低的设置之后显示。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "设置"],
      提示: "提供一个新的实数型设置值，会显示在“地图工坊设置”卡片上作为滑块。",
    },
    地图工坊设置开关: {
      参数: [
        {
          名称: "类别",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "此类别的名字，可以用来找到此设置。",
        },
        {
          名称: "名称",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "此设置的名称。",
        },
        {
          名称: "默认",
          类型: "布尔",
          默认: "假",
          提示: "此项设置的默认值。",
        },
        {
          名称: "排序",
          类型: "数字",
          默认: "0",
          提示: "此设置与其他同类别设置的排序关系。排序较高的设置会在排序较低的设置之后显示。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "设置"],
      提示: "提供一个新的开关设置的值（真或假），会显示在“地图工坊设置”卡片上作为勾选项。",
    },
    地图工坊设置整数: {
      参数: [
        {
          名称: "类别",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "此类别的名字，可以用来找到此设置。",
        },
        {
          名称: "名称",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "此设置的名称。",
        },
        {
          名称: "默认",
          类型: "数字",
          默认: "0",
          提示: "此项设置的默认值。",
        },
        {
          名称: "最小",
          类型: "数字",
          默认: "0",
          提示: "此设置所允许的最小值",
        },
        {
          名称: "最大",
          类型: "数字",
          默认: "0",
          提示: "此设置所允许的最大值",
        },
        {
          名称: "排序",
          类型: "数字",
          默认: "0",
          提示: "此设置与其他同类别设置的排序关系。排序较高的设置会在排序较低的设置之后显示。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "设置"],
      提示: "提供一个新的整数型设置值，会显示在“地图工坊设置”卡片上作为滑块。",
    },
    地图工坊设置组合: {
      参数: [
        {
          名称: "类别",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "此类别的名字，可以用来找到此设置。",
        },
        {
          名称: "名称",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "此设置的名称。",
        },
        {
          名称: "默认",
          类型: "数字",
          默认: "0",
          提示: "此项设置的默认值。",
        },
        {
          名称: "选项",
          类型: "条件",
          默认: "空数组",
          提示: "此设置的选项。",
        },
        {
          名称: "排序",
          类型: "数字",
          默认: "0",
          提示: "此设置与其他同类别设置的排序关系。排序较高的设置会在排序较低的设置之后显示。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "设置"],
      提示: "提供一个新的选项设置值（用于选择自定义字符串），会显示在“地图工坊设置”卡片上作为组合框。此值会返回所选内容的索引。",
    },
    地图工坊设置英雄: {
      参数: [
        {
          名称: "类别",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "此类别的名字，可以用来找到此设置。",
        },
        {
          名称: "名称",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "此设置的名称。",
        },
        {
          名称: "默认",
          类型: "英雄",
          选项: 常量.英雄,
          提示: "此项设置的默认值。",
        },
        {
          名称: "排序",
          类型: "数字",
          默认: "0",
          提示: "此设置与其他同类别设置的排序关系。排序较高的设置会在排序较低的设置之后显示。",
        },
      ],
      返回: ["英雄"],
      标签: ["条件", "设置"],
      提示: "提供一个新的英雄设置值，会显示在“地图工坊设置”卡片上作为组合框。",
    },
    地图矢量: {
      参数: [
        {
          名称: "本地矢量",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "将此相对本地坐标的矢量值转化为相对于地图坐标的矢量值。",
        },
        {
          名称: "相对玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "本地矢量是相对此玩家的。",
        },
        {
          名称: "转换",
          类型: "转换",
          选项: 常量.转换,
          提示: "指定此矢量是否接受旋转及平移（通常是位置），或者只接受旋转（通常是方向和速度）。",
        },
      ],
      返回: ["矢量"],
      标签: ["条件", "矢量运算"],
      提示: "相对于地图坐标的矢量值，与所提供的相对本地坐标的矢量值对应。",
    },
    垂直方向夹角: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "以此玩家当前面向的角度为起点。",
        },
        {
          名称: "位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "测定与地图中此位置的夹角。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "角度"],
      提示: "玩家当前朝向的方向与指定位置之间的垂直方向夹角，单位为度。如果位置在玩家下方，则结果为正数。否则，结果为零或负数。",
    },
    垂直朝向角度: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家的面向角度。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "角度"],
      提示: "玩家当前面对的方向与地图的垂直夹角。当玩家转向下方时这个值会增加。",
    },
    垂直速度: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家的垂直速度。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "速度"],
      提示: "秒。排除所有垂直方向的运动，包括沿斜坡方向的运动。",
    },
    处于回合之间: {
      返回: ["布尔"],
      标签: ["条件", "判断"],
      提示: "此比赛是否正在两个回合之间。",
    },
    处于非初始状态: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家的状态。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "判断"],
      提示: "指定玩家当前是否处于非初始状态（如D.Va离开机甲、卢西奥使用加速音乐、堡垒处于转换形态期间、天使和托比昂使用辅助攻击武器，等等。）如果要检测回声是否正在使用人格复制，请使用“正在人格复制”的值。",
    },
    头像火力全开: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家的头像状态。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "判断"],
      提示: "指定玩家的头像是否处于火力全开状态。",
    },
    字符串: {
      参数: [
        {
          名称: "字符串",
          类型: "字符串",
          选项: 常量.字符串,
          提示: "结果文本。花括号中的数字将被相应的值取代。",
        },
        {
          名称: "{0}",
          类型: "条件",
          默认: "空",
          提示: "此值将转换为文本并用于替代{0}。",
        },
        {
          名称: "{1}",
          类型: "条件",
          默认: "空",
          提示: "此值将转换为文本并用于替代{1}。",
        },
        {
          名称: "{2}",
          类型: "条件",
          默认: "空",
          提示: "此值将转换为文本并用于替代{2}。",
        },
      ],
      返回: ["字符串"],
      标签: ["条件", "字符串"],
      提示: "由选定的字符串和指定的值构成的文本。",
    },
    自定义字符串: {
      参数: [
        {
          名称: "字符串",
          类型: "字符串",
          选项: 常量.字符串,
          提示: "结果文本。花括号中的数字将被相应的值取代。",
        },
        {
          名称: "{0}",
          类型: "条件",
          默认: "空",
          提示: "此值将转换为文本并用于替代{0}。",
        },
        {
          名称: "{1}",
          类型: "条件",
          默认: "空",
          提示: "此值将转换为文本并用于替代{1}。",
        },
        {
          名称: "{2}",
          类型: "条件",
          默认: "空",
          提示: "此值将转换为文本并用于替代{2}。",
        },
      ],
      返回: ["字符串"],
      标签: ["条件", "字符串"],
      提示: "可以输入值的自定义文本。",
    },
    字符串中字符: {
      参数: [
        {
          名称: "字符串",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "获取此字符串值的字符。",
        },
        {
          名称: "索引",
          类型: "条件",
          默认: "0",
          提示: "要获取字符的索引（0表示第一个字符，1表示第二个字符，以此类推）。",
        },
      ],
      返回: ["字符串"],
      标签: ["条件", "字符串"],
      提示: "一条字符串的指定索引对应的字符。",
    },
    字符串分割: {
      参数: [
        {
          名称: "字符串",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "要分割的字符串值。",
        },
        {
          名称: "分隔符",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "要分割字符串值所用的分隔符字符串。",
        },
      ],
      返回: ["字符串"],
      标签: ["条件", "字符串"],
      提示: "结果为字符串值数组。数组中的字符串值由将指定字符串值用分隔符字符串分割而成。",
    },
    字符串包含: {
      参数: [
        {
          名称: "字符串",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "要搜索的值。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "字符串"],
      提示: "指定字符串中是否包含指定的值。",
    },
    字符串字符索引: {
      参数: [
        {
          名称: "字符串",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "从此字符串值中搜索字符。",
        },
        {
          名称: "字符",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "要搜索的字符。",
        },
      ],
      返回: ["字符串"],
      标签: ["条件", "字符串"],
      提示: "一个字符在字符串中的索引位置。如果找不到此字符，则为",
    },
    字符串替换: {
      参数: [
        {
          名称: "字符串",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "在此字符串中搜索进行替换。",
        },
        {
          名称: "模式",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "要替换的字符串模式。",
        },
        {
          名称: "替换",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "用此字符串值替换模式字符串。",
        },
      ],
      返回: ["字符串"],
      标签: ["条件", "字符串"],
      提示: "结果为字符串值。此字符串值由将指定字符串值中出现的所有模式字符串替换为替换字符串而成。",
    },
    字符串长度: {
      参数: [
        {
          名称: "字符串",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "计算此字符串值的字符数。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "字符串"],
      提示: "结果为所选字符串值中的字符数（所选值不是字符串时为0）。",
    },
    存活: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家的生命状态。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "判断"],
      提示: "玩家是否存活。",
    },
    存活玩家数量: {
      参数: [
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "计算下列队伍中玩家的数量。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "数量"],
      提示: "队伍或比赛中存活的玩家数量。",
    },
    实体存在: {
      参数: [
        {
          名称: "实体",
          类型: "条件",
          默认: "最后创建的实体",
          提示: "检查是否存在此玩家、图标实体或效果实体。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "判断"],
      提示: "指定玩家、图标实体或效果实体是否存在。可以用来查看一个玩家是否已经离开比赛，或一个实体是否已被消除。",
    },
    实体数量: {
      返回: ["数字"],
      标签: ["条件", "数量"],
      提示: "由“创建效果”、“创建光束效果”或“创建图标”动作创建的实体的当前数量。",
    },
    "对任意为“真”": {
      参数: [
        {
          名称: "数组",
          类型: "条件",
          默认: "空数组",
          提示: "考察此数组中的值。",
        },
        {
          名称: "条件",
          类型: "条件",
          默认: "假",
          提示: "对指定的数组中每个元素判断此条件。可以使用“当前数组元素值”来指代数组中当前正在进行判断的元素。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "数组"],
      提示: "指定数组中是否有元素对指定的条件为“真”。",
    },
    "对全部为“真”": {
      参数: [
        {
          名称: "数组",
          类型: "条件",
          默认: "空数组",
          提示: "考察此数组中的值。",
        },
        {
          名称: "条件",
          类型: "条件",
          默认: "假",
          提示: "对指定的数组中每个元素判断此条件。可以使用“当前数组元素值”来指代数组中当前正在进行判断的元素。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "数组"],
      提示: "指定数组中所有元素是否都对指定的条件为“真”。",
    },
    对方队伍: {
      参数: [
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "获得此队伍的对方队伍。如果选择“全部”，结果亦为“全部”。",
        },
      ],
      返回: ["队伍"],
      标签: ["条件", "队伍"],
      提示: "指定队伍的对方队伍。",
    },
    对象索引: {
      返回: ["数字"],
      标签: ["条件", "索引"],
      提示: "当前激活的控制点、运载目标检查点或运载目标目的地（0，1或2）。在攻防作战、攻击",
    },
    射线命中位置: {
      参数: [
        {
          名称: "开始位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "射线开始施放的位置。如果此处填入一名玩家，则使用从此玩家脚部向上2米的位置。",
        },
        {
          名称: "结束位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "射线结束的位置。如果此处填入一名玩家，则使用从此玩家脚部向上2米的位置。",
        },
        {
          名称: "包括玩家",
          类型: "条件",
          默认: "所有玩家(所有队伍)",
          提示: "哪些玩家可以被射线击中。",
        },
        {
          名称: "不包括玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "射线不会击中的玩家。此列表将优先于“包括玩家”。",
        },
        {
          名称: "包括玩家拥有的物体",
          类型: "条件",
          默认: "假",
          提示: "玩家拥有的物体（如屏障或炮台）是否包括在射线中。",
        },
      ],
      返回: ["矢量"],
      标签: ["条件", "射线"],
      提示: "射线在表面、物体或玩家上命中的位置（如果没有命中则此位置在视线结束处）。",
    },
    射线命中法线: {
      参数: [
        {
          名称: "开始位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "射线开始施放的位置。如果此处填入一名玩家，则使用从此玩家脚部向上2米的位置。",
        },
        {
          名称: "结束位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "射线结束的位置。如果此处填入一名玩家，则使用从此玩家脚部向上2米的位置。",
        },
        {
          名称: "包括玩家",
          类型: "条件",
          默认: "所有玩家(所有队伍)",
          提示: "哪些玩家可以被射线击中。",
        },
        {
          名称: "不包括玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "射线不会击中的玩家。此列表将优先于“包括玩家”。",
        },
        {
          名称: "包括玩家拥有的物体",
          类型: "条件",
          默认: "假",
          提示: "玩家拥有的物体（如屏障或炮台）是否包括在射线中。",
        },
      ],
      返回: ["矢量"],
      标签: ["条件", "射线"],
      提示: "射线命中平面的法线（如果没有命中，则从视线结束位置到射线起始位置）。",
    },
    射线命中玩家: {
      参数: [
        {
          名称: "开始位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "射线开始施放的位置。如果此处填入一名玩家，则使用从此玩家脚部向上2米的位置。",
        },
        {
          名称: "结束位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "射线结束的位置。如果此处填入一名玩家，则使用从此玩家脚部向上2米的位置。",
        },
        {
          名称: "包括玩家",
          类型: "条件",
          默认: "所有玩家(所有队伍)",
          提示: "哪些玩家可以被射线击中。",
        },
        {
          名称: "不包括玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "射线不会击中的玩家。此列表将优先于“包括玩家”。",
        },
        {
          名称: "包括玩家拥有的物体",
          类型: "条件",
          默认: "假",
          提示: "玩家拥有的物体（如屏障或炮台）是否包括在射线中。",
        },
      ],
      返回: ["实体"],
      标签: ["条件", "射线"],
      提示: "射线命中的玩家（如果没有命中则为空）。",
    },
    左: {
      返回: ["矢量"],
      标签: ["条件", "方向"],
      提示: "方向性矢量 (1, 0, 0) 的简写，此矢量指向左方。",
    },
    已排序的数组: {
      参数: [
        {
          名称: "数组",
          类型: "条件",
          默认: "空数组",
          提示: "对此数组的复制进行排序。",
        },
        {
          名称: "条件",
          类型: "条件",
          默认: "假",
          提示: "将此值赋值给复制的数组中的每个元素。数组将以升序排列。可以使用“当前数组元素值”来指代数组中当前正在进行判断的元素。",
        },
      ],
      返回: ["数组"],
      标签: ["条件", "数组"],
      提示: "复制指定的数组，根据每个元素的值的排名重新排序。",
    },
    已过滤的数组: {
      参数: [
        {
          名称: "数组",
          类型: "条件",
          默认: "空数组",
          提示: "对此数组的复制进行过滤。",
        },
        {
          名称: "条件",
          类型: "条件",
          默认: "假",
          提示: "对复制的数组中每个元素判断此条件。如果条件为“真”，则在复制的数组中保留此元素。可以使用“当前数组元素值”来指代数组中当前正在进行判断的元素。",
        },
      ],
      返回: ["数组"],
      标签: ["条件", "数组"],
      提示: "复制指定的数组，不满足特定条件的值将被移除。",
    },
    已重生: {
      参数: [
        {
          名称: "实体",
          类型: "条件",
          默认: "最后创建的实体",
          提示: "检测此玩家、图标实体或效果实体是否存在于地图中。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "判断"],
      提示: "一个实体是否存在于地图中。如果玩家尚未选择英雄，则返回结果为“假“。",
    },
    幅值: {
      参数: [
        {
          名称: "矢量",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "求幅值操作的矢量操作数。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "矢量运算"],
      提示: "指定值的幅值。例如指定向量的长度。",
    },
    平方根: {
      参数: [
        {
          名称: "值",
          类型: "条件",
          默认: "0",
          提示: "计算此实数值的平方根。负数值则为0。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "数学运算"],
      提示: "指定值的平方根。",
    },
    弧度的余弦值: {
      参数: [
        {
          名称: "角度",
          类型: "条件",
          默认: "0",
          提示: "角度，以角度为单位。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "数学运算"],
      提示: "指定角度（以弧度为单位）的余弦值。",
    },
    弧度的正切值: {
      参数: [
        {
          名称: "角度",
          类型: "条件",
          默认: "0",
          提示: "角度，以角度为单位。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "数学运算"],
      提示: "指定弧度（以度为单位）的正切值。",
    },
    弧度的正弦值: {
      参数: [
        {
          名称: "角度",
          类型: "条件",
          默认: "0",
          提示: "角度，以角度为单位。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "数学运算"],
      提示: "指定角度（以弧度为单位）的正弦值。",
    },
    弹药: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家的弹药数量。",
        },
        {
          名称: "弹夹",
          类型: "条件",
          默认: "0",
          提示: "获取弹夹的索引。0为第一个弹夹，1为第二个。若指定类型不存在，则返还0。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "数量"],
      提示: "一名玩家当前的弹药数量。",
    },
    归一化: {
      参数: [
        {
          名称: "矢量",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "要归一化的矢量。",
        },
      ],
      返回: ["矢量"],
      标签: ["条件", "矢量运算"],
      提示: "将矢量归一化为单位长度。",
    },
    当前地图: {
      返回: ["地图"],
      标签: ["条件", "地图"],
      提示: "自定义游戏中当前使用的地图。",
    },
    当前数组元素: {
      返回: ["条件"],
      标签: ["条件", "数组"],
      提示: "当前在考察的数组元素。只有在使用“过滤数组”或“排序数组”赋值时才有意义。",
    },
    当前数组索引: {
      返回: ["数字"],
      标签: ["条件", "数组"],
      提示: "当前在考察的数组索引。只有在使用“过滤数组”或“排序数组”赋值时才有意义。",
    },
    当前游戏模式: {
      返回: ["模式"],
      标签: ["条件", "判断"],
      提示: "当前自定游戏的游戏模式。",
    },
    总计消耗时间: {
      返回: ["数字"],
      标签: ["条件", "时间"],
      提示: "该游戏副本创建后已经过去的总时间（包括准备时间和攻防转换时间），以秒为单位。",
    },
    截取字符串: {
      参数: [
        {
          名称: "字符串",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "从此字符串值中构建子字符串。",
        },
        {
          名称: "开始字符索引",
          类型: "条件",
          默认: "0",
          提示: "指定一个字符作为子字符串的起始处（0表示第一个字符，1表示第二个字符，以此类推）。",
        },
        {
          名称: "字符串长度",
          类型: "条件",
          默认: "0",
          提示: "指定子字符串的字符数。",
        },
      ],
      返回: ["字符串"],
      标签: ["条件", "字符串"],
      提示: "结果为所选字符串值的指定子字符串。",
    },
    所在队伍: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家的队伍。",
        },
      ],
      返回: ["队伍"],
      标签: ["条件", "队伍"],
      提示: "一支玩家所在的队伍。如果在自由混战模式中，则“队伍”视为“全部”。",
    },
    所有存活玩家: {
      参数: [
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "玩家所在的队伍。",
        },
      ],
      返回: ["数组"],
      标签: ["条件", "玩家"],
      提示: "此数组中包括一支队伍或整个比赛中所有存活的玩家。",
    },
    所有支援英雄: {
      返回: ["数组"],
      标签: ["条件", "英雄"],
      提示: "此数组包括了所有支援英雄。",
    },
    所有死亡玩家: {
      参数: [
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "玩家所在的队伍。",
        },
      ],
      返回: ["数组"],
      标签: ["条件", "玩家"],
      提示: "此数组中包括一支队伍或整个比赛中所有已死亡的玩家。",
    },
    所有玩家: {
      参数: [
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "玩家所在的队伍。",
        },
      ],
      返回: ["数组"],
      标签: ["条件", "玩家"],
      提示: "此数组中包括一支队伍或整个比赛中所有的玩家。",
    },
    所有目标点内玩家: {
      参数: [
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "玩家所在的队伍。",
        },
      ],
      返回: ["数组"],
      标签: ["条件", "玩家"],
      提示: "此数组中包括所有在运载目标或控制点上的玩家（可以是一支队伍中的，也可以是整个比赛中的）。",
    },
    所有目标点外玩家: {
      参数: [
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "玩家所在的队伍。",
        },
      ],
      返回: ["数组"],
      标签: ["条件", "玩家"],
      提示: "此数组中包括所有不在运载目标或控制点上的玩家（可以是一支队伍中的，也可以是整个比赛中的）。",
    },
    所有输出英雄: {
      返回: ["数组"],
      标签: ["条件", "英雄"],
      提示: "此数组包括了所有输出英雄。",
    },
    所有重装英雄: {
      返回: ["数组"],
      标签: ["条件", "英雄"],
      提示: "此数组包括了所有重装英雄。",
    },
    所用英雄: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家的英雄。",
        },
      ],
      返回: ["英雄"],
      标签: ["条件", "英雄"],
      提示: "一名玩家当前的英雄。",
    },
    所选位置: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家的位置。",
        },
      ],
      返回: ["矢量"],
      标签: ["条件", "位置"],
      提示: "玩家的当前位置，此值为矢量。",
    },
    技能充能: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家的技能状态。",
        },
        {
          名称: "按钮",
          类型: "条件",
          默认: "按钮(终极技能)",
          提示: "检测此按键对应的技能状态。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "技能"],
      提示: "一名玩家指定按键对应技能的充能次数。",
    },
    技能冷却时间: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家的技能状态。",
        },
        {
          名称: "按钮",
          类型: "条件",
          默认: "按钮(终极技能)",
          提示: "检测此按键对应的技能状态。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "技能"],
      提示: "一名玩家指定按键对应技能的冷却时间，以秒为单位。",
    },
    技能图标字符串: {
      参数: [
        {
          名称: "英雄",
          类型: "条件",
          默认: "英雄(回声)",
          提示: "将这个英雄的技能转化为图标。",
        },
        {
          名称: "按钮",
          类型: "条件",
          默认: "按钮(终极技能)",
          提示: "将这个技能的按键转化为图标。",
        },
      ],
      返回: ["字符串"],
      标签: ["条件", "字符串"],
      提示: "将一个英雄和按键的参数转化为图标在字符串中显示（每个字符串中最多4个）。",
    },
    技能资源: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家的技能资源。",
        },
        {
          名称: "按钮",
          类型: "条件",
          默认: "按钮(终极技能)",
          提示: "检测此按键对应的技能状态。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "资源"],
      提示: "一名玩家指定按键对应技能的资源百分比。",
    },
    持续伤害数量: {
      返回: ["数字"],
      标签: ["条件", "数量"],
      提示: "由“持续伤害”动作启动的持续伤害副本的当前数量。",
    },
    持续治疗数量: {
      返回: ["数字"],
      标签: ["条件", "数量"],
      提示: "由“持续治疗”动作启动的持续治疗副本的当前数量。",
    },
    指定方向速度: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家的速度。",
        },
        {
          名称: "方向",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "行动的方向，用于测量玩家速度。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "速度"],
      提示: "一名玩家在指定方向上的当前速度，单位为米/秒。",
    },
    按钮: {
      参数: [
        {
          名称: "按钮",
          类型: "按钮",
          选项: 常量.按钮,
          提示: "一个按钮选项。",
        },
      ],
      返回: ["按钮"],
      标签: ["条件", "按钮"],
      提示: "一个按钮常量。",
    },
    按钮被按下: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家的按钮。",
        },
        {
          名称: "按钮",
          类型: "条件",
          默认: "按钮(终极技能)",
          提示: "用于检测的按钮。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "按钮"],
      提示: "玩家是否正在按下特定按钮。",
    },
    携带旗帜的玩家: {
      参数: [
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "检测此队伍的旗帜。",
        },
      ],
      返回: ["实体"],
      标签: ["条件", "玩家"],
      提示: "在勇夺锦旗模式中正在携带指定队伍旗帜的玩家。如果没有玩家正在携带旗帜，则返回值为空。",
    },
    攻击方: {
      返回: ["实体"],
      标签: ["条件", "玩家"],
      提示: "根据此规则处理的事件中造成伤害的玩家。可能与被攻击者或事件玩家是同一个人。",
    },
    数组: {
      参数: [
        {
          名称: "条件",
          类型: "条件",
          默认: "空",
          提示: "获取此数组中的元素。",
        },
      ],
      返回: ["数组"],
      标签: ["条件", "数组"],
      提示: "由所列出的值组成的数组。",
    },
    数组中的值: {
      参数: [
        {
          名称: "数组",
          类型: "条件",
          默认: "空数组",
          提示: "获取此数组中的元素。",
        },
        {
          名称: "索引",
          类型: "条件",
          默认: "0",
          提示: "获取索引中的元素。",
        },
      ],
      返回: ["数组"],
      标签: ["条件", "数组"],
      提示: "一个数组中指定元素的值。如果该元素不存在，则结果为0。",
    },
    数组值的索引: {
      参数: [
        {
          名称: "数组",
          类型: "条件",
          默认: "空数组",
          提示: "在此数组中搜索指定的值。",
        },
        {
          名称: "值",
          类型: "条件",
          默认: "0",
          提示: "要搜索的值。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "数组"],
      提示: "一个值在数组中的索引位置。如果找不到此值，则为-1。",
    },
    数组分割: {
      参数: [
        {
          名称: "数组",
          类型: "条件",
          默认: "空数组",
          提示: "产生此数组的复制。",
        },
        {
          名称: "开始索引",
          类型: "条件",
          默认: "0",
          提示: "范围内的第一个索引。",
        },
        {
          名称: "计数",
          类型: "条件",
          默认: "0",
          提示: "结果数组中的元素数量。如果指定的范围超过此数组的限制，则结果数组中会包含较少的元素。",
        },
      ],
      返回: ["数组"],
      标签: ["条件", "数组"],
      提示: "复制指定的数组，只复制指定索引范围内的值。",
    },
    数组包含: {
      参数: [
        {
          名称: "数组",
          类型: "条件",
          默认: "空数组",
          提示: "在此数组中搜索指定的值。",
        },
        {
          名称: "值",
          类型: "条件",
          默认: "0",
          提示: "要搜索的值。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "数组"],
      提示: "指定数组中是否包含指定的值。",
    },
    数组随机取值: {
      参数: [
        {
          名称: "数组",
          类型: "条件",
          默认: "空数组",
          提示: "从一个数组中随机取值。如果提供的值不是数组，则结果为提供的值。",
        },
      ],
      返回: ["条件"],
      标签: ["条件", "数组"],
      提示: "指定数组中的一个随机值。",
    },
    数量: {
      参数: [
        {
          名称: "数组",
          类型: "条件",
          默认: "空数组",
          提示: "计算此数组的元素个数。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "数量"],
      提示: "指定数组的元素个数。",
    },
    文本数量: {
      返回: ["数字"],
      标签: ["条件", "数量"],
      提示: "由“创建HUD文本”、“创建地图文本”、“创建进度条HUD文本”或“创建进度条地图文本”动作启动的文本副本的当前数量。",
    },
    方向: {
      参数: [
        {
          名称: "开始位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "用于获取方向矢量的起点位置。",
        },
        {
          名称: "结束位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "用于获取方向矢量的终点位置。",
        },
      ],
      返回: ["矢量"],
      标签: ["条件", "方向"],
      提示: "从一个位置到另一个位置的单位长度矢量。",
    },
    旗帜位置: {
      参数: [
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "获取此队伍旗帜的位置。",
        },
      ],
      返回: ["矢量"],
      标签: ["条件", "位置"],
      提示: "在勇夺锦旗模式中指定队伍的位置。",
    },
    旗帜是否在基地中: {
      参数: [
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "检测此队伍的旗帜。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "判断"],
      提示: "在勇夺锦旗模式下，指定队伍的旗帜是否在其基地内。",
    },
    空: {
      返回: ["空"],
      标签: ["条件", "空"],
      提示: "一名玩家已离开。当没有玩家进行输入时使用。用来比较或测试时等效于实数0。",
    },
    映射的数组: {
      参数: [
        {
          名称: "数组",
          类型: "条件",
          默认: "空数组",
          提示: "对此数组的复制进行映射。",
        },
        {
          名称: "条件",
          类型: "条件",
          默认: "假",
          提示: "映射表达式将此数组中的每个元素复值为被复制的数组中的元素值。使用“当前数组元素值”可以指定当前考察的数组中元素的值。",
        },
      ],
      返回: ["数组"],
      标签: ["条件", "数组"],
      提示: "复制指定的数组，根据映射表达式对每个元素进行赋值。",
    },
    是否是机器人: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "考察此玩家。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "判断"],
      提示: "玩家是否是机器人。",
    },
    是否有人携带旗帜: {
      参数: [
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "检测此队伍的旗帜。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "判断"],
      提示: "在勇夺锦旗模式下，指定队伍的旗帜是否在其基地内。",
    },
    最后: {
      参数: [
        {
          名称: "数组",
          类型: "条件",
          默认: "空数组",
          提示: "获取此数组中的值。",
        },
      ],
      返回: ["条件"],
      标签: ["条件", "数组"],
      提示: "指定数组末尾元素的值。如果指定数组为空，则结果为0。",
    },
    最后一击数: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家的最后一击次数。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "数量"],
      提示: "指定玩家造成最后一击的次数。这个值会随着游戏的进程不断累积。",
    },
    最后创建的实体: {
      返回: ["实体"],
      标签: ["条件", "ID"],
      提示: "对事件玩家创建的（或由全局创建的）最后一个效果，图标实体或机器人的引用。",
    },
    最后创建的生命池: {
      返回: ["实体"],
      标签: ["条件", "ID"],
      提示: "此ID值代表最后一个事件玩家（或全局）所执行的”添加生命池“动作。",
    },
    最大弹药量: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家的最大弹药数量。",
        },
        {
          名称: "弹夹",
          类型: "条件",
          默认: "0",
          提示: "获取弹夹的索引。0为第一个弹夹，1为第二个。若指定类型不存在，则返还0。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "数量"],
      提示: "一名玩家当前的最大弹药数量。",
    },
    最大生命值: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家的最大生命值。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "玩家"],
      提示: "一名玩家的最大生命值，包括护甲和护盾。",
    },
    最近的可行走位置: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家的方向输入。",
        },
      ],
      返回: ["矢量"],
      标签: ["条件", "位置"],
      提示: "与指定位置最接近的、可以站立且能够从一个重生点到达的位置。",
    },
    服务器负载: {
      返回: ["数字"],
      标签: ["条件", "百分比"],
      提示: "当前游戏副本造成的CPU负载百分比。如果这个数字接近或者超过100，表示此游戏副本消耗了过多资源，游戏很可能会关闭。",
    },
    服务器负载峰值: {
      返回: ["数字"],
      标签: ["条件", "百分比"],
      提示: "当前游戏副本在过去2秒内造成的最高CPU负载百分比。如果这个数字接近或者超过100，表示此游戏副本消耗了过多资源，游戏很可能会关闭。",
    },
    服务器负载平均值: {
      返回: ["数字"],
      标签: ["条件", "百分比"],
      提示: "当前游戏副本在过去2秒内造成的平均CPU负载百分比。如果这个数字接近或者超过100，表示此游戏副本消耗了过多资源，游戏很可能会关闭。",
    },
    本地玩家: {
      返回: ["实体"],
      标签: ["条件", "玩家"],
      提示: "由终端用户的电脑所操控的玩家。此值对每位终端用户均不相同，所以只有会影响视觉效果或HUD的动作才可访问此值。此值无法储存在变量中。（一般配合“持续 - 全局”规则使用。）",
    },
    本地矢量: {
      参数: [
        {
          名称: "地图矢量",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "将此相对地图坐标的矢量值转化为相对于本地坐标的矢量值。",
        },
        {
          名称: "相对玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "本地矢量是相对此玩家的。",
        },
        {
          名称: "转换",
          类型: "转换",
          选项: 常量.转换,
          提示: "指定此矢量是否接受旋转及平移（通常是位置），或者只接受旋转（通常是方向和速度）。",
        },
      ],
      返回: ["矢量"],
      标签: ["条件", "矢量运算"],
      提示: "相对于本地坐标的矢量值，与所提供的相对地图坐标的矢量值对应。",
    },
    标准化生命值: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家的标准化生命值。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "数学运算"],
      提示: "玩家当前的生命值，包括护甲和护盾，在0到1之间取标准化值。（例如，0为无生命值，0",
    },
    标量积: {
      参数: [
        {
          名称: "值",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "用于计算标量积的矢量之一。",
        },
        {
          名称: "值",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "用于计算标量积的矢量之一。",
        },
      ],
      返回: ["矢量"],
      标签: ["条件", "矢量运算"],
      提示: "指定值的标量积。",
    },
    栏位: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家的栏位编号。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "栏位"],
      提示: "指定玩家的栏位编号。在队伍模式中，每个队伍中玩家的栏位编号为0到5的数字；在自由混战模式中，栏位编号为0到11。",
    },
    栏位数量: {
      参数: [
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "计算下列队伍中栏位的数量。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "栏位", "数量"],
      提示: "队伍或比赛中的栏位数量。",
    },
    正在与人交流: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家的交流状态。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "交流", "判断"],
      提示: "玩家是否在使用任意的交流类型（如表情、播放语音、喷漆等）。",
    },
    正在交流: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家的交流状态。",
        },
        {
          名称: "选项",
          类型: "交流",
          选项: 常量.交流,
          提示: "考察的交流类型。表情的持续时间为准确值，语音的播放时间视为4秒，其他所有交流类型的持续时间视为2秒。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "交流", "判断"],
      提示: "玩家是否在使用指定的交流类型（如表情、播放语音、喷漆等）。",
    },
    正在人格复制: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家的人格复制状态。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "状态", "判断"],
      提示: "指定玩家是否正在复制另一名输出英雄。（为了检测复制的英雄，可使用“正在复制的英雄”的值。）",
    },
    正在使用主要武器: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家的主要武器攻击状态。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "状态", "判断"],
      提示: "指定玩家是否在使用主要武器攻击。",
    },
    正在使用喷漆交流: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家的喷漆状态。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "交流", "判断"],
      提示: "玩家是否在使用喷漆。",
    },
    "正在使用技能 1": {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家的技能1状态。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "状态", "判断"],
      提示: "指定玩家是否在使用技能",
    },
    "正在使用技能 2": {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家的技能2状态。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "状态", "判断"],
      提示: "指定玩家是否在使用技能",
    },
    正在使用终极技能: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家的终极技能状态。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "状态", "判断"],
      提示: "玩家是否在使用终极技能。",
    },
    正在使用英雄: {
      参数: [
        {
          名称: "英雄",
          类型: "条件",
          默认: "英雄(回声)",
          提示: "检测此英雄是否在使用。",
        },
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "检测队伍中是否正在使用这名英雄。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "英雄", "判断"],
      提示: "指定英雄是否正在使用（可以限定在队伍中或游戏中）。",
    },
    正在使用表情交流: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家是否在使用表情。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "交流", "判断"],
      提示: "玩家是否在使用表情。",
    },
    正在使用语音交流: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家是否在播放语音。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "交流", "判断"],
      提示: "玩家是否在播放语音（语音的长度统一视为4秒）。",
    },
    正在使用辅助武器: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家的辅助武器攻击状态。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "状态", "判断"],
      提示: "指定玩家是否在使用辅助武器攻击。",
    },
    正在复制的英雄: {
      标签: ["条件", "英雄", "判断"],
      提示: "",
    },
    正在移动: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家的运动状态。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "状态", "判断"],
      提示: "玩家是否在移动（当前速度不为零）。",
    },
    正在空中: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家的浮空状态。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "状态", "判断"],
      提示: "玩家是否在空中。",
    },
    正在站立: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家的站立状态。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "状态", "判断"],
      提示: "玩家是否在站立（既不在移动也不在空中）。",
    },
    正在等待玩家: {
      返回: ["布尔"],
      标签: ["条件", "比赛", "判断"],
      提示: "此比赛是否正在等待玩家加入。",
    },
    正在装填: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家的装填状态。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "状态", "判断"],
      提示: "指定玩家是否在装填。",
    },
    正在设置: {
      返回: ["布尔"],
      标签: ["条件", "状态", "判断"],
      提示: "此比赛是否正在准备阶段。",
    },
    正在跳跃: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家的跳跃状态。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "状态", "判断"],
      提示: "指定玩家是否在跳跃。",
    },
    正在蹲下: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家是否正在下蹲。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "状态", "判断"],
      提示: "玩家是否在下蹲。",
    },
    正在近战攻击: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家的近战攻击状态。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "状态", "判断"],
      提示: "指定玩家是否在近战攻击。",
    },
    正在防守: {
      参数: [
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "检查此队伍的职责。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "队伍", "判断"],
      提示: "指定队伍是否是防守方。如果游戏模式不是攻防作战、护送、或攻击",
    },
    正在集结英雄: {
      返回: ["布尔"],
      标签: ["条件", "比赛", "判断"],
      提示: "此比赛是否正在集结英雄阶段。",
    },
    此栏位的玩家: {
      参数: [
        {
          名称: "栏位",
          类型: "条件",
          默认: "0",
          提示: "获取指定栏位编号的玩家。在队伍模式中，每个队伍中玩家的栏位编号为0到5的数字；在自由混战模式中，栏位编号为0到11。",
        },
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "从这些队伍中选择玩家。",
        },
      ],
      返回: ["玩家", "玩家数组"],
      标签: ["条件", "玩家"],
      提示: "游戏的指定栏位编号处的玩家或玩家数组。",
    },
    武器: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家的武器。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "武器", "索引"],
      提示: "一名玩家当前的武器。",
    },
    死亡: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家的死亡状态。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "玩家", "判断"],
      提示: "玩家是否死亡。",
    },
    死亡数: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家的死亡次数。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "数量"],
      提示: "指定玩家死亡的次数。这个值会随着游戏的进程不断累积。",
    },
    死亡玩家数量: {
      参数: [
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "计算下列队伍中玩家的数量。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "数量"],
      提示: "队伍或比赛中死亡的玩家数量。",
    },
    比赛回合: {
      返回: ["数字"],
      标签: ["条件", "索引"],
      提示: "比赛当前的回合数，从1开始计数。",
    },
    比赛时间: {
      返回: ["数字"],
      标签: ["条件", "时间"],
      提示: "当前游戏模式阶段剩余的时间，以秒为单位。",
    },
    比赛结束: {
      返回: ["布尔"],
      标签: ["条件", "判断"],
      提示: "此比赛是否已经结束。",
    },
    水平方向夹角: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "以此玩家当前面向的角度为起点。",
        },
        {
          名称: "位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "测定与地图中此位置的夹角。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "角度"],
      提示: "玩家当前朝向的方向与指定位置之间的水平方向夹角，单位为度。如果位置在玩家左边，则结果为正数。否则，结果为零或负数。",
    },
    水平朝向角度: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家的面向角度。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "角度"],
      提示: "玩家当前面对的方向与地图的水平夹角。当玩家转向左方时这个值会增加。（范围为",
    },
    水平速度: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家的水平速度。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "速度"],
      提示: "一名玩家在水平方向上的当前速度，单位为米",
    },
    治疗者: {
      返回: ["实体"],
      标签: ["条件", "玩家"],
      提示: "根据此规则处理的事件中造成治疗的玩家。可能与被治疗者或事件玩家是同一个人。",
    },
    治疗调整数量: {
      返回: ["数字"],
      标签: ["条件", "数量"],
      提示: "由“开始治疗调整”动作启动的治疗调整副本的当前数量。",
    },
    消灭数: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家的消灭次数。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "数量"],
      提示: "指定玩家参与消灭的次数。这个值会随着游戏的进程不断累积。",
    },
    添加至数组: {
      参数: [
        {
          名称: "数组",
          类型: "条件",
          默认: "空数组",
          提示: "要被添加的数组。",
        },
        {
          名称: "值",
          类型: "条件",
          默认: "0",
          提示: "加入数列尾端的值。如果值本身是一个数列，则添加其中的每一个元素。",
        },
      ],
      返回: ["数组"],
      标签: ["条件", "数组"],
      提示: "一个数组的复制，将一个或更多的值添加至其末尾。",
    },
    游戏模式: {
      参数: [
        {
          名称: "模式",
          类型: "模式",
          选项: 常量.模式,
          提示: "一个模式选项。",
        },
      ],
      返回: ["模式"],
      标签: ["条件", "模式"],
      提示: "一个模式常量。",
    },
    游戏正在进行中: {
      返回: ["布尔"],
      标签: ["条件", "判断"],
      提示: "此比赛是否正在主要阶段（可以进行战斗并获得分数的阶段）。",
    },
    玩家数据: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家的数据。",
        },
        {
          名称: "数据",
          类型: "玩家数据",
          选项: 常量.玩家数据,
          提示: "获取数据。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "数据"],
      提示: "提供指定玩家的数据（仅限当前比赛）。仅在游戏进行时收集数据。机器人不会收集数据。",
    },
    玩家数量: {
      参数: [
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "计算下列队伍中玩家的数量。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "数量"],
      提示: "队伍或比赛中的玩家数量。",
    },
    玩家英雄数据: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家的数据。",
        },
        {
          名称: "英雄",
          类型: "条件",
          默认: "英雄(回声)",
          提示: "获取此英雄的数据。",
        },
        {
          名称: "数据",
          类型: "英雄数据",
          选项: 常量.英雄数据,
          提示: "获取数据。",
        },
      ],
      返回: ["数据", "英雄"],
      标签: ["条件", "英雄数据"],
      提示: "提供指定玩家使用指定英雄的数据（仅限当前比赛）。仅在游戏进行时收集数据。机器人不会收集数据。",
    },
    生命值: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家的生命值。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "玩家"],
      提示: "玩家当前的生命值，包括护甲和护盾。",
    },
    目标位置: {
      参数: [
        {
          名称: "数字",
          类型: "条件",
          默认: "0",
          提示: "考察的目标点的索引，从0开始逐渐累加。每个控制点、运载目标检查点、运载目标目的地都有其独自的索引。",
        },
      ],
      返回: ["矢量"],
      标签: ["条件", "位置"],
      提示: "特定目标点（控制点、运载目标检查点、或运载目标目的地）在地图中的位置。在攻防作战、攻击",
    },
    目标是否完成: {
      参数: [
        {
          名称: "数字",
          类型: "条件",
          默认: "0",
          提示: "考察的目标点的索引，从0开始逐渐累加。每个控制点、运载目标检查点、运载目标目的地都有其独自的索引。",
        },
      ],
      返回: ["布尔"],
      标签: ["条件", "判断"],
      提示: "目标是否已经完成。如果游戏模式不是攻防作战、护送、或攻击/护送，则结果为“假”。在攻防作战、攻击/护送及占领要点模式中生效。",
    },
    目标点上玩家数量: {
      返回: ["数字"],
      标签: ["条件", "数量"],
      提示: "在运载目标或控制点上的玩家数量（可以是一支队伍中的，也可以是整个比赛中的）。",
    },
    目标点占领百分比: {
      返回: ["数字"],
      标签: ["条件", "百分比"],
      提示: "已激活的控制点当前的占领进度（以百分比表示）。",
    },
    相距距离: {
      参数: [
        {
          名称: "开始位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "用于测量距离的两个位置之一。",
        },
        {
          名称: "结束位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "用于测量距离的两个位置之一。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "位置"],
      提示: "两个位置之间的距离，单位为米。",
    },
    真: {
      返回: ["布尔"],
      标签: ["条件", "布尔"],
      提示: "布尔值，真。",
    },
    眼睛位置: {
      参数: [
        {
          名称: "位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "获取第一人称视角的位置（用于瞄准）的玩家。",
        },
      ],
      返回: ["矢量"],
      标签: ["条件", "位置"],
      提示: "玩家第一人称视角的位置（用于瞄准）。",
    },
    矢量: {
      参数: [
        {
          名称: "X",
          类型: "条件",
          默认: "0",
          提示: "矢量的X轴值，表示向左的量。",
        },
        {
          名称: "Y",
          类型: "条件",
          默认: "0",
          提示: "矢量的Y轴值，表示向上的量。",
        },
        {
          名称: "Z",
          类型: "条件",
          默认: "0",
          提示: "矢量的Z轴值，表示向前的量。",
        },
      ],
      返回: ["矢量"],
      标签: ["条件", "矢量"],
      提示: "矢量在三个方向上的实数值（X，Y，Z），X为左，Y为上，Z为前。矢量用来表示位置、方向和速度。",
    },
    矢量积: {
      参数: [
        {
          名称: "值",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "用于计算矢量积的矢量之一。",
        },
        {
          名称: "值",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "用于计算矢量积的矢量之一。",
        },
      ],
      返回: ["矢量"],
      标签: ["条件", "矢量运算"],
      提示: "指定值的矢量积。（左乘以上等于前）",
    },
    矢量间夹角: {
      参数: [
        {
          名称: "矢量",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "需以角度为单位测量夹角的两个方向性矢量之一。该矢量不需要预先归一化。",
        },
        {
          名称: "矢量",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "需以角度为单位测量夹角的两个方向性矢量之一。该矢量不需要预先归一化。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "角度"],
      提示: "两方向性矢量间的夹角（不需要归一化）",
    },
    空数组: {
      返回: ["数组"],
      标签: ["条件", "数组"],
      提示: "一个没有任何元素的数组。",
    },
    类型的最大生命值: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家的最大生命值。",
        },
        {
          名称: "生命值",
          类型: "生命类型",
          选项: 常量.生命类型,
          提示: "获取此类型的最大生命值。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "玩家"],
      提示: "玩家此类型的最大生命值（生命，护甲，或护盾）。",
    },
    类型的生命值: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家的生命值。",
        },
        {
          名称: "生命值",
          类型: "生命类型",
          选项: 常量.生命类型,
          提示: "获取此类型的生命值。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "玩家"],
      提示: "玩家此类型的生命值（生命，护甲，或护盾）。",
    },
    终极技能充能百分比: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家当前终极技能的充能百分比。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "技能", "百分比"],
      提示: "一名玩家当前终极技能的充能百分比。",
    },
    绝对值: {
      参数: [
        {
          名称: "值",
          类型: "条件",
          默认: "0",
          提示: "计算此实数值的绝对值。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "数学运算"],
      提示: "指定值的绝对值。",
    },
    自定义颜色: {
      参数: [
        {
          名称: "红色",
          类型: "条件",
          默认: "255",
          提示: "一种颜色的红色分量。(0-255)",
        },
        {
          名称: "绿色",
          类型: "条件",
          默认: "255",
          提示: "一种颜色的绿色分量。(0-255)",
        },
        {
          名称: "蓝色",
          类型: "条件",
          默认: "255",
          提示: "一种颜色的蓝色分量。(0-255)",
        },
        {
          名称: "不透明度",
          类型: "条件",
          默认: "255",
          提示: "一种颜色的不透明度分量。(0-255)",
        },
      ],
      返回: ["颜色"],
      标签: ["条件", "颜色"],
      提示: "可设置指定RGB值和不透明度的自定义颜色。",
    },
    英雄: {
      参数: [
        {
          名称: "英雄",
          类型: "英雄",
          选项: 常量.英雄,
          提示: "一个英雄选项。",
        },
      ],
      返回: ["英雄"],
      标签: ["条件", "英雄"],
      提示: "一个英雄常量。",
    },
    英雄图标字符串: {
      参数: [
        {
          名称: "值",
          类型: "条件",
          默认: "英雄(回声)",
          提示: "此英雄将被转换为一个图标。",
        },
      ],
      返回: ["字符串"],
      标签: ["条件", "字符串"],
      提示: "将一个英雄的参数转化为字符串并作为图标显示（每个字符串最多4项）。",
    },
    英雄数量: {
      参数: [
        {
          名称: "英雄",
          类型: "条件",
          默认: "英雄(回声)",
          提示: "检测此英雄是否在使用。",
        },
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "检测队伍中是否正在使用这名英雄。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "数量"],
      提示: "在一支队伍或此比赛中使用指定英雄的数量。",
    },
    范围内玩家: {
      参数: [
        {
          名称: "中间",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "以此位置为中心测定距离。",
        },
        {
          名称: "半径",
          类型: "条件",
          默认: "0",
          提示: "玩家需在此距离范围内（单位：米）才会出现在结果列表中。",
        },
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "所选队伍的玩家会出现在结果列表中。",
        },
        {
          名称: "视线",
          类型: "视线检测",
          选项: 常量.视线检测,
          提示: "只有通过视线检测的玩家才会出现在结果列表中。",
        },
      ],
      返回: ["数组"],
      标签: ["条件", "玩家"],
      提示: "一个列表，其中包含距离指定位置小于一定距离的玩家，可设置是否受到队伍及视线的限制。",
    },
    被攻击方: {
      返回: ["实体"],
      标签: ["条件", "玩家"],
      提示: "根据此规则处理的事件中受到伤害的玩家。可能与攻击者或事件玩家是同一个人。",
    },
    视角中的玩家: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "检测此玩家的视野。",
        },
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "所选队伍的玩家会出现在结果列表中。",
        },
        {
          名称: "视角",
          类型: "条件",
          默认: "45",
          提示: "用于比较的视角，单位为度。",
        },
      ],
      返回: ["实体"],
      标签: ["条件", "玩家"],
      提示: "最接近此玩家准星位置的玩家，可以选择是否限制所在队伍。",
    },
    角度差: {
      参数: [
        {
          名称: "角度",
          类型: "条件",
          默认: "0",
          提示: "用于计算结果角度的两个角度之一。",
        },
        {
          名称: "角度",
          类型: "条件",
          默认: "0",
          提示: "用于计算结果角度的两个角度之一。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "角度"],
      提示: "两个角度之间的度数差。将两个角度折算为彼此+/-180度范围内之后进行计算，如果第二个角度比第一个大则结果为正数。否则结果为负数。",
    },
    角度的余弦值: {
      参数: [
        {
          名称: "角度",
          类型: "条件",
          默认: "0",
          提示: "角度，以角度为单位。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "角度"],
      提示: "指定角度（以度为单位）的余弦值。",
    },
    角度的正切值: {
      参数: [
        {
          名称: "角度",
          类型: "条件",
          默认: "0",
          提示: "角度，以角度为单位。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "角度"],
      提示: "指定角度（以度为单位）的正切值。",
    },
    角度的正弦值: {
      参数: [
        {
          名称: "角度",
          类型: "条件",
          默认: "0",
          提示: "角度，以角度为单位。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "角度"],
      提示: "指定角度（以度为单位）的正弦值。",
    },
    距离准星最近的玩家: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "搜索距此玩家准星最近的玩家。",
        },
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "搜索此队伍中最近的玩家。",
        },
      ],
      返回: ["实体"],
      标签: ["条件", "玩家"],
      提示: "最接近指定玩家准星位置的玩家，可以选择是否限制所在队伍。",
    },
    距离最近的玩家: {
      参数: [
        {
          名称: "中间",
          类型: "条件",
          默认: "事件玩家",
          提示: "以此位置为起点测量距离。",
        },
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "最近一名玩家所在的队伍。",
        },
      ],
      返回: ["实体"],
      标签: ["条件", "玩家"],
      提示: "距离一个位置最近的玩家，可以选择是否限制所在队伍。",
    },
    距离最远的玩家: {
      参数: [
        {
          名称: "中间",
          类型: "条件",
          默认: "事件玩家",
          提示: "以此位置为起点测量距离。",
        },
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "最近一名玩家所在的队伍。",
        },
      ],
      返回: ["实体"],
      标签: ["条件", "玩家"],
      提示: "距离一个位置最远的玩家，可以选择是否限制所在队伍。",
    },
    较大: {
      参数: [
        {
          名称: "值",
          类型: "条件",
          默认: "0",
          提示: "左边的运算量，可以是结果为数字的值。",
        },
        {
          名称: "值",
          类型: "条件",
          默认: "1",
          提示: "右边的运算量，可以是结果为数字的值。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "数学运算"],
      提示: "两个数字中较大的一个。",
    },
    较小: {
      参数: [
        {
          名称: "值",
          类型: "条件",
          默认: "0",
          提示: "左边的运算量，可以是结果为数字的值。",
        },
        {
          名称: "值",
          类型: "条件",
          默认: "1",
          提示: "右边的运算量，可以是结果为数字的值。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "数学运算"],
      提示: "两个数字中较小的一个。",
    },
    输入绑定字符串: {
      参数: [
        {
          名称: "按钮",
          类型: "条件",
          默认: "按钮(终极技能)",
          提示: "将这个输入绑定的按键转化为图标。",
        },
      ],
      返回: ["字符串"],
      标签: ["条件", "字符串"],
      提示: "将一个“按钮”参数转化为一个字符串，根据玩家所输入的绑定按键显示。此值不能存储在变量中。",
    },
    运载目标位置: {
      返回: ["矢量"],
      标签: ["条件", "位置"],
      提示: "已激活的运载目标在地图中的位置。",
    },
    运载目标进度百分比: {
      返回: ["数字"],
      标签: ["条件", "百分比"],
      提示: "已激活的运载目标前往目标地的当前进度（以百分比表示）。",
    },
    选择英雄的玩家: {
      参数: [
        {
          名称: "英雄",
          类型: "条件",
          默认: "英雄(回声)",
          提示: "检测此英雄是否在使用。",
        },
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "检测队伍中是否正在使用这名英雄。",
        },
      ],
      返回: ["实体"],
      标签: ["条件", "玩家"],
      提示: "此数列中是一支队伍或本场比赛中正在使用指定英雄的玩家。",
    },
    逐帧更新: {
      参数: [
        {
          名称: "值",
          类型: "条件",
          默认: "空",
          提示: "此值的更新频率将从每几帧更新一次提高为每一帧更新一次。",
        },
      ],
      返回: ["条件"],
      标签: ["条件", "赋值"],
      提示: "结果为提供给“输入值”参数的值，并且会将此值的更新频率提高为每一帧更新一次。可以用来使特定值的出现更加平滑，例如“所选位置”等通常每几帧才会更新一次的值。可对条件和会重新赋值的动作参数使用。可能会增加服务器负载和/或降低帧率。",
    },
    速度: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家的速度。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "速度"],
      提示: "一名玩家的当前速度，单位为米/秒。",
    },
    速率: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家的速率。",
        },
      ],
      返回: ["矢量"],
      标签: ["条件", "矢量运算"],
      提示: "玩家当前的速率，此值为一个矢量。如果玩家位于表面上，则矢量在Y方向上的分量为0，即使在上坡或下坡。",
    },
    重生点: {
      参数: [
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "获取此队伍的重生点。",
        },
      ],
      返回: ["数组"],
      标签: ["条件", "比赛"],
      提示: "队伍或比赛中激活的重生点，以实体数组的形式提供。",
    },
    阈值: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家的方向输入。",
        },
      ],
      返回: ["矢量"],
      标签: ["条件", "玩家"],
      提示: "玩家所输入的方向，通过一个矢量表示，X轴为水平（正值代表向左），Z轴为垂直（正值代表向前）。",
    },
    队伍: {
      参数: [
        {
          名称: "队伍",
          类型: "队伍",
          选项: 常量.队伍,
          提示: "一个队伍选项。“所有队伍”或“双方”选项代表队伍模式中的两支队伍，或自由混战模式中的全部玩家。",
        },
      ],
      返回: ["队伍"],
      标签: ["条件", "队伍"],
      提示: "一个队伍常量。“所有队伍”或“双方”选项代表队伍模式中的两支队伍，或自由混战模式中的全部玩家。",
    },
    随机实数: {
      参数: [
        {
          名称: "最小",
          类型: "条件",
          默认: "0",
          提示: "允许的最小实数。",
        },
        {
          名称: "最大",
          类型: "条件",
          默认: "0",
          提示: "允许的最大实数。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "数学运算"],
      提示: "指定最小值与最大值之间的一个随机实数。",
    },
    随机数组: {
      参数: [
        {
          名称: "数组",
          类型: "条件",
          默认: "空数组",
          提示: "对此数组的复制进行随机排列。",
        },
      ],
      返回: ["数组"],
      标签: ["条件", "数组"],
      提示: "复制指定的数组，所有值随机排序。",
    },
    随机整数: {
      参数: [
        {
          名称: "最小",
          类型: "条件",
          默认: "0",
          提示: "允许的最小整数。如果此处输入的是一个实数，则取最接近此实数的整数。",
        },
        {
          名称: "最大",
          类型: "条件",
          默认: "0",
          提示: "允许的最大整数。如果此处输入的是一个实数，则取最接近此实数的整数。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "数学运算"],
      提示: "指定最小值与最大值之间的一个随机整数（包括最小值与最大值在内）。",
    },
    面朝方向: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家面向的方向。",
        },
      ],
      返回: ["矢量"],
      标签: ["条件", "方向"],
      提示: "玩家当前面向方向与地图相对角度的单位长度方向矢量。此矢量的值同进包括水平和垂直方向。",
    },
    颜色: {
      参数: [
        {
          名称: "颜色",
          类型: "颜色",
          选项: 常量.颜色,
          提示: "一个颜色选项。",
        },
      ],
      返回: ["颜色"],
      标签: ["条件", "颜色"],
      提示: "一个颜色常量。",
    },
    首个: {
      参数: [
        {
          名称: "数组",
          类型: "条件",
          默认: "空数组",
          提示: "获取此数组中的值。",
        },
      ],
      返回: ["条件"],
      标签: ["条件", "数组"],
      提示: "指定数组开始处的值。如果指定数组为空，此值则为0。",
    },
    高度: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获取此玩家的高度。",
        },
      ],
      返回: ["数字"],
      标签: ["条件", "玩家"],
      提示: "玩家当前距离表面的高度，以米为单位。如果玩家正在表面上则结果为0。",
    },
  },

  动作: {
    Else: {
      标签: ["动作", "流程"],
      提示: "表示仅在前一个if或else if的条件为假时，才会开始的一系列行动。",
    },
    "Else If": {
      参数: [
        {
          名称: "条件",
          类型: "条件",
          默认: "空",
          提示: "如果此值为真，则继续执行下一个行动。否则，跳转至当前层级的下一个 Else If ，Else 或 End 行动并执行。",
        },
      ],
      标签: ["动作", "流程"],
      提示: "表示仅在指定条件为真，且前一个 If 或 Else If 的条件为假时，才会开始的一系列行动。",
    },
    End: {
      标签: ["动作", "流程"],
      提示: "表示以 If ，Else If ，While 或 For 开始的一系列行动的结束。",
    },
    "For 全局变量": {
      参数: [
        {
          名称: "控制变量",
          类型: "全局变量",
          提示: "此变量将在循环（执行）过程中被修改。循环开始时将其设为初始值，直到控制变量达到或超过终止值时循环结束。",
        },
        {
          名称: "起始值",
          类型: "条件",
          默认: "0",
          提示: "当循环开始时，将控制变量设为此变量。",
        },
        {
          名称: "终止值",
          类型: "条件",
          默认: "0",
          提示: "如果控制变量的值达到或超过此值，则退出循环，并跳转至 End 行动后的下一个行动继续执行。考察控制变量是否超过此值时，会根据步长值是正是负进行判断。如果控制变量在循环开始时已经达到或超过此值，则立即退出循环。",
        },
        {
          名称: "步长",
          类型: "条件",
          默认: "1",
          提示: "当达到 End 行动时，将此值加到控制变量上。如果此改动使控制变量达到或超过终止值，则退出循环，跳转执行 End 行动后的下一个行动。否则继续循环，并跳转至 For 行动后的下一个行动开始执行。",
        },
      ],
      标签: ["动作", "流程"],
      提示: "表示在循环中执行的一系列行动的开始，并在每次循环时修改控制变量的值。当前级别中的下一个End行动表示循环的结束。如果执行至循环顶部时，控制条件达到或超过终止值，则退出循环，跳至 End 操作之后的下一个操作执行。",
    },
    "For 玩家变量": {
      参数: [
        {
          名称: "控制玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "在此循环中改变此玩家的变量。如果指定了多个玩家，则使用第一个玩家。",
        },
        {
          名称: "控制变量",
          类型: "玩家变量",
          提示: "此变量将在循环（执行）过程中被修改。循环开始时将其设为初始值，直到控制变量达到或超过终止值时循环结束。",
        },
        {
          名称: "起始值",
          类型: "条件",
          默认: "0",
          提示: "当循环开始时，将控制变量设为此变量。",
        },
        {
          名称: "终止值",
          类型: "条件",
          默认: "0",
          提示: "如果控制变量的值达到或超过此值，则退出循环，并跳转至 End 行动后的下一个行动继续执行。考察控制变量是否超过此值时，会根据步长值是正是负进行判断。如果控制变量在循环开始时已经达到或超过此值，则立即退出循环。",
        },
        {
          名称: "步长",
          类型: "条件",
          默认: "1",
          提示: "当达到 End 行动时，将此值加到控制变量上。如果此改动使控制变量达到或超过终止值，则退出循环，跳转执行 End 行动后的下一个行动。否则继续循环，并跳转至 For 行动后的下一个行动开始执行。",
        },
      ],
      标签: ["动作", "流程"],
      提示: "表示在循环中执行的一系列行动的开始，并在每次循环时修改控制变量的值。当前级别中的下一个End行动表示循环的结束。如果执行至循环顶部时，控制条件达到或超过终止值，则退出循环，跳至 End 操作之后的下一个操作执行。",
    },
    If: {
      参数: [
        {
          名称: "条件",
          类型: "条件",
          默认: "空",
          提示: "如果此值为真，则继续执行下一个行动。否则，跳转至当前层级的下一个 Else If ，Else 或 End 行动并执行。",
        },
      ],
      标签: ["动作", "流程"],
      提示: "表示仅在指定条件为真时才会开始的一系列行动。",
    },
    While: {
      参数: [
        {
          名称: "条件",
          类型: "条件",
          默认: "假",
          提示: "如果此值为真，则继续执行下一个行动。否则，跳转至当前层级的下一个 Else If ，Else 或 End 行动并执行。",
        },
      ],
      标签: ["动作", "流程"],
      提示: "表示只要指定的条件为真，就会在循环中执行的一系列行动的开始. 当前级别中的下一个 End 行动表示循环的结束. 如果执行至循环顶部时，条件评估为假，则退出循环，跳至 End 操作之后的下一个操作执行。",
    },
    中断: {
      标签: ["动作", "流程"],
      提示: "表示一个中止当前 While 或 For 循环的行动. 跳至 End 行动后的下一个行动继续执行。",
    },
    中止: {
      标签: ["动作", "流程"],
      提示: "停止执行动作列表。",
    },
    为玩家添加生命池: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的移动碰撞将受到影响。",
        },
        {
          名称: "生命值类型",
          类型: "生命类型",
          选项: 常量.生命类型,
          提示: "指定此生命池中所包含的生命值类型（生命值，护甲或护盾）。",
        },
        {
          名称: "最大生命值",
          类型: "条件",
          默认: "0",
          提示: "生命池的数值。",
        },
        {
          名称: "可恢复",
          类型: "条件",
          默认: "假",
          提示: "此生命池中的生命在失去后是否可以由治疗恢复。如果此值为假，则此生命值在受到伤害后会削减并消失。",
        },
        {
          名称: "重新赋值",
          类型: "条件",
          默认: "假",
          提示: "如果此值为真，且“可恢复”为真，则每一帧都会重新为“最大生命值”赋值。如果此值为假或“可恢复”为假，则“最大生命值”只会在此行动执行时被赋值一次。",
        },
      ],
      标签: ["动作", "流程"],
      提示: "为一名或多名玩家添加临时的生命池。如果要指定此生命池，可以使用“上一个创建的生命池”值。同一名玩家身上任意一个生命值类型（生命、护甲或护盾）的生命池最多可以存在16个（包括基本生命池和由技能获得的生命池）。",
    },
    交流: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家将自动开始交流。",
        },
        {
          名称: "选项",
          类型: "交流",
          选项: 常量.交流,
          提示: "交流的类型。",
        },
      ],
      标签: ["动作"],
      提示: "使一名或多名玩家使用一个表情、语音或其他已装备的方式进行交流。",
    },
    传送: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家将被传送。",
        },
        {
          名称: "位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "玩家将被传送到的位置。如果此处填入一名玩家，则使用此玩家所在的位置。",
        },
      ],
      标签: ["动作"],
      提示: "将一名或多名玩家传送到指定位置。",
    },
    伤害: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家将受到伤害。",
        },
        {
          名称: "伤害者",
          类型: "条件",
          默认: "事件玩家",
          提示: "伤害视为此名玩家造成的。如果“伤害者”设置为“空”则此伤害不会归到任何玩家名下。",
        },
        {
          名称: "伤害量",
          类型: "条件",
          默认: "0",
          提示: "造成的伤害量。此数值可能会受到增益、减益状态或护甲的影响。",
        },
      ],
      标签: ["动作"],
      提示: "立刻为一名或多名玩家造成伤害，可能会杀死玩家。",
    },
    修改全局变量: {
      参数: [
        {
          名称: "变量",
          类型: "全局变量",
          提示: "要修改的全局变量。",
        },
        {
          名称: "操作",
          类型: "操作",
          选项: 常量.操作,
          提示: "变量的值改变的方式。选项包括标准运算操作，以及数组操作（如添加或移除值）。",
        },
        {
          名称: "值",
          类型: "条件",
          默认: "0",
          提示: "用于修改的值。若要进行运算操作，则此值为两个运算量中的第二个，第一个运算量为变量当前的值。若要进行数组操作，则此值是用于添加或移除的值。",
        },
      ],
      标签: ["动作"],
      提示: "修改一个全局变量的值，全局变量即属于游戏本身的变量。",
    },
    修改玩家分数: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的分数将被改变。",
        },
        {
          名称: "得分",
          类型: "条件",
          默认: "0",
          提示: "增加或减少的分数。如果为正数则增加分数，为负数则减少分数。",
        },
      ],
      标签: ["动作"],
      提示: "修改一名或多名玩家的分数（击杀数）。此动作只会在自由混战模式中生效。",
    },
    修改玩家变量: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "此玩家的变量将被修改。如果有多个玩家，则每个玩家的变量都将被设置。",
        },
        {
          名称: "变量",
          类型: "玩家变量",
          提示: "指定修改此玩家的哪些变量。",
        },
        {
          名称: "操作",
          类型: "操作",
          选项: 常量.操作,
          提示: "变量的值改变的方式。选项包括标准运算操作，以及数组操作（如添加或移除值）。",
        },
        {
          名称: "值",
          类型: "条件",
          默认: "0",
          提示: "用于修改的值。若要进行运算操作，则此值为两个运算量中的第二个，第一个运算量为变量当前的值。若要进行数组操作，则此值是用于添加或移除的值。",
        },
      ],
      标签: ["动作"],
      提示: "修改一个玩家变量的值，玩家变量即属于一个特定玩家的变量。",
    },
    修改队伍分数: {
      参数: [
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "要改变分数的队伍。",
        },
        {
          名称: "得分",
          类型: "条件",
          默认: "0",
          提示: "增加或减少的分数。如果为正数则增加分数，为负数则减少分数。",
        },
      ],
      标签: ["动作"],
      提示: "改变一方或双方队伍的分数。此动作在自由混战模式或没有队伍分数的模式中无效。",
    },
    停止为机器人强制设置名称: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "停止强制设置下列玩家的名称。",
        },
      ],
      标签: ["动作"],
      提示: "取消对指定玩家进行“开始为机器人强制设置名称”的行为。",
    },
    停止伤害调整: {
      参数: [
        {
          名称: "伤害调整ID",
          类型: "条件",
          默认: "上一个伤害调整ID",
          提示: "指定要结束的伤害调整副本。此ID可以是”上一个伤害调整ID“，或一个之前储存”上一个伤害调整ID“的变量。",
        },
      ],
      标签: ["动作"],
      提示: "停止由“开始伤害调整”动作启动的一个伤害调整。",
    },
    停止修改英雄语音: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的英雄语音声音将停止被修改。",
        },
      ],
      标签: ["动作"],
      提示: "取消“开始修改英雄语音”动作的效果。",
    },
    停止加速: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家将停止加速。",
        },
      ],
      标签: ["动作"],
      提示: "停止“开始加速”动作造成的加速效果。",
    },
    停止助攻: {
      参数: [
        {
          名称: "助攻ID",
          类型: "条件",
          默认: "上一个助攻ID",
          提示: "指定要停止的助攻副本。此ID可以是“上一个助攻ID”，或一个之前储存“上一个助攻ID”的变量。",
        },
      ],
      标签: ["动作"],
      提示: "指定要停止的助攻副本。此ID可以是“上一个助攻ID”，或一个之前储存“上一个助攻ID”的变量。",
    },
    停止定向阈值: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "恢复下列玩家的默认阈值控制。",
        },
      ],
      标签: ["动作"],
      提示: "取消“开始定向阈值”所造成的行为。",
    },
    停止强制玩家选择英雄: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家将不再被强制使用指定英雄。",
        },
      ],
      标签: ["动作"],
      提示: "停止强制一名或多名玩家使用指定的英雄。此行动不会使玩家复生，只会在其下次选择英雄时恢复可用的其他英雄。",
    },
    停止强制设置玩家位置: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "停止强制设置下列玩家的位置。",
        },
      ],
      标签: ["动作"],
      提示: "取消“开始强制设置玩家位置”行动对指定的一名或多名玩家造成的影响。这些玩家将从其最后被强制设置到的位置开始进行正常移动。",
    },
    停止强制设置玩家轮廓: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列被观察的玩家的轮廓将被设置。",
        },
        {
          名称: "观察玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "从观察玩家的视角看，被观察的玩家的轮廓将被重新设置。",
        },
      ],
      标签: ["动作"],
      提示: "从观察玩家的视角看，取消被观察的玩家的“开始强制设置玩家轮廓”效果。",
    },
    停止强制重生室: {
      参数: [
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "这支队伍将使用正常状态下的重生室重生。",
        },
      ],
      标签: ["动作"],
      提示: "取消“开始强制使用重生室”动作对一支队伍的效果。",
    },
    停止所有伤害调整: {
      标签: ["动作"],
      提示: "停止所有由“开始伤害调整”动作启动的伤害调整。",
    },
    停止所有助攻: {
      标签: ["动作"],
      提示: "停止所有由“开始助攻”动作启动的助攻。",
    },
    停止所有持续伤害: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "停止下列玩家身上程序给予的持续伤害。",
        },
      ],
      标签: ["动作"],
      提示: "停止一个或多个玩家身上所有由“开始持续伤害”给予的持续伤害。",
    },
    停止所有持续治疗: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "停止下列玩家身上程序给予的持续治疗。",
        },
      ],
      标签: ["动作"],
      提示: "停止一个或多个玩家身上所有由“开始持续治疗”给予的持续治疗。",
    },
    停止所有治疗调整: {
      标签: ["动作"],
      提示: "停止所有由“开始治疗调整”动作启动的治疗调整。",
    },
    停止持续伤害: {
      参数: [
        {
          名称: "持续伤害ID",
          类型: "条件",
          默认: "上一个持续伤害ID",
          提示: "指定要结束的持续伤害副本。此ID可以是”上一个持续伤害ID“，或一个之前储存”上一个持续伤害ID“的变量。",
        },
      ],
      标签: ["动作"],
      提示: "停止一个由”开始持续伤害“动作启动的持续伤害副本。",
    },
    停止持续治疗: {
      参数: [
        {
          名称: "持续治疗ID",
          类型: "条件",
          默认: "上一个持续治疗ID",
          提示: "指定要结束的持续治疗副本。此ID可以是”上一个持续治疗ID“，或一个之前储存”上一个持续治疗ID“的变量。",
        },
      ],
      标签: ["动作"],
      提示: "停止一个由”开始持续治疗“动作启动的持续治疗副本。",
    },
    停止按下按钮: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家将不再持续按下虚拟按钮。",
        },
        {
          名称: "按钮",
          类型: "条件",
          默认: "按钮(终极技能)",
          提示: "不再持续按下的虚拟按钮。",
        },
      ],
      标签: ["动作"],
      提示: "取消“开始按下按钮”动作的效果。",
    },
    停止朝向: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家将停止转向。",
        },
      ],
      标签: ["动作"],
      提示: "停止“开始转向”动作造成的转向效果。",
    },
    停止治疗调整: {
      参数: [
        {
          名称: "治疗调整ID",
          类型: "条件",
          默认: "上一个治疗调整ID",
          提示: "指定要结束的治疗调整副本。此ID可以是”上一个治疗调整ID“，或一个之前储存”上一个治疗调整ID“的变量。",
        },
      ],
      标签: ["动作"],
      提示: "停止由“开始治疗调整”动作启动的一个治疗调整。",
    },
    停止调整玩家大小: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "停止强制设置下列玩家的大小。",
        },
      ],
      标签: ["动作"],
      提示: "停止调整一名或多名玩家的大小。",
    },
    停止调整障碍大小: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "停止改变下列玩家的屏障大小。",
        },
      ],
      标签: ["动作"],
      提示: "停止调整一名或多名玩家的屏障大小。",
    },
    停止转换阈值: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "停止转换下列玩家的阈值。",
        },
      ],
      标签: ["动作"],
      提示: "停止由“开始转换阈值”所开始的转换效果。",
    },
    停止追踪全局变量: {
      参数: [
        {
          名称: "变量",
          类型: "全局变量",
          提示: "指定要停止修改的全局变量。",
        },
      ],
      标签: ["动作"],
      提示: "停止追踪一个全局变量，并使其保持为当前值。",
    },
    停止追踪玩家变量: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "此玩家的变量将停止改变。如果有多个玩家，则每个玩家的变量都将停止改变。",
        },
        {
          名称: "变量",
          类型: "玩家变量",
          提示: "指定要停止修改的玩家变量。",
        },
      ],
      标签: ["动作"],
      提示: "停止追踪一个玩家变量，并使其保持为当前值。",
    },
    停止镜头: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "将下列玩家的镜头恢复至默认视角。",
        },
      ],
      标签: ["动作"],
      提示: "将镜头缩放恢复至默认视角。",
    },
    停止限制阈值: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的移动将恢复正常。",
        },
      ],
      标签: ["动作"],
      提示: "取消“开始限制阈值”动作的效果。",
    },
    关闭游戏预设复生模式: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的复生将受到影响。",
        },
      ],
      标签: ["动作"],
      提示: "使一名或多名玩家不再自动复生，只允许其在程序命令控制下复生。",
    },
    关闭游戏预设完成条件: {
      标签: ["动作"],
      提示: "取消游戏模式自带的完成条件，比赛只由程序命令完成。",
    },
    关闭游戏预设计分模式: {
      标签: ["动作"],
      提示: "取消游戏模式本身对玩家和队伍进行的计分，分数只会由程序命令改变。",
    },
    关闭游戏预设通告模式: {
      标签: ["动作"],
      提示: "禁用游戏模式中所有提示语音，直到重新启用或比赛结束为止。",
    },
    关闭游戏预设音乐模式: {
      标签: ["动作"],
      提示: "禁用游戏模式中所有音乐，直到重新启用或比赛结束为止。",
    },
    击杀: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家将被杀死。",
        },
        {
          名称: "击杀者",
          类型: "条件",
          默认: "事件玩家",
          提示: "击杀视为此名玩家造成的。如果“击杀者”设置为“空”则此击杀不会归到任何玩家名下。",
        },
      ],
      标签: ["动作"],
      提示: "立即杀死一名或多名玩家。",
    },
    创建HUD文本: {
      参数: [
        {
          名称: "可见",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家将会看到这条HUD文本。",
        },
        {
          名称: "标题",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "将要显示的文本（可以为空）。",
        },
        {
          名称: "子标题",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "将要显示的子标题文本（可以为空）。",
        },
        {
          名称: "文本",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "将要显示的正文文本（可以为空）。",
        },
        {
          名称: "坐标",
          类型: "HUD位置",
          选项: 常量.HUD位置,
          提示: "文本在屏幕上出现的位置。",
        },
        {
          名称: "排序",
          类型: "条件",
          默认: "0",
          提示: "此文本与其他在同样位置的文本的排序关系。排序较高的文本会在排序较低的文本之后显示。",
        },
        {
          名称: "标题颜色",
          类型: "条件",
          默认: "颜色(白色)",
          提示: "所创建标题文本的颜色。如果选择了一支队伍，此效果将显示为红色或蓝色，根据观察者是否与这支队伍敌对决定。",
        },
        {
          名称: "子标题颜色",
          类型: "条件",
          默认: "颜色(白色)",
          提示: "所创建子标题文本的颜色。如果选择了一支队伍，此效果将显示为红色或蓝色，根据观察者是否与这支队伍敌对决定。",
        },
        {
          名称: "文本颜色",
          类型: "条件",
          默认: "颜色(白色)",
          提示: "所创建文本的颜色。如果选择了一支队伍，此效果将显示为红色或蓝色，根据观察者是否与这支队伍敌对决定。",
        },
        {
          名称: "重新赋值",
          类型: "HUD文本刷新",
          选项: 常量.HUD文本刷新,
          提示: "指定此动作的某个输入值将被持续重新赋值。此动作会要求输入新的数值，并用输入的数值进行重新赋值。",
        },
        {
          名称: "无队伍观战者",
          类型: "观战",
          选项: 常量.观战,
          提示: "无队伍观战者是否可以看到此文本。",
        },
      ],
      标签: ["动作"],
      提示: "在指定玩家屏幕上的指定位置创建一条HUD文本。此文本会持续至消除为止。如果想指定此文本，可使用“上一个文本ID”的返还值。如果已创建了太多的文本元素，此动作可能会失败。",
    },
    创建光束效果: {
      参数: [
        {
          名称: "可见",
          类型: "条件",
          默认: "事件玩家",
          提示: "一名或多名将家将可以看到此效果。",
        },
        {
          名称: "选项",
          类型: "光束效果",
          选项: 常量.光束效果,
          提示: "将要创建的效果类型。启用特定地图工坊扩展可添加新的选项。",
        },
        {
          名称: "开始位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "效果开始的位置。如果此值为一名玩家，那么效果将随此玩家移动。否则，此值将代表地图中的一个位置。",
        },
        {
          名称: "结束位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "效果终点所在的位置。如果此值为一名玩家，那么该效果将与玩家一起移动。否则，此值将代表地图中的一个位置。",
        },
        {
          名称: "颜色",
          类型: "条件",
          默认: "颜色(白色)",
          提示: "所创建效果的颜色。如果选择了一支队伍，此效果将显示为红色或蓝色，根据观察者是否与这支队伍敌对决定。不会影响音效，只会影响“有益”或“有害”的光束效果。不支持自定义颜色。",
        },
        {
          名称: "重新赋值",
          类型: "效果刷新",
          选项: 常量.效果刷新,
          提示: "指定此动作的某个输入值将被持续重新赋值。此效果会要求输入新的数值，并用输入的数值进行重新赋值。",
        },
      ],
      标签: ["动作"],
      提示: "创建一个地图中的光束效果实体。此实体会持续至消除为止。如果想引用此实体，可使用“上一个创建的实体”的返还值。如果已创建了太多的实体，此动作可能会失败。",
    },
    创建图标: {
      参数: [
        {
          名称: "可见",
          类型: "条件",
          默认: "事件玩家",
          提示: "一名或多名玩家将可以看到此图标。",
        },
        {
          名称: "位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "图标所在的位置。如果此值为一名玩家，那么图标将显示在这名玩家的头顶上方。否则，此值将代表地图中的一个位置。",
        },
        {
          名称: "图标",
          类型: "图标",
          选项: 常量.图标,
          提示: "将要创建的图标。",
        },
        {
          名称: "重新赋值",
          类型: "图标刷新",
          选项: 常量.图标刷新,
          提示: "指定此动作的哪个输入值将持续被重新赋值。此图标会一直要求并采用重新赋值所传入的值。",
        },
        {
          名称: "图标颜色",
          类型: "条件",
          默认: "颜色(白色)",
          提示: "所创建图标的颜色。如果选择了一支队伍，此效果将显示为红色或蓝色，根据观察者是否与这支队伍敌对决定。",
        },
        {
          名称: "离开屏幕后显示",
          类型: "条件",
          默认: "假",
          提示: "当此图标在你背后时是否显示？",
        },
      ],
      标签: ["动作"],
      提示: "创建一个地图中的图标实体。此实体会持续至消除为止。如果想指定此实体，可使用“上一个创建的实体”的返还值。如果已创建了太多的实体，此动作可能会失败。",
    },
    创建地图文本: {
      参数: [
        {
          名称: "可见",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家可以看到本条地图文本。",
        },
        {
          名称: "标题",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "将要显示的文本。",
        },
        {
          名称: "位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "文本所在位置。如果此值为一名玩家，那么文本将显示在这名玩家的头顶上方。否则，此值将代表地图中的一个位置。",
        },
        {
          名称: "大小",
          类型: "条件",
          默认: "1",
          提示: "文本的大小。",
        },
        {
          名称: "截取",
          类型: "截取",
          选项: 常量.截取,
          提示: "文本可以穿透墙壁或是将被遮挡。",
        },
        {
          名称: "重新赋值",
          类型: "地图文本刷新",
          选项: 常量.地图文本刷新,
          提示: "指定此动作的某个输入值将被持续重新赋值。这段文本会要求输入新的数值，并用输入的数值进行重新赋值。",
        },
        {
          名称: "文本颜色",
          类型: "条件",
          默认: "颜色(白色)",
          提示: "指定地图文本使用的颜色",
        },
        {
          名称: "无队伍观战者",
          类型: "观战",
          选项: 常量.观战,
          提示: "无队伍观战者是否可以看到此文本。",
        },
      ],
      标签: ["动作"],
      提示: "在地图的指定位置创建一条地图文本，可以由指定玩家看到。此文本会持续至消除为止。如果想指定此文本，可使用“上一个文本ID”的返还值。如果已创建了太多的文本元素，此动作可能会失败。",
    },
    创建效果: {
      参数: [
        {
          名称: "可见",
          类型: "条件",
          默认: "事件玩家",
          提示: "一名或多名将家将可以看到此效果。",
        },
        {
          名称: "选项",
          类型: "效果",
          选项: 常量.效果,
          提示: "将要创建的效果类型。启用特定地图工坊扩展可添加新的选项。",
        },
        {
          名称: "颜色",
          类型: "条件",
          默认: "颜色(白色)",
          提示: "所创建效果的颜色。如果选择了一支队伍，此效果将显示为红色或蓝色，根据观察者是否与这支队伍敌对决定。对声音效果无效。不支持自定义颜色。",
        },
        {
          名称: "位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "效果终点所在的位置。如果此值为一名玩家，那么该效果将与玩家一起移动。否则，此值将代表地图中的一个位置。",
        },
        {
          名称: "半径",
          类型: "条件",
          默认: "0",
          提示: "效果的半径，单位为米。对声音效果则影响其音量。",
        },
        {
          名称: "重新赋值",
          类型: "效果刷新",
          选项: 常量.效果刷新,
          提示: "指定此动作的某个输入值将被持续重新赋值。此动作会要求输入新的数值，并用输入的数值进行重新赋值。",
        },
      ],
      标签: ["动作"],
      提示: "创建一个地图中的效果实体。此实体会持续至消除为止。如果想指定此实体，可使用“上一个创建的实体”的返还值。如果已创建了太多的实体，此动作可能会失败。",
    },
    创建进度条HUD文本: {
      参数: [
        {
          名称: "可见",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家将会看到这条进度条HUD文本。",
        },
        {
          名称: "值",
          类型: "条件",
          默认: "0",
          提示: "将要显示的进度条值，为从0到100的百分比。",
        },
        {
          名称: "文本",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "将要显示的文本（可以为空）。",
        },
        {
          名称: "坐标",
          类型: "HUD位置",
          选项: 常量.HUD位置,
          提示: "文本在屏幕上出现的位置。",
        },
        {
          名称: "排序",
          类型: "条件",
          默认: "0",
          提示: "此文本与其他在同样位置的文本的排序关系。排序较高的文本会在排序较低的文本之后显示。",
        },
        {
          名称: "进度条颜色",
          类型: "条件",
          默认: "颜色(白色)",
          提示: "所创建进度条文本的颜色。如果选择了一支队伍，此效果将显示为红色或蓝色，根据观察者是否与这支队伍敌对决定。",
        },
        {
          名称: "文本颜色",
          类型: "条件",
          默认: "颜色(白色)",
          提示: "所创建文本的颜色。如果选择了一支队伍，此效果将显示为红色或蓝色，根据观察者是否与这支队伍敌对决定。",
        },
        {
          名称: "重新赋值",
          类型: "HUD进度条刷新",
          选项: 常量.HUD进度条刷新,
          提示: "指定此动作的某个输入值将被持续重新赋值。这段文本会要求输入新的数值，并用输入的数值进行重新赋值。",
        },
        {
          名称: "无队伍观战者",
          类型: "观战",
          选项: 常量.观战,
          提示: "无队伍观战者是否可以看到此文本。",
        },
      ],
      标签: ["动作"],
      提示: "在指定玩家屏幕上的指定位置创建一条进度条HUD文本。此文本会持续至消除为止。如果想指定此文本，可使用“上一个文本ID”的返还值。如果已创建了太多的文本元素，此动作可能会失败。",
    },
    创建进度条地图文本: {
      参数: [
        {
          名称: "可见",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家将会看到这条进度条HUD文本。",
        },
        {
          名称: "值",
          类型: "条件",
          默认: "0",
          提示: "将要显示的进度条值，为从0到100的百分比。",
        },
        {
          名称: "文本",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "将要显示的文本（可以为空）。",
        },
        {
          名称: "位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "文本所在位置。如果此值为一名玩家，那么文本将显示在这名玩家的头顶上方。否则，此值将代表地图中的一个位置。",
        },
        {
          名称: "大小",
          类型: "条件",
          默认: "1",
          提示: "文本的大小。",
        },
        {
          名称: "截取",
          类型: "截取",
          选项: 常量.截取,
          提示: "文本可以穿透墙壁或是将被遮挡。",
        },
        {
          名称: "进度条颜色",
          类型: "条件",
          默认: "颜色(白色)",
          提示: "所创建进度条文本的颜色。如果选择了一支队伍，此效果将显示为红色或蓝色，根据观察者是否与这支队伍敌对决定。",
        },
        {
          名称: "文本颜色",
          类型: "条件",
          默认: "颜色(白色)",
          提示: "所创建文本的颜色。如果选择了一支队伍，此效果将显示为红色或蓝色，根据观察者是否与这支队伍敌对决定。",
        },
        {
          名称: "重新赋值",
          类型: "地图进度条刷新",
          选项: 常量.地图进度条刷新,
          提示: "指定此动作的某个输入值将被持续重新赋值。这段文本会要求输入新的数值，并用输入的数值进行重新赋值。",
        },
        {
          名称: "无队伍观战者",
          类型: "观战",
          选项: 常量.观战,
          提示: "无队伍观战者是否可以看到此文本。",
        },
      ],
      标签: ["动作"],
      提示: "在地图的指定位置创建一条进度条HUD文本，可以由指定玩家看到。此文本会持续至消除为止。如果想指定此文本，可使用“上一个文本ID”的返还值。如果已创建了太多的文本元素，此动作可能会失败。",
    },
    前往集结英雄: {
      标签: ["动作"],
      提示: "回到比赛模式的集结英雄阶段。只有在游戏正在进行中时生效。",
    },
    取消与玩家的移动碰撞: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的移动碰撞将受到影响。",
        },
      ],
      标签: ["动作"],
      提示: "使玩家停止与其他玩家发生碰撞。",
    },
    取消与环境的移动碰撞: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的移动碰撞将受到影响。",
        },
        {
          名称: "包括地面",
          类型: "条件",
          默认: "假",
          提示: "如果为真，则同时取消与地面的碰撞。",
        },
      ],
      标签: ["动作"],
      提示: "使玩家停止与其他环境（墙壁，天花板，以及特定物体）发生碰撞。",
    },
    取消主要动作: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的启动技能将取消。",
        },
      ],
      标签: ["动作"],
      提示: "取消一名或多名玩家启动技能的设置。",
    },
    可用按钮: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的按钮将重新启用。",
        },
        {
          名称: "按钮",
          类型: "条件",
          默认: "按钮(终极技能)",
          提示: "将要重新启用的逻辑按键。",
        },
      ],
      标签: ["动作"],
      提示: "取消“禁用按钮”动作的效果。",
    },
    启用文字聊天: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的文字聊天将被启用。",
        },
      ],
      标签: ["动作"],
      提示: "取消“禁用文字聊天”动作对一个或多个玩家的效果。",
    },
    启用查看器录制: {
      标签: ["动作"],
      提示: "使地图工坊查看器可以继续录制新的条目（假如之前被禁用的话）。在特定时间开启录制可以更容易地对你的脚本逻辑中出问题的地方进行错误排查。",
    },
    启用死亡回放时目标的HUD: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家在死亡后观战时将看到观战目标的HUD信息。",
        },
      ],
      标签: ["动作"],
      提示: "使一名或多名玩家在死亡后观战时看到目标的HUD信息，而不是他们自己的。",
    },
    启用语音聊天: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的语音聊天将被启用。",
        },
      ],
      标签: ["动作"],
      提示: "取消“禁用语音聊天”动作对一个或多个玩家的效果。",
    },
    在索引处修改全局变量: {
      参数: [
        {
          名称: "变量",
          类型: "全局变量",
          提示: "要修改的全局变量。",
        },
        {
          名称: "索引",
          类型: "条件",
          默认: "0",
          提示: "修改数组的索引。如果索引位置已经超过了数组的末尾，则将数组延伸至索引位置，且新的元素值均为0。",
        },
        {
          名称: "操作",
          类型: "操作",
          选项: 常量.操作,
          提示: "变量的值改变的方式。选项包括标准运算操作，以及数组操作（如添加或移除值）。",
        },
        {
          名称: "值",
          类型: "条件",
          默认: "0",
          提示: "用于修改的值。若要进行运算操作，则此值为两个运算量中的第二个，第一个运算量为变量当前的值。若要进行数组操作，则此值是用于添加或移除的值。",
        },
      ],
      标签: ["动作"],
      提示: "修改索引处一个全局变量的值，全局变量即属于游戏本身的变量。",
    },
    在索引处修改玩家变量: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "此玩家的变量将被修改。如果有多个玩家，则每个玩家的变量都将被设置。",
        },
        {
          名称: "变量",
          类型: "玩家变量",
          提示: "指定修改此玩家的哪些变量。",
        },
        {
          名称: "索引",
          类型: "条件",
          默认: "0",
          提示: "修改数组的索引。如果索引位置已经超过了数组的末尾，则将数组延伸至索引位置，且新的元素值均为0。",
        },
        {
          名称: "操作",
          类型: "操作",
          选项: 常量.操作,
          提示: "变量的值改变的方式。选项包括标准运算操作，以及数组操作（如添加或移除值）。",
        },
        {
          名称: "值",
          类型: "条件",
          默认: "0",
          提示: "用于修改的值。若要进行运算操作，则此值为两个运算量中的第二个，第一个运算量为变量当前的值。若要进行数组操作，则此值是用于添加或移除的值。",
        },
      ],
      标签: ["动作"],
      提示: "修改索引处一个玩家变量的值，玩家变量即属于一个特定玩家的变量。",
    },
    在索引处设置全局变量: {
      参数: [
        {
          名称: "变量",
          类型: "全局变量",
          提示: "指定哪个全局变量的值是要修改的数组。如果变量的值不是一个数组，则使其值变为一个空的数组。",
        },
        {
          名称: "索引",
          类型: "条件",
          默认: "0",
          提示: "修改数组的索引。如果索引位置已经超过了数组的末尾，则将数组延伸至索引位置，且新的元素值均为0。",
        },
        {
          名称: "值",
          类型: "条件",
          默认: "0",
          提示: "将此值存储到数组中。",
        },
      ],
      标签: ["动作"],
      提示: "为一个全局变量寻找或创建一个数组，然后将一个值储存至指定的索引中。全局变量即属于游戏本身的变量。",
    },
    在索引处设置玩家变量: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "此玩家的变量将被修改。如果有多个玩家，则每个玩家的变量都将被设置。",
        },
        {
          名称: "变量",
          类型: "玩家变量",
          提示: "指定哪个玩家变量的值是要修改的数组。如果变量的值不是一个数组，则使其值变为一个空的数组。",
        },
        {
          名称: "索引",
          类型: "条件",
          默认: "0",
          提示: "修改数组的索引。如果索引位置已经超过了数组的末尾，则将数组延伸至索引位置，且新的元素值均为0。",
        },
        {
          名称: "值",
          类型: "条件",
          默认: "0",
          提示: "将此值存储到数组中。",
        },
      ],
      标签: ["动作"],
      提示: "为一个玩家变量寻找或创建一个数组，然后将一个值储存至指定的索引处。玩家变量即属于一个特定玩家的变量。",
    },
    复活: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家将被复活。",
        },
      ],
      标签: ["动作"],
      提示: "立即使一名到多名玩家在其死亡的位置复活，无需等待时间。",
    },
    复生: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家将复生。",
        },
      ],
      标签: ["动作"],
      提示: "使一名或多名玩家在适当的复生位置复生并恢复至最大生命值，对仍然存活的玩家依然有效。",
    },
    大字体信息: {
      参数: [
        {
          名称: "可见",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家将看到此信息。",
        },
        {
          名称: "标题",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "将要显示的信息。",
        },
      ],
      标签: ["动作"],
      提示: "在准星上方显示大字体信息，对指定玩家可见。",
    },
    "如条件为“假”则中止": {
      标签: ["动作"],
      提示: "如果条件列表中至少有一项条件为“假”，则停止执行动作列表。如果所有条件均为“真”，则继续执行下一条动作。",
    },
    "如条件为“假”则循环": {
      标签: ["动作"],
      提示: "如果条件列表中至少有一项条件为“假”，则从头开始执行动作列表。如果所有条件均为“真”，则执行下一项动作。",
    },
    "如条件为“真”则中止": {
      标签: ["动作"],
      提示: "如果条件列表中所有条件均为“真”，则停止执行动作列表。如果有任何一条为“假”，则继续执行下一条动作。",
    },
    "如条件为“真”则循环": {
      标签: ["动作"],
      提示: "如果条件列表中的每一项条件均为“真”，则从头开始执行动作列表。如果任意一项为“假”，则执行下一项动作。",
    },
    宣告回合胜利: {
      参数: [
        {
          名称: "本回合获胜队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "本回合获胜队伍",
        },
      ],
      标签: ["动作"],
      提示: "宣布一支队伍为当前回合的胜利方。只在占领要点模式和决斗先锋模式中可用。",
    },
    宣告玩家胜利: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "获胜的玩家。",
        },
      ],
      标签: ["动作"],
      提示: "立即结束比赛并指定一名玩家为胜利者。此动作只在自由混战模式中生效。",
    },
    宣告队伍胜利: {
      参数: [
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "获胜队伍。",
        },
      ],
      标签: ["动作"],
      提示: "立即结束比赛，并指定获胜的队伍。此动作在自由混战模式中无效。",
    },
    宣布回合为平局: {
      标签: ["动作"],
      提示: "宣布当前回合为平局。只在决斗先锋模式中可用。",
    },
    宣布比赛为平局: {
      标签: ["动作"],
      提示: "立即结束比赛，且结果为平局。此动作在自由混战模式中无效。",
    },
    对所有玩家启用死亡回放: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家将可以观看所有玩家。",
        },
      ],
      标签: ["动作"],
      提示: "使一名或多名玩家死亡后可以观看所有玩家的比赛，而不止是自己的盟友。",
    },
    对所有玩家禁用死亡回放: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家死亡后观战的行为将恢复正常。",
        },
      ],
      标签: ["动作"],
      提示: "取消“对所有玩家启用死亡回放”动作的效果。",
    },
    小字体信息: {
      参数: [
        {
          名称: "可见",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家将看到此信息。",
        },
        {
          名称: "标题",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "将要显示的信息。",
        },
      ],
      标签: ["动作"],
      提示: "在准星下方显示小字体信息，对指定玩家可见。",
    },
    开启与玩家的移动碰撞: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的移动碰撞将受到影响。",
        },
      ],
      标签: ["动作"],
      提示: "取消“取消与玩家的移动碰撞”动作的效果。",
    },
    开启与环境的移动碰撞: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的移动碰撞将受到影响。",
        },
      ],
      标签: ["动作"],
      提示: "取消“取消与环境的移动碰撞”动作的效果。",
    },
    开启游戏预设复生模式: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的复生将受到影响。",
        },
      ],
      标签: ["动作"],
      提示: "取消“关闭游戏预设复生模式”动作的效果。",
    },
    开启游戏预设完成条件: {
      标签: ["动作"],
      提示: "取消“关闭游戏预设完成条件”动作的效果。",
    },
    开启游戏预设计分模式: {
      标签: ["动作"],
      提示: "取消“关闭游戏预设计分模式”动作的效果。",
    },
    开启游戏预设通告模式: {
      标签: ["动作"],
      提示: "取消“关闭游戏预设通告模式”动作的效果。",
    },
    开启游戏预设音乐模式: {
      标签: ["动作"],
      提示: "取消“关闭游戏预设音乐模式”动作的效果。",
    },
    开始为机器人强制设置名称: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "设置下列玩家的名称。",
        },
        {
          名称: "名称",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "要强制设置的名称。",
        },
      ],
      标签: ["动作"],
      提示: "开始强制设置指定玩家的名称。",
    },
    开始伤害调整: {
      参数: [
        {
          名称: "受伤害者",
          类型: "条件",
          默认: "事件玩家",
          提示: "修正下列玩家受到的伤害（被“伤害者”攻击时）。",
        },
        {
          名称: "伤害者",
          类型: "条件",
          默认: "事件玩家",
          提示: "修正下列玩家造成的伤害（攻击“受伤害者”时）。",
        },
        {
          名称: "伤害百分比",
          类型: "条件",
          默认: "0",
          提示: "伤害者对受伤害者造成伤害将调整至百分比。",
        },
        {
          名称: "重新赋值",
          类型: "伤害调整刷新",
          选项: 常量.伤害调整刷新,
          提示: "指定此动作的某个输入值将被持续重新赋值。此动作会要求输入新的数值，并用输入的数值进行重新赋值。",
        },
      ],
      标签: ["动作"],
      提示: "开始调整一名或多名受伤害者从一个或多个伤害者受到的伤害。如果想指定此伤害调整，可以使用“上一个伤害调整ID“的值。如果已经开始了太多的伤害调整，此动作可能会失败。",
    },
    开始修改英雄语音: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的英雄语音声音将被修改。",
        },
        {
          名称: "音调调整",
          类型: "条件",
          默认: "0",
          提示: "语音的音调提高（最高至1.5）或降低（最低至0.5）的值。",
        },
        {
          名称: "重新赋值",
          类型: "条件",
          默认: "假",
          提示: "如果此值为真，那么每一帧都会重新计算音调调整的值。如果此值为假，则只会在此行动一开始时赋予一个值。",
        },
      ],
      标签: ["动作"],
      提示: "修改玩家的英雄语音声音。",
    },
    开始加速: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家将开始加速。",
        },
        {
          名称: "方向",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "施加加速度的单位方向。此值将进行内部归一化。",
        },
        {
          名称: "频率",
          类型: "条件",
          默认: "0",
          提示: "加速度，单位为米/秒²。需要较大的加速度才能够克服引力和/或表面摩擦力。",
        },
        {
          名称: "最大速度",
          类型: "条件",
          默认: "0",
          提示: "玩家达到此速度后会停止。由于引力和/或表面摩擦力的存在，可能将无法达到此速度。",
        },
        {
          名称: "相对",
          类型: "相对",
          选项: 常量.相对,
          提示: "确定此方向是相对于地图坐标还是玩家的本地坐标。",
        },
        {
          名称: "重新赋值",
          类型: "加速刷新",
          选项: 常量.加速刷新,
          提示: "指定此动作的某个输入值将被持续重新赋值。此动作会要求输入新的数值，并用输入的数值进行重新赋值。",
        },
      ],
      标签: ["动作"],
      提示: "开始令一名或多名玩家向指定方向加速。",
    },
    开始助攻: {
      参数: [
        {
          名称: "助攻者",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家将被归为助攻者。",
        },
        {
          名称: "目标",
          类型: "条件",
          默认: "所有玩家(所有队伍)",
          提示: "下列玩家被消灭时，会将助攻归于助攻者名下。如果目标和助攻者为盟友，则为协助防守。否则为协助进攻。",
        },
        {
          名称: "重新赋值",
          类型: "助攻刷新",
          选项: 常量.助攻刷新,
          提示: "指定此动作的某个输入值将被持续重新赋值。此动作会要求输入新的数值，并用输入的数值进行重新赋值。",
        },
      ],
      标签: ["动作"],
      提示: "当一名或多名目标被消灭时，开始将此助攻归于一名或多名助攻者名下。如果想指定此伤害调整，可以使用“上一个助攻ID“的值。如果已经开始了太多的助攻，此动作可能会失败。",
    },
    开始定向阈值: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "设置或添加下列玩家的阈值。",
        },
        {
          名称: "方向",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "设置或添加阈值的单位方向。此值将进行内部归一化。",
        },
        {
          名称: "幅度",
          类型: "条件",
          默认: "0",
          提示: "阈值的值（或改变值）。值为1时表示阈值为满。",
        },
        {
          名称: "相对",
          类型: "相对",
          选项: 常量.相对,
          提示: "确定此方向是相对于地图坐标还是玩家的本地坐标。",
        },
        {
          名称: "行为",
          类型: "阈值行为",
          选项: 常量.阈值行为,
          提示: "指定需要替换或添加的已存在的阈值。",
        },
        {
          名称: "重新赋值",
          类型: "阈值刷新",
          选项: 常量.阈值刷新,
          提示: "指定此动作的某个输入值将被持续重新赋值。此动作会要求输入新的数值，并用输入的数值进行重新赋值。",
        },
      ],
      标签: ["动作"],
      提示: "为一名或多名玩家设置或添加阈值（方向性输入控制），对其向指定方向的移动做出限制。取消之前所有的定向阈值。",
    },
    开始强制玩家选择英雄: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家将被强制使用指定英雄。",
        },
        {
          名称: "英雄",
          类型: "条件",
          默认: "英雄(回声)",
          提示: "玩家将被强制使用的英雄。",
        },
      ],
      标签: ["动作"],
      提示: "开始强制一名或多名玩家使用指定的英雄，如有必要，使这些玩家立即在当前位置复生。这名或这些玩家只能使用指定的英雄，直到执行”停止强制玩家选择英雄“动作为止。",
    },
    开始强制设置玩家位置: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "强制设置此玩家的位置。（重新赋值选项不会影响此值。）",
        },
        {
          名称: "位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "将指定玩家设置至此位置。如果“重新赋值”选项启动，会使用这个值强制使玩家移动。",
        },
        {
          名称: "重新赋值",
          类型: "条件",
          默认: "假",
          提示: "如果此值为真，那么每一帧都会重新计算“位置”变量的值。如果此值为假，则“位置”只会在此行动一开始时赋予一个值。",
        },
      ],
      标签: ["动作"],
      提示: "开始强制一名玩家停留在指定位置。如果启动了“重新赋值”，那么每一帧都会重新为“位置”赋值，让玩家进行强制移动。",
    },
    开始强制设置玩家轮廓: {
      参数: [
        {
          名称: "被观察的玩家",
          类型: "条件",
          默认: "所有玩家(所有队伍)",
          提示: "被观察的玩家的轮廓将被修改。",
        },
        {
          名称: "观察玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "从观察玩家的视角看，被观察的玩家的轮廓将被修改。",
        },
        {
          名称: "可见",
          类型: "条件",
          默认: "事件玩家",
          提示: "指定玩家的轮廓是否可见。",
        },
        {
          名称: "颜色",
          类型: "条件",
          默认: "颜色(白色)",
          提示: "指定玩家的轮廓的颜色（如果可见）。如果选择了特定的队伍，那么此颜色将为红色或蓝色，取决于此队伍是观察者的友方还是敌方。",
        },
        {
          名称: "可见类型",
          类型: "轮廓",
          选项: 常量.轮廓,
          提示: "指定玩家的轮廓可见时，其轮廓的显示类型。",
        },
      ],
      标签: ["动作"],
      提示: "从观察玩家的视角看，设置被观察的玩家的轮廓的可见性和颜色。",
    },
    开始强制重生室: {
      参数: [
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "这支队伍将被强制使用指定重生室。",
        },
        {
          名称: "重生室",
          类型: "条件",
          默认: "0",
          提示: "强制使用的重生室编号。0为第一间重生室，1为第二间，2为第三间。如果指定的重生室不存在，则玩家会使用正常状态下的重生室。",
        },
      ],
      标签: ["动作"],
      提示: "强制一支队伍在指定的重生室重生，不管在游戏模式中应当使用哪个重生室。此动作只会在攻防作战、攻击",
    },
    开始持续伤害: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "在下列玩家身上施加持续伤害效果。",
        },
        {
          名称: "伤害者",
          类型: "条件",
          默认: "事件玩家",
          提示: "伤害视为此名玩家造成的。如果“伤害者”设置为“空”则此伤害不会归到任何玩家名下。",
        },
        {
          名称: "持续时间",
          类型: "条件",
          默认: "0",
          提示: "持续伤害的持续时间，以秒为单位。如果要让状态持续到被程序终止为止，可以输出较长的持续时间，如9999。",
        },
        {
          名称: "每秒伤害",
          类型: "条件",
          默认: "0",
          提示: "持续伤害每秒造成的伤害值。",
        },
      ],
      标签: ["动作"],
      提示: "开始一个持续伤害副本。此持续伤害会持续一段指定长度的时间，或直到被程序中止。如果想指定此持续伤害，可以使用”上一个持续伤害ID“的返还值。",
    },
    开始持续治疗: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家会受到持续治疗。",
        },
        {
          名称: "治疗者",
          类型: "条件",
          默认: "事件玩家",
          提示: "治疗视为此名玩家造成的。如果“治疗者”设置为“空”则此治疗不会归到任何玩家名下。",
        },
        {
          名称: "持续时间",
          类型: "条件",
          默认: "0",
          提示: "持续治疗的持续时间，以秒为单位。如果要让状态持续到被程序终止为止，可以输出较长的持续时间，如9999。",
        },
        {
          名称: "每秒治疗",
          类型: "条件",
          默认: "0",
          提示: "此持续治疗每秒造成的治疗。",
        },
      ],
      标签: ["动作"],
      提示: "开始一个持续治疗副本。此持续治疗会持续一段指定长度的时间，或直到被程序中止。如果想指定此持续治疗，可以使用”上一个持续治疗ID“的返还值。",
    },
    开始按下按钮: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家将持续按下虚拟按钮。",
        },
        {
          名称: "按钮",
          类型: "条件",
          默认: "按钮(终极技能)",
          提示: "设置按下的虚拟按钮。",
        },
      ],
      标签: ["动作"],
      提示: "强制一名或多名玩家按下一个虚拟按钮，直到被“停止按下按钮”动作取消。",
    },
    开始朝向: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家将开始转向。",
        },
        {
          名称: "方向",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "玩家最终将面朝的单位方向。此值将进行内部归一化。",
        },
        {
          名称: "角速率",
          类型: "条件",
          默认: "0",
          提示: "角速率，单位为度/秒。",
        },
        {
          名称: "相对",
          类型: "相对",
          选项: 常量.相对,
          提示: "确定此方向是相对于地图坐标还是玩家的本地坐标。",
        },
        {
          名称: "重新赋值",
          类型: "朝向刷新",
          选项: 常量.朝向刷新,
          提示: "指定此动作的某个输入值将被持续重新赋值。此动作会要求输入新的数值，并用输入的数值进行重新赋值。",
        },
      ],
      标签: ["动作"],
      提示: "开始强制一名或多名玩家转向面对指定的方向。",
    },
    开始治疗调整: {
      参数: [
        {
          名称: "受治疗者",
          类型: "条件",
          默认: "事件玩家",
          提示: "修正下列玩家受到的治疗（被“治疗者”治疗时）。",
        },
        {
          名称: "治疗者",
          类型: "条件",
          默认: "事件玩家",
          提示: "修正下列玩家造成的治疗（治疗“受治疗者”时）。",
        },
        {
          名称: "治疗百分比",
          类型: "条件",
          默认: "0",
          提示: "治疗者对受治疗者造成的治疗将调整至百分比。",
        },
        {
          名称: "重新赋值",
          类型: "治疗调整刷新",
          选项: 常量.治疗调整刷新,
          提示: "指定此动作的某个输入值将被持续重新赋值。此动作会要求输入新的数值，并用输入的数值进行重新赋值。",
        },
      ],
      标签: ["动作"],
      提示: "开始调整一名或多名受治疗者从一个或多个治疗者受到的治疗。如果想指定此治疗调整，可以使用“上一个治疗调整ID“的值。如果已经开始了太多的治疗调整，此动作可能会失败。",
    },
    开始游戏模式: {
      标签: ["动作"],
      提示: "开始游戏模式。若游戏已在进行中，此动作不会生效。",
    },
    开始规则: {
      参数: [
        {
          名称: "子程序",
          类型: "子程序",
          提示: "指定要开始的子程序。如果一个事件类型为子程序的规则指定了同一段子程序，那么它将会被执行。否则会忽略此行动。",
        },
        {
          名称: "是否正在执行",
          类型: "子程序行为",
          选项: 常量.子程序行为,
          提示: "决定当子程序中指定的规则已经在同一玩家或环境实体上执行时会发生什么。",
        },
      ],
      标签: ["动作"],
      提示: "开始同时执行一个子程序规则（事件类型为”子程序“的规则）。原来规则的执行不会被打断。子程序可以使用同样的情景变量（如事件玩家）的原始值。",
    },
    开始调整玩家大小: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "设置下列玩家的大小。",
        },
        {
          名称: "大小",
          类型: "条件",
          默认: "1",
          提示: "此系数将作用于玩家的大小（0.5即为一半大小，2.0为大小加倍，诸如此类）。",
        },
        {
          名称: "重新赋值",
          类型: "条件",
          默认: "假",
          提示: "如果此值为真，那么每一帧都会重新计算玩家的大小。如果此值为假，则大小只会在此行动一开始时赋予一个值。",
        },
      ],
      标签: ["动作"],
      提示: "开始调整一名或多名玩家的大小（会影响模型、移动碰撞、命中判定及部分技能）。请注意将大体形的玩家放置到复杂环境中会严重影响服务器负载，所以在做出此调整的同时应用“禁用与环境的移动碰撞”行动。",
    },
    开始调整障碍大小: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "停止强制设置下列玩家的屏障大小。",
        },
        {
          名称: "大小",
          类型: "条件",
          默认: "1",
          提示: "此系数将作用于屏障的大小（0.5即为一半大小，2.0为大小加倍，诸如此类），此调整以“开始调整玩家大小”动作所设置的大小为基准。",
        },
        {
          名称: "重新赋值",
          类型: "条件",
          默认: "假",
          提示: "如果此值为真，那么每一帧都会重新计算玩家的大小。如果此值为假，则大小只会在此行动一开始时赋予一个值。",
        },
      ],
      标签: ["动作"],
      提示: "开始调整一名或多名玩家的屏障大小。",
    },
    开始转换阈值: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "转换下列玩家的阈值。",
        },
        {
          名称: "X轴缩放",
          类型: "条件",
          默认: "0",
          提示: "下列玩家阈值的X轴（左右方向）将会乘以此数值，然后转换到新的相对方向。这个值会不断被重新赋值（每一帧都会更新）。",
        },
        {
          名称: "Y轴缩放",
          类型: "条件",
          默认: "0",
          提示: "下列玩家阈值的Y轴（前后方向）将会乘以此数值，然后转换到新的相对方向。这个值会不断被重新赋值（每一帧都会更新）。",
        },
        {
          名称: "相对方向",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "应用轴向缩放时，玩家的阈值将会被转换为相对此单位方向的矢量。例如，如果阈值转换至相对摄像机视角，则以摄像机的朝向为基准计算方向。这个值会不断被重新赋值（每一帧都会更新）并进行内部归一化。",
        },
      ],
      标签: ["动作"],
      提示: "开始转换（放大并旋转）一名或多名玩家的阈值（方向输入控制）。取消所有已存在的“开始转换阈值”动作。",
    },
    开始镜头: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "将下列玩家的镜头放置于此。",
        },
        {
          名称: "眼睛位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "镜头的位置。持续重新赋值。",
        },
        {
          名称: "望向位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "镜头望向的位置。持续重新赋值。",
        },
        {
          名称: "转动速度",
          类型: "条件",
          默认: "0",
          提示: "位置移动时镜头转动速度的快慢。0意味着不转动镜头方向，只改变其位置。",
        },
      ],
      标签: ["动作"],
      提示: "将你的镜头放置在一个位置，面向一个角度。",
    },
    开始限制阈值: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家将被强制或限制移动。",
        },
        {
          名称: "向前最小",
          类型: "条件",
          默认: "0",
          提示: "设置向前行进的最小速度。设为0时玩家可以停下，设为1时将强迫玩家全速向前移动。",
        },
        {
          名称: "向前最大",
          类型: "条件",
          默认: "0",
          提示: "设置向前行进的最大速度。设为0时玩家将无法前进，设为1时玩家可以全速向前移动。",
        },
        {
          名称: "向后最小",
          类型: "条件",
          默认: "0",
          提示: "设置向后行进的最小速度。设为0时玩家可以停下，设为1时将强迫玩家全速向后移动。",
        },
        {
          名称: "向后最大",
          类型: "条件",
          默认: "0",
          提示: "设置向后行进的最大速度。设为0时玩家将无法后退，设为1时玩家可以全速向后移动。",
        },
        {
          名称: "侧向最小",
          类型: "条件",
          默认: "0",
          提示: "设置向后行进的最小速度。设为0时玩家可以停下，设为1时将强迫玩家全速向侧向移动。",
        },
        {
          名称: "侧向最大",
          类型: "条件",
          默认: "0",
          提示: "设置侧向行进的最大速度。设为0时玩家将无法侧移，设为1时玩家可以全速向侧向移动。",
        },
      ],
      标签: ["动作"],
      提示: "定义玩家移动输入的最大值和最小值，可能会强迫或阻止玩家移动。",
    },
    循环: {
      标签: ["动作"],
      提示: "从头开始执行动作列表。",
    },
    持续追踪全局变量: {
      参数: [
        {
          名称: "变量",
          类型: "全局变量",
          提示: "指定要改变的全局变量。",
        },
        {
          名称: "最终值",
          类型: "条件",
          默认: "0",
          提示: "该全局变量最后达到的值。这个值的类型可以是数字或矢量，然而必须与追踪开始时全局变量所具有的值相同。",
        },
        {
          名称: "持续时间",
          类型: "条件",
          默认: "0",
          提示: "变量到达最终值所用的时间，以秒为单位。",
        },
        {
          名称: "重新赋值",
          类型: "持续追踪刷新",
          选项: 常量.持续追踪刷新,
          提示: "指定此动作的某个输入值将被持续重新赋值。此动作会要求输入新的数值，并用输入的数值进行重新赋值。",
        },
      ],
      标签: ["动作"],
      提示: "逐渐改变一个全局变量的值，全局变量即属于游戏本身的变量。",
    },
    持续追踪玩家变量: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "此玩家的变量将被逐渐改变。如果有多个玩家，则每个玩家的变量都将各自被改变。",
        },
        {
          名称: "变量",
          类型: "玩家变量",
          提示: "指定将要改变的玩家变量。",
        },
        {
          名称: "最终值",
          类型: "条件",
          默认: "0",
          提示: "该玩家变量最后达到的值。这个值的类型可以是数字或矢量，然而必须与追踪开始时玩家变量所具有的值相同。",
        },
        {
          名称: "持续时间",
          类型: "条件",
          默认: "0",
          提示: "变量到达最终值所用的时间，以秒为单位。",
        },
        {
          名称: "重新赋值",
          类型: "持续追踪刷新",
          选项: 常量.持续追踪刷新,
          提示: "指定此动作的某个输入值将被持续重新赋值。此动作会要求输入新的数值，并用输入的数值进行重新赋值。",
        },
      ],
      标签: ["动作"],
      提示: "逐步改变一个玩家变量的值，玩家变量即属于一个特定玩家的变量。",
    },
    按下按键: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家将强制按下按键。",
        },
        {
          名称: "按钮",
          类型: "条件",
          默认: "按钮(终极技能)",
          提示: "要按下的按键。",
        },
      ],
      标签: ["动作"],
      提示: "强制一名或多名玩家按下虚拟按键，持续一帧。",
    },
    播放效果: {
      参数: [
        {
          名称: "可见",
          类型: "条件",
          默认: "事件玩家",
          提示: "一名或多名将家将可以看到此效果。",
        },
        {
          名称: "选项",
          类型: "播放效果",
          选项: 常量.播放效果,
          提示: "将要创建的效果类型。启用特定地图工坊扩展可添加新的选项。",
        },
        {
          名称: "颜色",
          类型: "条件",
          默认: "颜色(白色)",
          提示: "所创建效果的颜色。如果选择了一支队伍，此效果将显示为红色或蓝色，根据观察者是否与这支队伍敌对决定。不支持自定义颜色。",
        },
        {
          名称: "位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "效果所在位置。如果此值为一名玩家，那么效果将在此玩家所在位置播放。否则，此值将代表地图中的一个位置。",
        },
        {
          名称: "半径",
          类型: "条件",
          默认: "0",
          提示: "效果的半径，单位为米。对声音效果则影响其音量。",
        },
      ],
      标签: ["动作"],
      提示: "在地图的指定位置播放一个效果。此效果的持续时间很短，所以不需要更新或消除。",
    },
    施加推力: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的速度将被改变。",
        },
        {
          名称: "方向",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "施加推力的单位方向。此值将进行内部归一化。",
        },
        {
          名称: "速度",
          类型: "条件",
          默认: "0",
          提示: "玩家速度改变的数值。",
        },
        {
          名称: "相对",
          类型: "相对",
          选项: 常量.相对,
          提示: "确定此方向是相对于地图坐标还是玩家的本地坐标。",
        },
        {
          名称: "运动",
          类型: "相反运动",
          选项: 常量.相反运动,
          提示: "确定在施加推力前是否首先消除已有的与此方向相反的速度。",
        },
      ],
      标签: ["动作"],
      提示: "立即使一名或多名玩家的移动速度发生改变。",
    },
    显示信息: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的信息将被显示。",
        },
      ],
      标签: ["动作"],
      提示: "取消“隐藏信息”动作的效果。",
    },
    显示姓名板: {
      参数: [
        {
          名称: "被观察的玩家",
          类型: "条件",
          默认: "所有玩家(所有队伍)",
          提示: "下列被观察的玩家的姓名板将被显示。",
        },
        {
          名称: "观察玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "从此观察玩家的视角看，被观察的玩家的姓名板将被显示。",
        },
      ],
      标签: ["动作"],
      提示: "从观察玩家的视角看，取消被观察的玩家的“隐藏姓名板”效果。",
    },
    显示消灭提示: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的消灭提示将被显示。",
        },
      ],
      标签: ["动作"],
      提示: "取消“隐藏消灭提示”动作的效果。",
    },
    显示游戏模式HUD: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的游戏模式HUD将被显示。",
        },
      ],
      标签: ["动作"],
      提示: "取消“隐藏游戏模式HUD”动作的效果。",
    },
    显示游戏模式地图UI: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的游戏模式地图UI将被显示。",
        },
      ],
      标签: ["动作"],
      提示: "取消“隐藏游戏模式地图UI”动作的效果。",
    },
    显示英雄HUD: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的英雄HUD将被显示。",
        },
      ],
      标签: ["动作"],
      提示: "取消“隐藏英雄HUD”动作的效果。",
    },
    显示计分板: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的计分板将被显示。",
        },
      ],
      标签: ["动作"],
      提示: "取消“隐藏计分板”动作的效果。",
    },
    根据条件中止: {
      参数: [
        {
          名称: "条件",
          类型: "条件",
          默认: "假",
          提示: "是否停止执行。",
        },
      ],
      标签: ["动作"],
      提示: "如果此动作的条件为“真”，则停止执行动作列表。否则，则继续执行下一条动作。",
    },
    根据条件循环: {
      参数: [
        {
          名称: "条件",
          类型: "条件",
          默认: "假",
          提示: "循环是否发生。",
        },
      ],
      标签: ["动作"],
      提示: "如果此动作的条件为“真”，则从头开始动作列表。否则，继续执行下一条动作。",
    },
    根据条件跳过: {
      参数: [
        {
          名称: "条件",
          类型: "条件",
          默认: "假",
          提示: "是否跳过行动。",
        },
        {
          名称: "动作数量",
          类型: "条件",
          默认: "0",
          提示: "跳过的动作条数，不包括此动作。",
        },
      ],
      标签: ["动作"],
      提示: "如果此动作的条件为“真”，则跳过动作列表中一定条数的动作。否则，则继续执行下一条动作。",
    },
    比赛时间暂停: {
      标签: ["动作"],
      提示: "暂停比赛时间。玩家、目标点逻辑、以及游戏模式的进展标准不会受暂停的影响。",
    },
    比赛时间继续: {
      标签: ["动作"],
      提示: "取消比赛时间暂停。",
    },
    治疗: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家将恢复生命值。",
        },
        {
          名称: "治疗者",
          类型: "条件",
          默认: "事件玩家",
          提示: "治疗视为此名玩家造成的。如果“治疗者”设置为“无”则此治疗不会归到任何玩家名下。",
        },
        {
          名称: "治疗量",
          类型: "条件",
          默认: "0",
          提示: "造成的治疗量。此数值可能会受到增益或减益状态的影响。治疗量不会超过每名玩家的最大生命值。",
        },
      ],
      标签: ["动作"],
      提示: "立刻为一名或多名玩家恢复生命值。此治疗效果不会复活已死亡的玩家。",
    },
    消除HUD文本: {
      参数: [
        {
          名称: "文本ID",
          类型: "条件",
          默认: "上一个文本ID",
          提示: "指定要消除的HUD文本。此ID可以是“上一个文本ID”，或一个之前储存“上一个文本ID”的变量。",
        },
      ],
      标签: ["动作"],
      提示: "消除由”创建HUD文本“所创建的HUD文本。",
    },
    消除图标: {
      参数: [
        {
          名称: "实体",
          类型: "条件",
          默认: "最后创建的实体",
          提示: "指定要消除的图标实体。可以是“最后创建的实体”，或一个之前储存“最后创建的实体”的变量。",
        },
      ],
      标签: ["动作"],
      提示: "消除通过“创建图标”所创建的一个图标实体。",
    },
    消除地图文本: {
      参数: [
        {
          名称: "文本ID",
          类型: "条件",
          默认: "上一个文本ID",
          提示: "指定要消除的地图文本。此ID可以是“上一个文本ID”，或一个之前储存“上一个文本ID”的变量。",
        },
      ],
      标签: ["动作"],
      提示: "清除”创建地图文本“所创建的地图文本。",
    },
    消除所有HUD文本: {
      标签: ["动作"],
      提示: "消除由“创建HUD文本”动作所创建的所有HUD文本。",
    },
    消除所有图标: {
      标签: ["动作"],
      提示: "消除所有由”创建图标“所创建的图标实体。",
    },
    消除所有地图文本: {
      标签: ["动作"],
      提示: "消除所有”创建地图文本“所创建的所有地图文本。",
    },
    消除所有效果: {
      标签: ["动作"],
      提示: "消除所有由”创建效果“或“创建光束效果”所创建的效果实体。",
    },
    消除所有进度条HUD文本: {
      标签: ["动作"],
      提示: "消除由“创建进度条HUD文本”动作所创建的所有进度条HUD文本。",
    },
    消除所有进度条地图文本: {
      标签: ["动作"],
      提示: "消除由“创建进度条地图文本”动作所创建的所有进度条地图文本。",
    },
    消除效果: {
      参数: [
        {
          名称: "实体",
          类型: "条件",
          默认: "最后创建的实体",
          提示: "指定要消除的图标实体。可以是“最后创建的实体”，或一个之前储存“最后创建的实体”的变量。",
        },
      ],
      标签: ["动作"],
      提示: "消除一个由“创建效果”或“创建光束效果”所创建的效果实体。",
    },
    消除进度条HUD文本: {
      参数: [
        {
          名称: "文本ID",
          类型: "条件",
          默认: "上一个文本ID",
          提示: "指定要消除的进度条HUD文本。此ID可以是“上一个文本ID”，或一个之前储存“上一个文本ID”的变量。",
        },
      ],
      标签: ["动作"],
      提示: "消除由“创建进度条HUD文本”所创建的进度条HUD文本。",
    },
    消除进度条地图文本: {
      参数: [
        {
          名称: "文本ID",
          类型: "条件",
          默认: "上一个文本ID",
          提示: "指定要消除的进度条地图文本。此ID可以是“上一个文本ID”，或一个之前储存“上一个文本ID”的变量。",
        },
      ],
      标签: ["动作"],
      提示: "消除由“创建进度条地图文本”动作所创建的进度条地图文本。",
    },
    清除状态: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的状态将被清除。",
        },
        {
          名称: "状态",
          类型: "状态",
          选项: 常量.状态,
          提示: "从指定玩家身上清除的状态。",
        },
      ],
      标签: ["动作"],
      提示: "清除一个或多个玩家身上由”设置状态“动作施加的一个状态。",
    },
    生成机器人: {
      参数: [
        {
          名称: "英雄",
          类型: "条件",
          默认: "英雄(回声)",
          提示: "机器人使用的英雄。如果提供了多于一个英雄，则会随机在其中选择。",
        },
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "将机器人添加至此队伍。“全部”选项只适用于自由混战模式，“队伍”选项只适用于基于队伍的游戏模式。",
        },
        {
          名称: "栏位",
          类型: "条件",
          默认: "0",
          提示: "在此玩家栏位添加机器人（-1表示第一个可用的空位）。不管游戏大厅中的设置如何，每支队伍最多可以加入6个机器人，自由混战队伍中最多可加入12个机器人。",
        },
        {
          名称: "位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "机器人最初出现的位置。",
        },
        {
          名称: "方向",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "假人最初面向的方向。",
        },
      ],
      标签: ["动作"],
      提示: "在指定队伍的指定栏位添加一个新的机器人（只要该空位可用）。机器人只能移动与射击，或根据地图工坊的动作设置使用技能。启用相应地图工坊扩展可额外创建更多机器人。",
    },
    禁用按钮: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的按钮将被禁用。",
        },
        {
          名称: "按钮",
          类型: "条件",
          默认: "按钮(终极技能)",
          提示: "禁用的逻辑按钮。",
        },
      ],
      标签: ["动作"],
      提示: "禁用一名或多名玩家的逻辑按键，按下此按键后不会产生效果。",
    },
    禁用文字聊天: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的文字聊天将被禁用。",
        },
      ],
      标签: ["动作"],
      提示: "禁用一名或多名玩家的文字聊天，直到重新被启用为止。",
    },
    禁用查看器录制: {
      标签: ["动作"],
      提示: "使地图工坊查看器无法录制新的条目。此功能可以降低你的脚本对服务器造成的负担，特别是当修改数组时。",
    },
    禁用死亡回放时目标的HUD: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家在死亡后观战时将看到他们自己的HUD信息。",
        },
      ],
      标签: ["动作"],
      提示: "取消“死亡回放时启用目标的HUD”动作的效果。",
    },
    禁用语音聊天: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的语音聊天将被启用。",
        },
        {
          名称: "队伍语音聊天",
          类型: "条件",
          默认: "假",
          提示: "队伍语音聊天是否禁用。",
        },
        {
          名称: "比赛语音聊天",
          类型: "条件",
          默认: "假",
          提示: "比赛语音聊天是否禁用。",
        },
        {
          名称: "小队语音聊天",
          类型: "条件",
          默认: "假",
          提示: "小队语音聊天是否禁用。",
        },
      ],
      标签: ["动作"],
      提示: "禁用一名或多名玩家的语音聊天，直到重新被启用为止。",
    },
    移除所有机器人: {
      标签: ["动作"],
      提示: "从比赛中移除所有机器人。",
    },
    移除机器人: {
      参数: [
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "移除此队伍中的机器人。“全部”选项只适用于自由混战模式，“队伍”选项只适用于基于队伍的游戏模式。",
        },
        {
          名称: "栏位",
          类型: "条件",
          默认: "0",
          提示: "移除此栏位的机器人。",
        },
      ],
      标签: ["动作"],
      提示: "从比赛中移除指定机器人。",
    },
    移除玩家: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家将被移除。",
        },
      ],
      标签: ["动作"],
      提示: "将一名或多名玩家移出自定游戏。此动作对机器人无效。",
    },
    移除玩家的所有生命值: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家身上所添加的生命池将移除。",
        },
      ],
      标签: ["动作"],
      提示: "移除由“添加生命池”行动添加的所有生命池。",
    },
    移除玩家的生命池: {
      参数: [
        {
          名称: "生命池ID",
          类型: "条件",
          默认: "上一个创建的生命池",
          提示: "指定一个由“添加生命池”动作所创建的生命池。（可以用“上一个创建的生命池”获得生命池ID的值。）",
        },
      ],
      标签: ["动作"],
      提示: "移除由“添加生命池”行动添加的一个生命池。",
    },
    等待: {
      参数: [
        {
          名称: "时间",
          类型: "条件",
          默认: "0",
          提示: "等待将要持续的时间，单位为秒。最小的有效值为0.016秒。",
        },
        {
          名称: "等待行为",
          类型: "等待行为",
          选项: 常量.等待行为,
          提示: "指定等待是否可以被中断。如果忽略条件列表，则等待不会被中断。否则则依据条件列表判断是否及何时中止或重新开始动作列表。",
        },
      ],
      标签: ["动作"],
      提示: "暂停执行动作列表。除非等待被中断，否则剩余的动作将在暂停之后执行。",
    },
    等待直到: {
      参数: [
        {
          名称: "继续条件",
          类型: "条件",
          默认: "假",
          提示: "如果此值变为“真”，则终止等待，并开始执行动作列表中的下一个动作。",
        },
        {
          名称: "超时",
          类型: "条件",
          默认: "0",
          提示: "如果达到此秒数时限，则终止等待，并开始执行动作列表中的下一个动作。",
        },
      ],
      标签: ["动作"],
      提示: "持续等待，直到“继续条件”为“真”，或达到“超时”的秒数时限。（在此等待过程中，忽略规则的条件。）",
    },
    绑定玩家: {
      参数: [
        {
          名称: "子玩家",
          类型: "条件",
          默认: "所有玩家(所有队伍)",
          提示: "将此玩家绑定至父玩家。在解除绑定或传送离开之前，此玩家无法自由移动。",
        },
        {
          名称: "父玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "将子玩家绑定至此玩家。此玩家本身的动作不受影响，而其行动会决定子玩家的位置。",
        },
        {
          名称: "偏移",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "子玩家与父玩家的相对坐标。例如，矢量 (1, 2, 0) 指示的是父玩家头顶左边的位置。",
        },
      ],
      标签: ["动作"],
      提示: "将一名玩家（子玩家）与另一名玩家（父玩家）绑定。绑定之后，除非解除绑定或传送离开，否则子玩家无法自由移动。多个子玩家可以绑定至同一名父玩家，但反之则不成立。",
    },
    继续: {
      标签: ["动作"],
      提示: "表示一个跳至当前While或For循环起始处继续执行的动作。",
    },
    解除绑定: {
      参数: [
        {
          名称: "子玩家",
          类型: "条件",
          默认: "所有玩家(所有队伍)",
          提示: "下列玩家将与其父玩家解除绑定。",
        },
      ],
      标签: ["动作"],
      提示: "为一名或多名玩家解除“绑定玩家”的行动产生的效果。这些玩家将从其当前位置开始恢复自由行动的能力。",
    },
    记入查看器: {
      参数: [
        {
          名称: "文本",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "将要记入地图工坊查看器的字符串。",
        },
      ],
      标签: ["动作"],
      提示: "使地图工坊查看器录制一条记录。",
    },
    设置不可见: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家将变得隐形。",
        },
        {
          名称: "不可见",
          类型: "可见",
          选项: 常量.可见,
          提示: "将要对下列玩家隐形。",
        },
      ],
      标签: ["动作"],
      提示: "使一名或多名玩家变为隐形，此效果可对所有玩家生效，也可以只对敌人生效。",
    },
    设置主要攻击模式启用: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的主要攻击模式将受到影响。",
        },
        {
          名称: "启用",
          类型: "条件",
          默认: "假",
          提示: "指定一名或多名玩家是否能够使用主要攻击模式。此处应为一个布尔，如“真”、“假”或“比较式”。",
        },
      ],
      标签: ["动作"],
      提示: "启用或禁用一名或多名玩家的主要攻击模式。",
    },
    设置全局变量: {
      参数: [
        {
          名称: "变量",
          类型: "全局变量",
          提示: "指定将值存储哪个全局变量。",
        },
        {
          名称: "值",
          类型: "条件",
          默认: "0",
          提示: "此值将被存储。",
        },
      ],
      标签: ["动作"],
      提示: "将一个值存储为一个全局变量，全局变量即属于游戏本身的变量。",
    },
    设置受到伤害: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "设置下列玩家受到的伤害。",
        },
        {
          名称: "受到伤害百分比",
          类型: "条件",
          默认: "0",
          提示: "将玩家所受到的伤害设置为此百分比。",
        },
      ],
      标签: ["动作"],
      提示: "将一名或多名玩家受到的伤害设置为其原始受到伤害的一定百分比。",
    },
    设置受到治疗: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "设置下列玩家受到的治疗。",
        },
        {
          名称: "受到治疗百分比",
          类型: "条件",
          默认: "0",
          提示: "将玩家所受到的治疗设置为此百分比。",
        },
      ],
      标签: ["动作"],
      提示: "将一名或多名玩家受到的治疗效果设置为其原始受到治疗的一定百分比。",
    },
    设置受到的击退: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "设置下列玩家受到的击退。",
        },
        {
          名称: "受到击退百分比",
          类型: "条件",
          默认: "0",
          提示: "将玩家受到的击退效果设置为其原始受到击退效果的此百分比。",
        },
      ],
      标签: ["动作"],
      提示: "将一名或多名玩家受到的击退效果设置为其原始受到击退效果的一定百分比。",
    },
    "设置启用技能 1": {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的技能 1将受到影响。",
        },
        {
          名称: "启用",
          类型: "条件",
          默认: "假",
          提示: "玩家是否可以使用技能 1。此处应为一个布尔，如“真”、“假”或“比较式”。",
        },
      ],
      标签: ["动作"],
      提示: "启用或禁用一名或多名玩家的技能 1。",
    },
    "设置启用技能 2": {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的技能 2将受到影响。",
        },
        {
          名称: "启用",
          类型: "条件",
          默认: "假",
          提示: "玩家是否可以使用技能 2。此处应为一个布尔，如“真”、“假”或“比较式”。",
        },
      ],
      标签: ["动作"],
      提示: "启用或禁用一名或多名玩家的技能 2。",
    },
    设置启用终极技能: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的终极技能将受到影响。",
        },
        {
          名称: "启用",
          类型: "条件",
          默认: "假",
          提示: "玩家是否可以使用终极技能。此处应为一个布尔，如“真”、“假”或“比较式”。",
        },
      ],
      标签: ["动作"],
      提示: "启用或禁用一名或多名玩家的终极技能。",
    },
    设置启用装填: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的装填将受到影响。",
        },
        {
          名称: "启用",
          类型: "条件",
          默认: "假",
          提示: "玩家是否可以使用装填。此处应为一个布尔，如“真”、“假”或“比较式”。",
        },
      ],
      标签: ["动作"],
      提示: "启用或禁用一名或多名玩家的装填。",
    },
    设置启用跳跃: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的跳跃动作将受到影响。",
        },
        {
          名称: "启用",
          类型: "条件",
          默认: "假",
          提示: "玩家是否可以使用跳跃。此处应为一个布尔，如“真”、“假”或“比较式”。",
        },
      ],
      标签: ["动作"],
      提示: "启用或禁用一名或多名玩家的跳跃动作。",
    },
    设置启用蹲下: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的下蹲动作将受到影响。",
        },
        {
          名称: "启用",
          类型: "条件",
          默认: "假",
          提示: "玩家是否可以使用蹲下。此处应为一个布尔，如“真”、“假”或“比较式”。",
        },
      ],
      标签: ["动作"],
      提示: "启用或禁用一名或多名玩家的蹲下动作。",
    },
    设置启用近战攻击: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的近战攻击将受到影响。",
        },
        {
          名称: "启用",
          类型: "条件",
          默认: "假",
          提示: "玩家是否可以使用近战攻击。此处应为一个布尔，如“真”、“假”或“比较式”。",
        },
      ],
      标签: ["动作"],
      提示: "启用或禁用一名或多名玩家的近战攻击。",
    },
    设置地形消灭者玩家: {
      参数: [
        {
          名称: "目标",
          类型: "条件",
          默认: "所有玩家(所有队伍)",
          提示: "目标玩家的阵亡将被纳入判断。",
        },
        {
          名称: "地形消灭者玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "当目标玩家在降落到地面前死于地形效果时，此消灭视为此名玩家造成的。如果“地形消灭者玩家”设置为“空”则此消灭不会归到任何玩家名下。",
        },
      ],
      标签: ["动作"],
      提示: "设置当指定玩家降落在地面前被地形消灭时，会被归为地形消灭者的玩家。",
    },
    设置引力: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "设置下列玩家的移动引力。",
        },
        {
          名称: "引力百分比",
          类型: "条件",
          默认: "0",
          提示: "将玩家个人的移动引力设置为此百分比。",
        },
      ],
      标签: ["动作"],
      提示: "将一名或多名玩家的移动引力设置为正常行动引力的一定百分比。",
    },
    设置弹药: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "设置下列玩家面朝的弹药数量。",
        },
        {
          名称: "弹夹",
          类型: "条件",
          默认: "0",
          提示: "设置索引处弹夹的弹药数量。0为第一个弹夹，1为第二个。若指定类型不存在，则不进行任何操作。",
        },
        {
          名称: "弹药",
          类型: "条件",
          默认: "0",
          提示: "要设置的弹药数量。",
        },
      ],
      标签: ["动作"],
      提示: "设置一名或多名玩家的弹药数量。",
    },
    创建弹道: {
      参数: [
        {
          名称: "弹道类型",
          类型: "弹道",
          选项: 常量.弹道,
          提示: "所创建弹道的类型。启用弹道地图工坊扩展后可添加新的选项。",
        },
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "拥有此弹道且会被归为击杀者的玩家。若为“空”，则弹道不被任何人拥有。弹道不会影响其拥有者。",
        },
        {
          名称: "开始位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "弹道的起始位置。若为“空”，则使用玩家的眼睛位置。",
        },
        {
          名称: "方向",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "弹道的行动方向。若为“空”，则使用玩家的面朝方向。",
        },
        {
          名称: "相对",
          类型: "相对",
          选项: 常量.相对,
          提示: "弹道的起始位置和方向是相对于玩家还是地图。",
        },
        {
          名称: "修改生命效果类型",
          类型: "弹道生命行为",
          选项: 常量.弹道生命行为,
          提示: "此弹道对碰撞目标造成的是治疗还是伤害。",
        },
        {
          名称: "受影响的队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "哪方队伍会被此弹道碰撞。不管弹道拥有者属于哪方队伍，弹道始终不会影响其拥有者。",
        },
        {
          名称: "数值",
          类型: "条件",
          默认: "0",
          提示: "对弹道碰撞目标造成的伤害或治疗量。如果“爆炸范围”设置为大于0，此数值表示爆炸对中心位置造成的伤害。",
        },
        {
          名称: "数值缩放",
          类型: "条件",
          默认: "0",
          提示: "如果“爆炸范围”设为0，此值表示暴击时伤害值的缩放量。如果“爆炸范围”大于0，此值表示弹道在爆炸边缘处造成的伤害值。",
        },
        {
          名称: "爆炸范围",
          类型: "条件",
          默认: "0",
          提示: "此弹道所产生爆炸的范围。若为0，则弹道不会产生爆炸。",
        },
        {
          名称: "爆炸效果",
          类型: "弹道爆炸效果",
          选项: 常量.弹道爆炸效果,
          提示: "弹道爆炸时应用的效果。如果“爆炸范围”为0，则不会创建此效果。",
        },
        {
          名称: "爆炸声音效果",
          类型: "弹道爆炸声音",
          选项: 常量.弹道爆炸声音,
          提示: "弹道爆炸时应用的声音效果。如果“爆炸范围”为0，则不会创建此效果。",
        },
        {
          名称: "尺寸增幅",
          类型: "条件",
          默认: "0",
          提示: "此数值范围为0到1，表示该弹道尺寸增大的比例，0表示默认尺寸，1表示允许的最大尺寸。每种弹道类型的允许最大尺寸不同。",
        },
        {
          名称: "速度",
          类型: "条件",
          默认: "0",
          提示: "弹道沿前进方向行动的速度，单位为米/秒。",
        },
        {
          名称: "存在时间",
          类型: "条件",
          默认: "0",
          提示: "弹道存在多少秒后消失。",
        },
        {
          名称: "推力",
          类型: "条件",
          默认: "0",
          提示: "此弹道击中目标时施加的推力。如果“爆炸范围”大于0，此推力会施加给受爆炸影响的所有目标。",
        },
        {
          名称: "弹射次数",
          类型: "条件",
          默认: "0",
          提示: "弹道在环境中弹射多少次后消失。",
        },
        {
          名称: "引力",
          类型: "条件",
          默认: "0",
          提示: "影响此弹道的引力值，产生一道弧线。若为负值，则弹道会产生上抛弧线。",
        },
      ],
      标签: ["动作", "弹道"],
      提示: "创建一个弹道实体，可对玩家或玩家拥有的实体造成治疗或伤害。如果已创建了太多的实体，此动作可能会失败。",
    },
    创建弹道效果: {
      参数: [
        {
          名称: "可见",
          类型: "条件",
          默认: "事件玩家",
          提示: "一名或多名玩家将看到此效果。",
        },
        {
          名称: "弹道类型",
          类型: "弹道",
          选项: 常量.弹道,
          提示: "所创建弹道的类型。启用弹道地图工坊扩展后可添加新的选项。",
        },
        {
          名称: "友善",
          类型: "条件",
          默认: "事件玩家",
          提示: "此弹道将对下列玩家友善。(即下列玩家可见为“队伍1”颜色。)",
        },
        {
          名称: "位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "此效果的位置。",
        },
        {
          名称: "方向",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "此效果的面朝方向。",
        },
        {
          名称: "尺寸增幅",
          类型: "条件",
          默认: "0",
          提示: "此数值范围为0到1，表示该弹道尺寸增大的比例，0表示默认尺寸，1表示允许的最大尺寸。每种弹道类型的允许最大尺寸不同。",
        },
        {
          名称: "重新赋值",
          类型: "友善刷新",
          选项: 常量.友善刷新,
          提示: "指定此动作的某个输入值将被持续重新赋值。此效果会要求输入新的数值，并用输入的数值进行重新赋值。",
        },
      ],
      标签: ["动作", "弹道", "效果"],
      提示: "创建一个地图中的弹道效果实体。此实体会持续至使用“消除效果”或“消除所有效果”消除为止。如果想引用此效果，可使用“上一个创建的实体”的返回值。如果已创建了太多的实体，此动作可能会失败。",
    },
    创建追踪弹道: {
      参数: [
        {
          名称: "弹道类型",
          类型: "弹道",
          选项: 常量.弹道,
          提示: "所创建弹道的类型。启用弹道地图工坊扩展后可添加新的选项。",
        },
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "拥有此弹道且会被归为击杀者的玩家。若为“空”，则弹道不被任何人拥有。弹道不会影响其拥有者。",
        },
        {
          名称: "开始位置",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "弹道的起始位置。若为“空”，则使用玩家的眼睛位置。",
        },
        {
          名称: "方向",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "弹道的行动方向。若为“空”，则使用玩家的面朝方向。",
        },
        {
          名称: "相对",
          类型: "相对",
          选项: 常量.相对,
          提示: "弹道的起始位置和方向是相对于玩家还是地图。",
        },
        {
          名称: "修改生命效果类型",
          类型: "弹道生命行为",
          选项: 常量.弹道生命行为,
          提示: "此弹道对碰撞目标造成的是治疗还是伤害。",
        },
        {
          名称: "受影响的队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "哪方队伍会被此弹道碰撞。不管弹道拥有者属于哪方队伍，弹道始终不会影响其拥有者。",
        },
        {
          名称: "数值",
          类型: "条件",
          默认: "0",
          提示: "对弹道碰撞目标造成的伤害或治疗量。如果“爆炸范围”设置为大于0，此数值表示爆炸对中心位置造成的伤害。",
        },
        {
          名称: "数值缩放",
          类型: "条件",
          默认: "0",
          提示: "如果“爆炸范围”设为0，此值表示暴击时伤害值的缩放量。如果“爆炸范围”大于0，此值表示弹道在爆炸边缘处造成的伤害值。",
        },
        {
          名称: "爆炸范围",
          类型: "条件",
          默认: "0",
          提示: "此弹道所产生爆炸的范围。若为0，则弹道不会产生爆炸。",
        },
        {
          名称: "爆炸效果",
          类型: "弹道爆炸效果",
          选项: 常量.弹道爆炸效果,
          提示: "弹道爆炸时应用的效果。如果“爆炸范围”为0，则不会创建此效果。",
        },
        {
          名称: "爆炸声音效果",
          类型: "弹道爆炸声音",
          选项: 常量.弹道爆炸声音,
          提示: "弹道爆炸时应用的声音效果。如果“爆炸范围”为0，则不会创建此效果。",
        },
        {
          名称: "尺寸增幅",
          类型: "条件",
          默认: "0",
          提示: "此数值范围为0到1，表示该弹道尺寸增大的比例，0表示默认尺寸，1表示允许的最大尺寸。每种弹道类型的允许最大尺寸不同。",
        },
        {
          名称: "速度",
          类型: "条件",
          默认: "0",
          提示: "弹道沿前进方向行动的速度，单位为米/秒。",
        },
        {
          名称: "存在时间",
          类型: "条件",
          默认: "0",
          提示: "弹道存在多少秒后消失。",
        },
        {
          名称: "推力",
          类型: "条件",
          默认: "0",
          提示: "此弹道击中目标时施加的推力。如果“爆炸范围”大于0，此推力会施加给受爆炸影响的所有目标。",
        },
        {
          名称: "追踪目标",
          类型: "条件",
          默认: "事件玩家",
          提示: "此弹道追踪的目标。如果为“空”，弹道会沿直线行动。",
        },
        {
          名称: "追踪强度",
          类型: "条件",
          默认: "0",
          提示: "此数值范围为0到1，表示该弹道追踪目标的强度，以及跟丢目标的难易度。0表示弹道完全不会追踪目标，1表示弹道会积极追踪目标且绝不会跟丢。",
        },
      ],
      标签: ["动作", "弹道", "追踪"],
      提示: "创建一个弹道实体，可对玩家或玩家拥有的实体造成治疗或伤害。弹道会按强度变量追踪给定目标。如果已创建了太多的实体，此动作可能会失败。",
    },
    设置弹道引力: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "设置下列玩家的弹道引力。",
        },
        {
          名称: "弹道引力百分比",
          类型: "条件",
          默认: "0",
          提示: "将玩家个人的弹道引力设置为此百分比。",
        },
      ],
      标签: ["动作", "弹道"],
      提示: "将一名或多名玩家的弹道引力设置为正常弹道引力的一定百分比。",
    },
    设置弹道速度: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "设置下列玩家的弹道速度。",
        },
        {
          名称: "弹道速度百分比",
          类型: "条件",
          默认: "0",
          提示: "将玩家个人的弹道速度设置为此百分比。",
        },
      ],
      标签: ["动作", "弹道"],
      提示: "将一名或多名玩家的弹道速度设置为正常弹道速度的一定百分比。",
    },
    设置慢动作: {
      参数: [
        {
          名称: "速度百分比",
          类型: "条件",
          默认: "0",
          提示: "模拟速率与正常速率的百分比。此数值不得超过100",
        },
      ],
      标签: ["动作"],
      提示: "设置整个游戏的模拟速率，包括所有玩家、弹道、效果及游戏模式逻辑。",
    },
    设置技能充能: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的技能充能次数将被修改。",
        },
        {
          名称: "按钮",
          类型: "条件",
          默认: "按钮(终极技能)",
          提示: "与此技能关联的逻辑按钮将被修改。",
        },
        {
          名称: "充能计数",
          类型: "条件",
          默认: "0",
          提示: "要设置的充能次数。",
        },
      ],
      标签: ["动作"],
      提示: "设置一名或多名玩家的技能充能次数（如果支持的话）。",
    },
    设置技能冷却: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的技能冷却时间将被修改。",
        },
        {
          名称: "按钮",
          类型: "条件",
          默认: "按钮(终极技能)",
          提示: "与此技能关联的逻辑按钮将被修改。",
        },
        {
          名称: "冷却时间",
          类型: "条件",
          默认: "0",
          提示: "设置冷却时间，单位为秒。",
        },
      ],
      标签: ["动作"],
      提示: "设置一名或多名玩家的技能冷却时间（如果支持的话）。",
    },
    设置技能资源: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的技能资源百分比将被修改。",
        },
        {
          名称: "按钮",
          类型: "条件",
          默认: "按钮(终极技能)",
          提示: "与此技能关联的逻辑按钮将被修改。",
        },
        {
          名称: "资源百分比",
          类型: "条件",
          默认: "0",
          提示: "技能资源相对于每位玩家技能资源量的百分比。",
        },
      ],
      标签: ["动作"],
      提示: "设置一名或多名玩家的技能资源百分比（如果支持的话）。",
    },
    设置最大复生时间: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "设置下列玩家的最大复生时间。",
        },
        {
          名称: "时间",
          类型: "条件",
          默认: "0",
          提示: "死亡与复生之间的持续时间，以秒为单位。",
        },
      ],
      标签: ["动作"],
      提示: "设置一名或多名玩家死亡与复生之间的持续时间。对此动作执行时已经死亡的玩家，此效果将在他们下次死亡时生效。",
    },
    设置最大弹药: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "设置下列玩家面朝的最大弹药数量。",
        },
        {
          名称: "弹夹",
          类型: "条件",
          默认: "0",
          提示: "设置索引处弹夹的弹药数量。0为第一个弹夹，1为第二个。若指定类型不存在，则不进行任何操作。",
        },
        {
          名称: "弹药",
          类型: "条件",
          默认: "0",
          提示: "要设置的最大弹药数量。",
        },
      ],
      标签: ["动作"],
      提示: "设置一名或多名玩家的最大弹药数量。",
    },
    设置最大生命值: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的最大生命值将被设定。",
        },
        {
          名称: "生命百分比",
          类型: "条件",
          默认: "0",
          提示: "将这些玩家的最大生命值设为其原始最大生命值的百分比。",
        },
      ],
      标签: ["动作"],
      提示: "将一名或多名玩家的最大生命值设置为其原始最大生命值的一定百分比。此动作会保证玩家当前的生命值不会超过其新的最大生命值。由地图工坊动作添加的生命池不会受此动作影响。",
    },
    设置朝向: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "设置下列玩家面朝的方向。",
        },
        {
          名称: "方向",
          类型: "条件",
          默认: "矢量(0, 0, 0)",
          提示: "玩家面朝的单位方向。此值将进行内部归一化。",
        },
        {
          名称: "相对",
          类型: "相对",
          选项: 常量.相对,
          提示: "确定此方向是相对于地图坐标还是玩家的本地坐标。",
        },
      ],
      标签: ["动作"],
      提示: "设置一名或多名玩家面向的方向。",
    },
    设置武器: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "设置下列玩家的武器。",
        },
        {
          名称: "武器",
          类型: "条件",
          默认: "0",
          提示: "正在装备的武器号码。1为主武器，2为辅助武器。如果指定的武器不存在，玩家将使用默认武器。",
        },
      ],
      标签: ["动作"],
      提示: "设置一名或多名玩家的武器。",
    },
    设置比赛时间: {
      参数: [
        {
          名称: "时间",
          类型: "条件",
          默认: "0",
          提示: "比赛时间，单位为秒。",
        },
      ],
      标签: ["动作"],
      提示: "设置当前比赛时间（玩家可在屏幕顶端看到）。此行动可以用来缩短或延长比赛的持续时间，或改变集结英雄或准备阶段的时间。",
    },
    设置状态: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家将被施加此状态。",
        },
        {
          名称: "助攻者",
          类型: "条件",
          默认: "事件玩家",
          提示: "如果在效果持续期间受到影响的玩家被击杀，则视为此名玩家完成的助攻。如果“助攻者”设置为“空”则此助攻不会归到任何玩家名下。",
        },
        {
          名称: "状态",
          类型: "状态",
          选项: 常量.状态,
          提示: "对指定玩家施加此状态。此状态与玩家使用英雄技能时施放的状态效果相同。",
        },
        {
          名称: "持续时间",
          类型: "条件",
          默认: "0",
          提示: "状态持续时间，以秒为单位。如果要让状态持续直到执行“清除状态”动作为止，可以输入较长的持续时间，如9999。",
        },
      ],
      标签: ["动作"],
      提示: "对一名或多名玩家施加一个状态。此状态会持续指定的”持续时间“，或直到被”清除状态“动作清除。",
    },
    设置玩家分数: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "设置下列玩家的分数。",
        },
        {
          名称: "得分",
          类型: "条件",
          默认: "0",
          提示: "要设置的分数。",
        },
      ],
      标签: ["动作"],
      提示: "设置一名或多名玩家的分数（击杀数）。此动作只在自由混战模式中生效。",
    },
    设置玩家变量: {
      参数: [
        {
          名称: "变量",
          类型: "玩家变量",
          提示: "指定将值存储为玩家的哪些变量。",
        },
        {
          名称: "值",
          类型: "条件",
          默认: "0",
          提示: "此值将被存储。",
        },
      ],
      标签: ["动作"],
      提示: "将一个值存储为一个玩家变量，玩家变量即属于一个特定玩家的变量。",
    },
    设置玩家可选的英雄: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "设置下列玩家的英雄列表。",
        },
        {
          名称: "英雄",
          类型: "条件",
          默认: "英雄(回声)",
          提示: "可供选择的英雄。如果没有提供英雄，此动作无效。",
        },
      ],
      标签: ["动作"],
      提示: "设置一名或多名玩家可用的英雄列表。如果玩家当前所使用的英雄变得不可用，则此玩家将被强制选择另一名英雄，并在适当的复生位置复生。",
    },
    设置玩家生命值: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "将玩家的生命设为此值。",
        },
        {
          名称: "生命值",
          类型: "条件",
          默认: "0",
          提示: "玩家所能拥有的最大生命值。",
        },
      ],
      标签: ["动作"],
      提示: "设置一名或多名玩家的生命值，同时不影响状态，也不造成伤害/治疗。此行动只会对还活着的玩家造成影响。（对死去的玩家，请使用“复活玩家”动作。）",
    },
    设置目标点描述: {
      参数: [
        {
          名称: "可见",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家将看到此信息。",
        },
        {
          名称: "标题",
          类型: "条件",
          默认: '自定义字符串("")',
          提示: "将要显示的信息。",
        },
        {
          名称: "重新赋值",
          类型: "HUD文本刷新",
          选项: 常量.HUD文本刷新,
          提示: "指定此动作的某个输入值将被持续重新赋值。这段信息会要求输入新的数值，并用输入的数值进行重新赋值。",
        },
      ],
      标签: ["动作"],
      提示: "将屏幕顶部正中通常用来显示目标点信息的文字修改为其他信息，对指定的玩家可见。",
    },
    设置瞄准速度: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "设置下列玩家的瞄准速度。",
        },
        {
          名称: "转向速度百分比",
          类型: "条件",
          默认: "0",
          提示: "将玩家的瞄准速度设置为此百分比。",
        },
      ],
      标签: ["动作"],
      提示: "将一名或多名玩家的瞄准速度设置为其原始瞄准速度的一定百分比。",
    },
    设置移动速度: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "设置下列玩家的移动速度。",
        },
        {
          名称: "移动速度百分比",
          类型: "条件",
          默认: "0",
          提示: "将玩家的移动速度设置为此百分比。",
        },
      ],
      标签: ["动作"],
      提示: "将一名或多名玩家的移动速度设置为其原始移动速度的一定百分比。",
    },
    设置终极技能充能: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "设置下列玩家的终极技能充能。",
        },
        {
          名称: "充能百分比",
          类型: "条件",
          默认: "0",
          提示: "最大的充能百分比。",
        },
      ],
      标签: ["动作"],
      提示: "将一名或多名玩家的终极技能充能设为最大充能的一定百分比。",
    },
    设置跳跃垂直速度: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "设置下列玩家的跳跃垂直速度。",
        },
        {
          名称: "垂直跳跃速度百分比",
          类型: "条件",
          默认: "0",
          提示: "将玩家的跳跃垂直速度设置为此百分比。",
        },
      ],
      标签: ["动作"],
      提示: "将一名或多名玩家的跳跃垂直速度设置为其原始跳跃垂直速度的一定百分比。",
    },
    设置辅助攻击模式启用: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的辅助攻击模式将受到影响。",
        },
        {
          名称: "启用",
          类型: "条件",
          默认: "假",
          提示: "指定一名或多名玩家是否能够使用辅助攻击模式。此处应为一个布尔，如“真”、“假”或“比较式”。",
        },
      ],
      标签: ["动作"],
      提示: "启用或禁用一名或多名玩家的辅助攻击模式。",
    },
    设置造成伤害: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "设置下列玩家造成的伤害。",
        },
        {
          名称: "造成伤害百分比",
          类型: "条件",
          默认: "0",
          提示: "将玩家所造成的伤害设置为此百分比。",
        },
      ],
      标签: ["动作"],
      提示: "将一名或多名玩家造成的伤害设置为其原始造成伤害的一定百分比。",
    },
    设置造成治疗: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "设置下列玩家造成的治疗。",
        },
        {
          名称: "造成治疗百分比",
          类型: "条件",
          默认: "0",
          提示: "将玩家所造成的治疗设置为此百分比。",
        },
      ],
      标签: ["动作"],
      提示: "将一名或多名玩家造成的治疗效果设置为其原始造成治疗的一定百分比。",
    },
    设置造成的击退: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "设置下列玩家造成的击退。",
        },
        {
          名称: "造成击退百分比",
          类型: "条件",
          默认: "0",
          提示: "将玩家造成的击退效果设置为其原始造成击退效果的此百分比。",
        },
      ],
      标签: ["动作"],
      提示: "将一名或多名玩家造成的击退效果设置为其原始造成击退效果的一定百分比。",
    },
    设置队伍分数: {
      参数: [
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "要设置分数的队伍。",
        },
        {
          名称: "得分",
          类型: "条件",
          默认: "0",
          提示: "要设置的分数。",
        },
      ],
      标签: ["动作"],
      提示: "设置一方或双方队伍的分数。此动作在自由混战模式或没有队伍分数的模式中无效。",
    },
    调整玩家队伍: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家将被移动。",
        },
        {
          名称: "队伍",
          类型: "条件",
          默认: "所有队伍",
          提示: "将玩家移动至此队伍。“全部”选项只适用于自由混战模式，“队伍”选项只适用于基于队伍的游戏模式。",
        },
        {
          名称: "栏位",
          类型: "条件",
          默认: "0",
          提示: "在此玩家栏位添加玩家（-1表示第一个可用的空位）。",
        },
      ],
      标签: ["动作"],
      提示: "将一名或多名玩家移动至指定队伍和栏位。指定栏位不可用时，此动作会失败。此动作对机器人无效。",
    },
    调用子程序: {
      参数: [
        {
          名称: "子程序",
          类型: "子程序",
          提示: "指定要调用的子程序。如果一个事件类型为子程序的规则指定了同一段子程序，那么它将会被执行。否则会忽略此行动。",
        },
      ],
      标签: ["动作"],
      提示: "暂停执行当前规则，并开始执行子程序规则（事件类型为”子程序“的规则）。当子程序规则结束时，原来的规则将恢复执行。子程序可以使用同样的情景变量（如事件玩家）的原始值。",
    },
    跳过: {
      参数: [
        {
          名称: "动作数量",
          类型: "条件",
          默认: "0",
          提示: "跳过的动作条数，不包括此动作。",
        },
      ],
      标签: ["动作"],
      提示: "跳过动作列表中一定条数的动作。",
    },
    返回大厅: {
      标签: ["动作"],
      提示: "将游戏模式返回至自定游戏大厅。",
    },
    追踪全局变量频率: {
      参数: [
        {
          名称: "变量",
          类型: "全局变量",
          提示: "指定要改变的全局变量。",
        },
        {
          名称: "最终值",
          类型: "条件",
          默认: "0",
          提示: "该全局变量最后达到的值。这个值的类型可以是数字或矢量，然而必须与追踪开始时全局变量所具有的值相同。",
        },
        {
          名称: "频率",
          类型: "条件",
          默认: "0",
          提示: "此变量的值每秒改变的量。",
        },
        {
          名称: "重新赋值",
          类型: "追踪频率刷新",
          选项: 常量.追踪频率刷新,
          提示: "指定此动作的某个输入值将被持续重新赋值。此动作会要求输入新的数值，并用输入的数值进行重新赋值。",
        },
      ],
      标签: ["动作"],
      提示: "以指定的速率逐步改变一个全局变量的值，全局变量即属于游戏本身的变量。",
    },
    追踪玩家变量频率: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "此玩家的变量将被逐渐改变。如果有多个玩家，则每个玩家的变量都将各自被改变。",
        },
        {
          名称: "变量",
          类型: "玩家变量",
          提示: "指定将要改变的玩家变量。",
        },
        {
          名称: "最终值",
          类型: "条件",
          默认: "0",
          提示: "该玩家变量最后达到的值。这个值的类型可以是数字或矢量，然而必须与追踪开始时玩家变量所具有的值相同。",
        },
        {
          名称: "频率",
          类型: "条件",
          默认: "0",
          提示: "此变量的值每秒改变的量。",
        },
        {
          名称: "重新赋值",
          类型: "追踪频率刷新",
          选项: 常量.追踪频率刷新,
          提示: "指定此动作的某个输入值将被持续重新赋值。此动作会要求输入新的数值，并用输入的数值进行重新赋值。",
        },
      ],
      标签: ["动作"],
      提示: "以指定的速率逐步改变一个玩家变量的值，玩家变量即属于一个特定玩家的变量。",
    },
    重新开始比赛: {
      标签: ["动作"],
      提示: "重新开始比赛。此动作仅在比赛存在30秒后才可生效。",
    },
    重置玩家英雄可选状态: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的英雄列表将被重置。",
        },
      ],
      标签: ["动作"],
      提示: "将一名或多名玩家可用的英雄列表恢复至游戏设置所指定的英雄列表。如果玩家当前所使用的英雄变得不可用，则此玩家将被强制选择另一名英雄，并在适当的复生位置复生。",
    },
    隐藏信息: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的信息将被隐藏。",
        },
      ],
      标签: ["动作"],
      提示: "隐藏一名或多名玩家的信息，直到重新被显示为止。",
    },
    隐藏姓名板: {
      参数: [
        {
          名称: "被观察的玩家",
          类型: "条件",
          默认: "所有玩家(所有队伍)",
          提示: "下列被观察的玩家的姓名板将被隐藏。",
        },
        {
          名称: "观察玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "从此观察玩家的视角看，被观察的玩家的姓名板将被隐藏。",
        },
      ],
      标签: ["动作"],
      提示: "从观察玩家的视角看，被观察的玩家的姓名板将被隐藏。",
    },
    隐藏消灭提示: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的消灭提示将被隐藏。",
        },
      ],
      标签: ["动作"],
      提示: "隐藏一名或多名玩家的消灭提示，直到重新被显示为止。",
    },
    隐藏游戏模式HUD: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的游戏模式HUD将被隐藏。",
        },
      ],
      标签: ["动作"],
      提示: "隐藏一名或多名玩家的游戏模式HUD，直到重新被显示为止。",
    },
    隐藏游戏模式地图UI: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的游戏模式地图UI将被隐藏。",
        },
      ],
      标签: ["动作"],
      提示: "隐藏一名或多名玩家的游戏模式地图UI，直到重新被显示为止。",
    },
    隐藏英雄HUD: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的英雄HUD将被隐藏。",
        },
      ],
      标签: ["动作"],
      提示: "隐藏一名或多名玩家的英雄HUD，直到重新被显示为止。",
    },
    隐藏计分板: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家的计分板将被隐藏。",
        },
      ],
      标签: ["动作"],
      提示: "隐藏一名或多名玩家的消灭提示，直到重新被显示为止。",
    },
    预加载英雄: {
      参数: [
        {
          名称: "玩家",
          类型: "条件",
          默认: "事件玩家",
          提示: "下列玩家将开始预载一名或多名英雄。对每名玩家，同一时间只能有一个“预载英雄”动作生效。",
        },
        {
          名称: "英雄",
          类型: "条件",
          默认: "英雄(回声)",
          提示: "指定玩家将在此列表中选择英雄。当数组中出现多个英雄时，将会优先选择排在前面的英雄。",
        },
      ],
      标签: ["动作"],
      提示: "预先为指定的玩家将指定的英雄及皮肤加载入内存。当需要经常改变英雄且已知接下来要使用哪个英雄时适用。",
    },
  },
};

let 扩展 = {
  光束效果: { 标签: ["扩展", "∴ 2"], 提示: "一个工坊扩展选项。" },
  光束声音: { 标签: ["扩展", "∴ 1"], 提示: "一个工坊扩展选项。" },
  增益状态效果: { 标签: ["扩展", "∴ 2"], 提示: "一个工坊扩展选项。" },
  减益状态效果: { 标签: ["扩展", "∴ 2"], 提示: "一个工坊扩展选项。" },
  增益效果和减益效果声音: { 标签: ["扩展", "∴ 2"], 提示: "一个工坊扩展选项。" },
  能量爆炸效果: { 标签: ["扩展", "∴ 4"], 提示: "一个工坊扩展选项。" },
  运动爆炸效果: { 标签: ["扩展", "∴ 4"], 提示: "一个工坊扩展选项。" },
  爆炸声音: { 标签: ["扩展", "∴ 2"], 提示: "一个工坊扩展选项。" },
  播放更多效果: { 标签: ["扩展", "∴ 1"], 提示: "一个工坊扩展选项。" },
  生成更多机器人: { 标签: ["扩展", "∴ 2"], 提示: "一个工坊扩展选项。" },
  弹道: { 标签: ["扩展", "∴ 4"], 提示: "一个工坊扩展选项。" },
};

let 模版 = {
  全局: {
    设置: {
      格式: `设置
{
    主程序
    {
        描述: \${1:新游戏}
        模式名称: \${2:新模式}
    }

    大厅
    {
        \${3}
    }

    模式
    {
        \${4}
    }

    英雄
    {
        \${5}
    }

    扩展
    {
        \${6}
    }
}`,
      标签: ["模板", "全局"],
      提示: "一个全局中的设置模板。",
    },

    变量: {
      格式: `变量
{
    全局:
        \${1:0: A}

    玩家:
        \${1:0: A}
}`,
      标签: ["模板", "全局"],
      提示: "一个全局中的变量模板。",
    },

    子程序: {
      格式: `子程序
{
    \${1:0: Sub0}
}`,
      标签: ["模板", "全局"],
      提示: "一个全局中的子程序模板。",
    },

    规则: {
      格式: `规则("\${1}")
{
    事件
    {
        \${2:持续 - 全局;}
    }

    条件
    {
        \${3}
    }

    动作
    {
        \${4}
    }
}`,
      标签: ["模板", "全局"],
      提示: "一个全局中的规则模板。",
    },
  },

  规则: {
    事件: {
      格式: `事件
{
    \${1}
}`,
      标签: ["模板", "规则"],
      提示: "一个规则中的事件模板。",
    },

    条件: {
      格式: `条件
{
    \${1}
}`,
      标签: ["模板", "规则"],
      提示: "一个规则中的条件模板。",
    },

    动作: {
      格式: `动作
{
    \${1}
}`,
      标签: ["模板", "规则"],
      提示: "一个规则中的动作模板。",
    },
  },
};

function buildPinyinFilterText(text) {
  let pinyin = "";
  for (let i = 0; i < text.length; i++) {
    if (拼音.hasOwnProperty(text[i])) {
      pinyin += 拼音[text[i]];
    } else if (/[\.a-zA-Z0-9： -，“”（）！？…]/.test(text[i])) {
      pinyin += text[i];
    } else {
      console.log(`拼音缺失: ${text[i]}: "",`);
    }
  }
  //console.log(pinyin);
  return pinyin;
}

function buildHover(PATH, name, tags, details) {
  let hoverString = new vscode.MarkdownString();
  hoverString.isTrusted = true;
  hoverString.supportHtml = true;
  hoverString.supportThemeIcons = true;
  hoverString.baseUri = vscode.Uri.file(path.join(PATH, "", path.sep));
  //标题
  hoverString.appendMarkdown(`**<span>${name}</span>**\n\n`);
  //标签
  if (tags) {
    for (t of tags) {
      hoverString.appendMarkdown(`\`${t}\`&nbsp;`);
    }
    hoverString.appendMarkdown(`\n\n`);
  }
  //详情
  if (details) {
    hoverString.appendMarkdown(`${details}`);
  }
  return new vscode.Hover(hoverString);
}

function buildCompletion(
  PATH,
  label,
  kind,
  tags,
  details,
  filterText,
  insertText,
  sortText,
  command
) {
  const item = new vscode.CompletionItem(label, kind);
  item.documentation = new vscode.MarkdownString();
  item.documentation.isTrusted = true;
  item.documentation.supportHtml = true;
  item.documentation.supportThemeIcons = true;
  item.documentation.baseUri = vscode.Uri.file(path.join(PATH, "", path.sep));
  item.documentation.appendMarkdown(`**<span>${label}</span>**\n\n`);
  if (tags) {
    for (t of tags) {
      item.documentation.appendMarkdown(`\`${t}\`&nbsp;`);
    }
    item.documentation.appendMarkdown(`\n\n`);
  }
  if (details) {
    item.documentation.appendMarkdown(details);
  }
  if (filterText) {
    item.filterText = (filterText + buildPinyinFilterText(filterText))
      .split("")
      .join(" ");
  } else {
    item.filterText = (label + buildPinyinFilterText(label))
      .split("")
      .join(" ");
  }
  if (insertText) {
    item.insertText = insertText;
  }
  if (sortText) {
    item.sortText = sortText;
  }
  if (command) {
    item.command = command;
  }
  return item;
}

function buildParameter(
  functName,
  paramName,
  paramIndex,
  paramType,
  paramDetails
) {
  const parameterInformation = new vscode.ParameterInformation();
  parameterInformation.documentation = new vscode.MarkdownString();
  parameterInformation.documentation.isTrusted = true;
  parameterInformation.documentation.supportHtml = true;
  parameterInformation.documentation.supportThemeIcons = true;
  parameterInformation.documentation.appendMarkdown(
    `***<span style="color:#0ac;">⬘</span>&nbsp;参数&nbsp;:&nbsp;${paramName}***\n\n`
  );
  parameterInformation.documentation.appendMarkdown(
    `\`${paramIndex}\` \`${paramType}\`&nbsp;\n\n`
  );
  parameterInformation.documentation.appendMarkdown(
    `${paramDetails}&nbsp;\n\n`
  );
  return parameterInformation;
}

function buildStaticModels(PATH) {
  for (i in 常量) {
    if (
      i == "英雄" ||
      i == "图标" ||
      i == "颜色" ||
      i == "按钮" ||
      i == "字符串"
    ) {
      continue;
    }
    for (j in 常量[i]) {
      常量[i][j].悬停 = buildHover(
        PATH,
        常量[i][j].名称,
        常量[i][j].标签,
        常量[i][j].提示
      );
      常量[i][j].补全 = buildCompletion(
        PATH,
        常量[i][j].名称,
        vscode.CompletionItemKind.Constant,
        常量[i][j].标签,
        常量[i][j].提示
      );
    }
  }
  for (i in 常量.英雄) {
    let details = [``, ``].map(
      (element) =>
        (element += `
|||
|:--|:--|
<img src="${常量.英雄[i].图标}" width=50 height=50/>&nbsp;&nbsp;|${常量.英雄[i].提示}\n\n`)
    );
    if (常量.英雄[i].生命.hasOwnProperty("自由")) {
      details = details.map(
        (element) =>
          (element += `***自由***&nbsp;&nbsp;\`${常量.英雄[i].生命.自由}\`&nbsp;&nbsp;`)
      );
    }
    if (常量.英雄[i].生命.hasOwnProperty("职责")) {
      details = details.map(
        (element) =>
          (element += `***职责***&nbsp;&nbsp;\`${常量.英雄[i].生命.职责}\`&nbsp;&nbsp;`)
      );
    }
    if (常量.英雄[i].生命.hasOwnProperty("护甲")) {
      details = details.map(
        (element) =>
          (element += `***护甲***&nbsp;&nbsp;<span style="color:#C50;">\`${常量.英雄[i].生命.护甲}\`</span>&nbsp;&nbsp;`)
      );
    }
    if (常量.英雄[i].生命.hasOwnProperty("护盾")) {
      details = details.map(
        (element) =>
          (element += `***护盾***&nbsp;&nbsp;<span style="color:#0AC;">\`${常量.英雄[i].生命.护盾}\`</span>`)
      );
    }
    details = details.map((element) => (element += `\n\n`));
    for (j in 常量.英雄[i].技能) {
      details = details.map(
        (element, index) =>
          (element += `
||||
|:-:|-:|:-|
|<img src="${
            Array.isArray(常量.英雄[i].技能[j].图标)
              ? 常量.英雄[i].技能[j].图标[index]
              : 常量.英雄[i].技能[j].图标
          }" width=auto height=25/>&nbsp;&nbsp;|***${j}***&nbsp;&nbsp;|`)
      );

      for (k in 常量.英雄[i].技能[j].绑定) {
        details = details.map(
          (element) => (element += `\`${常量.英雄[i].技能[j].绑定[k]}\`&nbsp;`)
        );
      }
      details = details.map((element) => (element += `\n\n`));
    }
    常量.英雄[i].悬停 = details.map((element) =>
      buildHover(PATH, 常量.英雄[i].名称, 常量.英雄[i].标签, element)
    );
    常量.英雄[i].补全 = details.map((element) =>
      buildCompletion(
        PATH,
        常量.英雄[i].名称,
        vscode.CompletionItemKind.Constant,
        常量.英雄[i].标签,
        element
      )
    );
  }
  for (i in 常量.图标) {
    let details = [``, ``].map(
      (element, index) =>
        (element += `
|||
|:-|:-|
<img src="${常量.图标[i].图标[index]}" width=30 height=30/>&nbsp;&nbsp;|${常量.图标[i].提示}`)
    );
    常量.图标[i].悬停 = details.map((element) =>
      buildHover(PATH, 常量.图标[i].名称, 常量.图标[i].标签, element)
    );
    常量.图标[i].补全 = details.map((element) =>
      buildCompletion(
        PATH,
        常量.图标[i].名称,
        vscode.CompletionItemKind.Constant,
        常量.图标[i].标签,
        element
      )
    );
  }
  for (i in 常量.按钮) {
    let details = [``, ``].map(
      (element, index) =>
        (element += `
|||
|:-|:-|
<img src="${常量.按钮[i].图标[index]}" width=25 height=25/>&nbsp;&nbsp;|${常量.按钮[i].提示}`)
    );
    常量.按钮[i].悬停 = details.map((element) =>
      buildHover(PATH, 常量.按钮[i].名称, 常量.按钮[i].标签, element)
    );
    常量.按钮[i].补全 = details.map((element) =>
      buildCompletion(
        PATH,
        常量.按钮[i].名称,
        vscode.CompletionItemKind.Constant,
        常量.按钮[i].标签,
        element
      )
    );
  }
  for (i in 常量.颜色) {
    常量.颜色[i].悬停 = buildHover(
      PATH,
      常量.颜色[i].名称,
      常量.颜色[i].标签,
      `
|||
|:-|:-|
<img src="${常量.颜色[i].图标}" width=25 height=25/>&nbsp;&nbsp;|${常量.颜色[i].提示}`
    );
    常量.颜色[i].补全 = buildCompletion(
      PATH,
      常量.颜色[i].名称,
      vscode.CompletionItemKind.Constant,
      常量.颜色[i].标签,
      `
|||
|:-|:-|
<img src="${常量.颜色[i].图标}" width=25 height=25/>&nbsp;&nbsp;|${常量.颜色[i].提示}`
    );
  }
  for (i in 常量.字符串) {
    常量.字符串[i].补全 = buildCompletion(
      PATH,
      常量.字符串[i].名称,
      vscode.CompletionItemKind.Constant,
      常量.字符串[i].标签,
      常量.字符串[i].提示
    );
  }
  for (i in 规则.事件.选项) {
    规则.事件.选项[i].悬停 = buildHover(
      PATH,
      i,
      规则.事件.选项[i].标签,
      规则.事件.选项[i].提示
    );
    规则.事件.选项[i].补全 = buildCompletion(
      PATH,
      i,
      vscode.CompletionItemKind.Event,
      规则.事件.选项[i].标签,
      规则.事件.选项[i].提示,
      undefined,
      `${i};`
    );
  }
  for (i in 规则.事件.队伍) {
    规则.事件.队伍[i].悬停 = buildHover(
      PATH,
      i,
      规则.事件.队伍[i].标签,
      规则.事件.队伍[i].提示
    );
    规则.事件.队伍[i].补全 = buildCompletion(
      PATH,
      i,
      vscode.CompletionItemKind.Event,
      规则.事件.队伍[i].标签,
      规则.事件.队伍[i].提示,
      undefined,
      `${i};`
    );
  }
  for (i in 规则.事件.玩家) {
    规则.事件.玩家[i].悬停 = buildHover(
      PATH,
      i,
      规则.事件.玩家[i].标签,
      规则.事件.玩家[i].提示
    );
    规则.事件.玩家[i].补全 = buildCompletion(
      PATH,
      i,
      vscode.CompletionItemKind.Event,
      规则.事件.玩家[i].标签,
      规则.事件.玩家[i].提示,
      undefined,
      `${i};`,
      规则.事件.玩家[i].顺序
    );
  }
  for (i in 规则.条件) {
    let details = `${规则.条件[i].提示}`;
    let insertText = new vscode.SnippetString(i);
    let command = undefined;
    //返回
    if (规则.条件[i].hasOwnProperty("返回")) {
      details += `\n\n---\n\n***<span style="color:#c50;">⬘</span>&nbsp;返回***\n\n`;
      for (j in 规则.条件[i].返回) {
        details += `\`${规则.条件[i].返回[j]}\` `;
      }
    }
    //参数
    if (规则.条件[i].hasOwnProperty("参数")) {
      details += `\n\n---\n\n***<span style="color:#0ac;">⬘</span>&nbsp;参数***\n\n`;
      insertText.appendText(`(`);
      const params = 规则.条件[i].参数;
      params.forEach((element, index) => {
        if (element.类型.match(/^条件|数字|布尔$/)) {
          insertText.appendPlaceholder(`${element.默认}`);
        } else if (Array.isArray(element.选项)) {
          insertText.appendPlaceholder(`${element.选项[0].名称}`);
        } else {
          insertText.appendPlaceholder(``);
        }
        if (index < params.length - 1) {
          insertText.appendText(`, `);
        }
        element.签名 = buildParameter(
          i,
          element.名称,
          index,
          element.类型,
          element.提示
        );
        details += `\`${index}\`&nbsp;\`${element.名称}\`&nbsp;-&nbsp;${element.提示}\n\n`;
      });
      insertText.appendText(`)`);
      command = {
        command: "editor.action.triggerParameterHints",
        title: "triggerParameterHints",
        arguments: [],
      };
    }
    规则.条件[i].悬停 = buildHover(PATH, i, 规则.条件[i].标签, details);
    规则.条件[i].补全 = buildCompletion(
      PATH,
      i,
      vscode.CompletionItemKind.Class,
      规则.条件[i].标签,
      details.replace(/---/g, ""),
      undefined,
      规则.条件[i].hasOwnProperty("格式")
        ? new vscode.SnippetString(规则.条件[i].格式)
        : insertText,
      undefined,
      command
    );
  }
  for (i in 规则.动作) {
    let details = `${规则.动作[i].提示}`;
    let insertText = new vscode.SnippetString(i);
    let command = undefined;
    //参数
    if (规则.动作[i].hasOwnProperty("参数")) {
      details += `\n\n---\n\n***<span style="color:#0ac;">⬘</span>&nbsp;参数***\n\n`;
      insertText.appendText(`(`);
      const params = 规则.动作[i].参数;
      params.forEach((element, index) => {
        if (element.类型.match(/^条件|数字|布尔$/)) {
          insertText.appendPlaceholder(`${element.默认}`);
        } else if (Array.isArray(element.选项)) {
          insertText.appendPlaceholder(`${element.选项[0].名称}`);
        } else if (element.类型.match(/^全局变量|玩家变量$/)) {
          insertText.appendPlaceholder(`A`);
        } else if (element.类型.match("子程序")) {
          insertText.appendPlaceholder(`Sub0`);
        } else {
          insertText.appendPlaceholder(``);
        }
        if (index < params.length - 1) {
          insertText.appendText(`, `);
        }
        element.签名 = buildParameter(
          i,
          element.名称,
          index,
          element.类型,
          element.提示
        );
        details += `\`${index}\`&nbsp;\`${element.名称}\`&nbsp;-&nbsp;${element.提示}\n\n`;
      });
      insertText.appendText(`)`);
      command = {
        command: "editor.action.triggerParameterHints",
        title: "triggerParameterHints",
        arguments: [],
      };
    }
    insertText.appendText(`;`);
    规则.动作[i].悬停 = buildHover(PATH, i, 规则.动作[i].标签, details);
    规则.动作[i].补全 = buildCompletion(
      PATH,
      i,
      vscode.CompletionItemKind.Method,
      规则.动作[i].标签,
      details.replace(/---/g, ""),
      undefined,
      insertText,
      undefined,
      command
    );
  }
}

module.exports = {
  拼音,
  常量,
  规则,
  扩展,
  模版,
  buildHover,
  buildCompletion,
  buildStaticModels,
};
