module.exports = {
    //···································· 按钮 ····································//
    "技能1": {
        "标签": ["按钮选项"],
        "提示": "绑定技能1的按钮。",
        "图标": "button"
    },

    "技能2": {
        "标签": ["按钮选项"],
        "提示": "绑定技能2的按钮。",
        "图标": "button"
    },

    "蹲下": {
        "标签": ["按钮选项"],
        "提示": "绑定蹲下的按钮。",
        "图标": "button"
    },

    "互动": {
        "标签": ["按钮选项"],
        "提示": "绑定互动的按钮。",
        "图标": "button"
    },

    "跳跃": {
        "标签": ["按钮选项"],
        "提示": "绑定跳跃的按钮。",
        "图标": "button"
    },

    "近身攻击": {
        "标签": ["按钮选项"],
        "提示": "绑定近身攻击的按钮。",
        "图标": "button"
    },

    "主要攻击模式": {
        "标签": ["按钮选项"],
        "提示": "绑定主要攻击模式的按钮。",
        "图标": "left"
    },

    "装填": {
        "标签": ["按钮选项"],
        "提示": "绑定装填的按钮。",
        "图标": "button"
    },

    "辅助攻击模式": {
        "标签": ["按钮选项"],
        "提示": "绑定辅助攻击模式的按钮。",
        "图标": "right"
    },

    "终极技能": {
        "标签": ["按钮选项"],
        "提示": "绑定终极技能的按钮。",
        "图标": "button"
    }
}