module.exports = {
    //···································· 交流 ····································//
    "收到": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "不行": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "抱歉": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "好的": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "感谢": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "撤退": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "推进": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "前进": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "集合": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "再见": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "问候": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "不用谢": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "我上了": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "倒计时": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "敌人来袭": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "需要治疗": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "需要帮助": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "做好准备": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "正在进攻": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "正在防守": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "正在赶来": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "继续攻击": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "我跟着你": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "喷漆上": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "喷漆左": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "喷漆右": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "喷漆下": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "语音（上）": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "语音（左）": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "语音（右）": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "语音（下）": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "表情（上）": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "表情（左）": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "表情（右）": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "表情（下）": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    },

    "终极技能状态": {
        "标签": ["交流选项"],
        "提示": "一个交流选项。"
    }
}