module.exports = {
    //···································· 颜色 ····································//
    "白色": {
        "标签": ["颜色选项"],
        "数值": [255, 255, 255, 255],
        "图标": "white",
        "提示": "一个默认颜色选项。等效自定义颜色(255, 255, 255, 255)。"
    },

    "黄色": {
        "标签": ["颜色选项"],
        "数值": [255, 255, 0, 255],
        "图标": "yellow",
        "提示": "一个默认颜色选项。等效自定义颜色(255, 255, 0, 255)。"
    },

    "绿色": {
        "标签": ["颜色选项"],
        "数值": [69, 255, 87, 255],
        "图标": "green",
        "提示": "一个默认颜色选项。等效自定义颜色(69, 255, 87, 255)。"
    },

    "紫色": {
        "标签": ["颜色选项"],
        "数值": [100, 50, 255, 255],
        "图标": "violet",
        "提示": "一个默认颜色选项。等效自定义颜色(100, 50, 255, 255)。"
    },

    "红色": {
        "标签": ["颜色选项"],
        "数值": [200, 0, 19, 255],
        "图标": "red",
        "提示": "一个默认颜色选项。等效自定义颜色(200, 0, 19, 255)。"
    },

    "蓝色": {
        "标签": ["颜色选项"],
        "数值": [39, 170, 255, 255],
        "图标": "blue",
        "提示": "一个默认颜色选项。等效自定义颜色(39, 170, 255, 255)。"
    },

    "队伍1": {
        "标签": ["颜色选项", "队伍颜色选项"],
        "数值": [39, 170, 255, 255],
        "图标": "team1",
        "提示": "一个队伍颜色选项, 默认为蓝色。等效自定义颜色(39, 170, 255, 255)。"
    },

    "队伍2": {
        "标签": ["颜色选项", "队伍颜色选项"],
        "数值": [200, 0, 19, 255],
        "图标": "team2",
        "提示": "一个队伍颜色选项, 默认为红色。等效自定义颜色(200, 0, 19, 255)。"
    },

    "水绿色": {
        "标签": ["颜色选项"],
        "数值": [0, 234, 234, 255],
        "图标": "aqua",
        "提示": "一个默认颜色选项。等效自定义颜色(0, 234, 234, 255)。"
    },

    "橙色": {
        "标签": ["颜色选项"],
        "数值": [236, 153, 0, 255],
        "图标": "orange",
        "提示": "一个默认颜色选项。等效自定义颜色(236, 153, 0, 255)。"
    },

    "天蓝色": {
        "标签": ["颜色选项"],
        "数值": [108, 190, 244, 255],
        "图标": "sky_blue",
        "提示": "一个默认颜色选项。等效自定义颜色(108, 190, 244, 255)。"
    },

    "青绿色": {
        "标签": ["颜色选项"],
        "数值": [0, 230, 151, 255],
        "图标": "turquoise",
        "提示": "一个默认颜色选项。等效自定义颜色(0, 230, 151, 255)。"
    },

    "灰绿色": {
        "标签": ["颜色选项"],
        "数值": [160, 232, 27, 255],
        "图标": "lime_green",
        "提示": "一个默认颜色选项。等效自定义颜色(160, 232, 27, 255)。"
    },

    "亮紫色": {
        "标签": ["颜色选项"],
        "数值": [161, 73, 197, 255],
        "图标": "purple",
        "提示": "一个默认颜色选项。等效自定义颜色(161, 73, 197, 255)。"
    },

    "黑色": {
        "标签": ["颜色选项"],
        "数值": [0, 0, 0, 255],
        "图标": "black",
        "提示": "一个默认颜色选项。等效自定义颜色(0, 0, 0, 255)。"
    },

    "玫红": {
        "标签": ["颜色选项"],
        "数值": [255, 50, 145, 255],
        "图标": "rose",
        "提示": "一个默认颜色选项。等效自定义颜色(255, 50, 145, 255)。"
    },

    "灰色": {
        "标签": ["颜色选项"],
        "数值": [127, 127, 127, 255],
        "图标": "gray",
        "提示": "一个默认颜色选项。等效自定义颜色(127, 127, 127, 255)。"
    }
}