module.exports = {
    //···································· 英雄数据 ····································//
    "所有造成伤害量": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "对屏障造成伤害量": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "阻挡伤害量": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "承受伤害量": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "阵亡": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "消灭": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "地形阵亡": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "地形消灭": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "协助防守": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "协助进攻": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "最后一击": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "对英雄造成伤害量": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "治疗量": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "最佳瞬间消灭": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "瞬间消灭": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "目标攻防消灭": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "单独消灭": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "获得终极技能": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "使用终极技能": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "武器命中率": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "暴击命中率": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "暴击": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "受到治疗量": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "开镜命中率": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "开镜暴击率": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "开镜暴击消灭": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "开镜暴击": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "开镜命中": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "开镜射击": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "自我治疗量": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "射击次数": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "射击命中": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    },

    "射击未命中": {
        "标签": ["英雄数据选项"],
        "提示": "一个英雄数据选项。"
    }
}