module.exports = {
    //···································· 基础播放效果 ····································//
    "有益爆炸": {
        "标签": ["播放效果选项", "基础效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "有害爆炸": {
        "标签": ["播放效果选项", "基础效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "环状爆炸": {
        "标签": ["播放效果选项", "基础效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "有益选择效果": {
        "标签": ["播放效果选项", "基础效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "有害选择效果": {
        "标签": ["播放效果选项", "基础效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    //···································· 基础播放声音 ····································//
    "正面状态施加声音": {
        "标签": ["播放效果选项", "基础爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "负面状态施加声音": {
        "标签": ["播放效果选项", "基础爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "状态爆炸声音": {
        "标签": ["播放效果选项", "基础爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "环状爆炸声音": {
        "标签": ["播放效果选项", "基础爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "爆炸声音": {
        "标签": ["播放效果选项", "基础爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    //···································· 扩展减益状态播放效果 ····································//
    "卡西迪闪光弹击晕效果": {
        "标签": ["播放效果选项", "扩展减益状态效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“黑影”黑客入侵完成开始效果": {
        "标签": ["播放效果选项", "扩展减益状态效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

     //···································· 扩展增益状态播放效果 ····································//
     "治疗目标激活效果": {
        "标签": ["播放效果选项", "扩展增益状态效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“黑影”位移传动材料效果": {
        "标签": ["播放效果选项", "扩展增益状态效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

     //···································· 扩展增益效果和减益播放效果声音 ····································//
     "安娜生物手雷增疗声音": {
        "标签": ["播放效果选项", "扩展增益效果和减益效果声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "安娜生物手雷禁疗声音": {
        "标签": ["播放效果选项", "扩展增益效果和减益效果声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "安娜麻醉镖声音": {
        "标签": ["播放效果选项", "扩展增益效果和减益效果声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“死神”幽灵形态声音": {
        "标签": ["播放效果选项", "扩展增益效果和减益效果声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“黑影”位移传动声音": {
        "标签": ["播放效果选项", "扩展增益效果和减益效果声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“士兵：76”疾跑开始声音": {
        "标签": ["播放效果选项", "扩展增益效果和减益效果声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    //···································· 扩展爆炸声音 ····································//
    "安娜生物手雷爆炸声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "艾什延时雷管爆炸声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "巴蒂斯特生化榴弹枪爆炸声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“堡垒”坦克炮爆炸声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "布丽吉塔流星飞锤范围治疗声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "布丽吉塔恢复包击中声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "布丽吉塔恢复包护甲声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "D.Va微型飞弹爆炸声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "D.Va自毁爆炸声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“末日铁拳”上勾重拳跳跃声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“末日铁拳”上勾重拳击中声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“末日铁拳”毁天灭地击中声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“回声”黏性炸弹爆炸声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“狂鼠”榴弹发射器爆炸声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“狂鼠”震荡地雷爆炸声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“狂鼠”炸弹轮胎爆炸声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "半藏音初始脉冲声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "卢西奥音障施放声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "卡西迪闪光弹爆炸声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "莫伊拉消散消失声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "莫伊拉消散重现声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "奥丽莎站住别动内爆声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“法老之鹰”火箭发射器爆炸声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“法老之鹰”震荡冲击声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“法老之鹰”火箭弹幕爆炸声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "莱因哈特烈焰打击目标击中声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“西格玛”超能之球内爆声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“西格玛”质量吸附击中声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“黑影”标志声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“黑影”位移传动消失声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“黑影”位移传动重现声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“黑影”电磁脉冲爆炸声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“秩序之光”传送面板重现声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“猎空”闪回消失声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“猎空”闪回重现声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“黑百合”剧毒诡雷爆炸声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "温斯顿喷射背包着陆声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“破坏球”重力坠击击中声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“破坏球”地雷禁区爆炸声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "查莉娅粒子炮爆炸声音": {
        "标签": ["播放效果选项", "扩展爆炸声音选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    //···································· 扩展能量爆炸效果 ····································//
    "布丽吉塔恢复包击中效果": {
        "标签": ["播放效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "布丽吉塔恢复包护甲效果": {
        "标签": ["播放效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "布丽吉塔流星飞锤范围治疗效果": {
        "标签": ["播放效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "D.Va微型飞弹爆炸效果": {
        "标签": ["播放效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "D.Va自毁爆炸效果": {
        "标签": ["播放效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“回声”黏性炸弹爆炸效果": {
        "标签": ["播放效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "半藏音初始脉冲效果": {
        "标签": ["播放效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "卢西奥音障施放效果": {
        "标签": ["播放效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "莫伊拉消散消失效果": {
        "标签": ["播放效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "莫伊拉消散重现效果": {
        "标签": ["播放效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "奥丽莎站住别动内爆效果": {
        "标签": ["播放效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“西格玛”超能之球内爆效果": {
        "标签": ["播放效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“黑影”标志效果": {
        "标签": ["播放效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“黑影”位移传动消失效果": {
        "标签": ["播放效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“黑影”位移传动重现效果": {
        "标签": ["播放效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“黑影”电磁脉冲爆炸效果": {
        "标签": ["播放效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“秩序之光”传送面板重现效果": {
        "标签": ["播放效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“猎空”闪回消失效果": {
        "标签": ["播放效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“猎空“闪回重现效果": {
        "标签": ["播放效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "查莉娅粒子炮爆炸效果": {
        "标签": ["播放效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    //···································· 扩展运动爆炸效果 ····································//
    "安娜生物手雷爆炸效果": {
        "标签": ["播放效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "艾什延时雷管爆炸效果": {
        "标签": ["播放效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "巴蒂斯特生化榴弹枪爆炸效果": {
        "标签": ["播放效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“堡垒”坦克炮爆炸效果": {
        "标签": ["播放效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“末日铁拳”上勾重拳跳跃效果": {
        "标签": ["播放效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“末日铁拳”上勾重拳击中效果": {
        "标签": ["播放效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“末日铁拳”毁天灭地击中效果": {
        "标签": ["播放效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“狂鼠”榴弹发射器爆炸效果": {
        "标签": ["播放效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“狂鼠”震荡地雷爆炸效果": {
        "标签": ["播放效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“狂鼠”炸弹轮胎爆炸效果": {
        "标签": ["播放效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "卡西迪闪光弹爆炸效果": {
        "标签": ["播放效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“法老之鹰”火箭发射器爆炸效果": {
        "标签": ["播放效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“法老之鹰”震荡冲击效果": {
        "标签": ["播放效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“法老之鹰”火箭弹幕爆炸效果": {
        "标签": ["播放效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "莱因哈特烈焰打击目标击中效果": {
        "标签": ["播放效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“西格玛”质量吸附击中效果": {
        "标签": ["播放效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“黑百合“剧毒诡雷爆炸效果": {
        "标签": ["播放效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "温斯顿喷射背包着陆效果": {
        "标签": ["播放效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“破坏球”重力坠击击中效果": {
        "标签": ["播放效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    },

    "“破坏球”地雷禁区爆炸效果": {
        "标签": ["播放效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个播放效果选项。",
        "图标": ""
    }
}