module.exports = {
    //···································· 基础光束效果 ····································//
    "有益光束": {
        "标签": ["光束效果选项", "基础效果选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "有害光束": {
        "标签": ["光束效果选项", "基础效果选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "抓钩光束": {
        "标签": ["光束效果选项", "基础效果选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    //···································· 扩展光束效果 ····································//
    "布丽吉塔连枷链光束": {
        "标签": ["光束效果选项", "扩展光束效果选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "“回声”聚焦光线光束": {
        "标签": ["光束效果选项", "扩展光束效果选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "“狂鼠”陷阱链光束": {
        "标签": ["光束效果选项", "扩展光束效果选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "“天使”治疗光束": {
        "标签": ["光束效果选项", "扩展光束效果选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "“天使”强化光束": {
        "标签": ["光束效果选项", "扩展光束效果选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "莫伊拉生化之球治疗光束": {
        "标签": ["光束效果选项", "扩展光束效果选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "莫伊拉生化之球伤害光束": {
        "标签": ["光束效果选项", "扩展光束效果选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "莫伊拉生化之触连接光束": {
        "标签": ["光束效果选项", "扩展光束效果选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "莫伊拉聚合射线光束": {
        "标签": ["光束效果选项", "扩展光束效果选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "奥丽莎站住别动连线光束": {
        "标签": ["光束效果选项", "扩展光束效果选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "奥丽莎强化光束": {
        "标签": ["光束效果选项", "扩展光束效果选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "“秩序之光”光子发射器光束": {
        "标签": ["光束效果选项", "扩展光束效果选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "“秩序之光”哨戒炮光束": {
        "标签": ["光束效果选项", "扩展光束效果选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "托比昂炮台视线光束": {
        "标签": ["光束效果选项", "扩展光束效果选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "温斯顿特斯拉炮光束": {
        "标签": ["光束效果选项", "扩展光束效果选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "查莉娅粒子光束": {
        "标签": ["光束效果选项", "扩展光束效果选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "智械切割者光束": {
        "标签": ["光束效果选项", "扩展光束效果选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    //···································· 扩展光束声音 ····································//
    "“回声”聚焦光线光束声音": {
        "标签": ["光束效果选项", "扩展光束声音选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "“狂鼠”陷阱链声音": {
        "标签": ["光束效果选项", "扩展光束声音选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "“天使”治疗光束声音": {
        "标签": ["光束效果选项", "扩展光束声音选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "“天使”强化光束声音": {
        "标签": ["光束效果选项", "扩展光束声音选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "莫伊拉生化之触连接声音": {
        "标签": ["光束效果选项", "扩展光束声音选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "莫伊拉生化之球伤害声音": {
        "标签": ["光束效果选项", "扩展光束声音选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "莫伊拉生化之球治疗声音": {
        "标签": ["光束效果选项", "扩展光束声音选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "莫伊拉聚合射线声音": {
        "标签": ["光束效果选项", "扩展光束声音选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "奥丽莎强化声音": {
        "标签": ["光束效果选项", "扩展光束声音选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "奥丽莎站住别动连线声音": {
        "标签": ["光束效果选项", "扩展光束声音选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "“秩序之光”光子发射器声音": {
        "标签": ["光束效果选项", "扩展光束声音选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "温斯顿特斯拉炮声音": {
        "标签": ["光束效果选项", "扩展光束声音选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "查莉娅粒子炮爆炸声音": {
        "标签": ["光束效果选项", "扩展光束声音选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    },

    "智械切割者光束声音": {
        "标签": ["光束效果选项", "扩展光束声音选项"],
        "提示": "一个光束效果选项。",
        "图标": ""
    }
}