module.exports = {
    //···································· 基础效果 ····································//
    "球体": {
        "标签": ["效果选项", "基础效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "光柱": {
        "标签": ["效果选项", "基础效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "球": {
        "标签": ["效果选项", "基础效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "环": {
        "标签": ["效果选项", "基础效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "云": {
        "标签": ["效果选项", "基础效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "火花": {
        "标签": ["效果选项", "基础效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "有益光环": {
        "标签": ["效果选项", "基础效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "有害光环": {
        "标签": ["效果选项", "基础效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "能量声音": {
        "标签": ["效果选项", "基础效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "拾取音效": {
        "标签": ["效果选项", "基础效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "有益光环声音": {
        "标签": ["效果选项", "基础效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "负面光环音效": {
        "标签": ["效果选项", "基础效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "火花声音": {
        "标签": ["效果选项", "基础效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "烟雾声音": {
        "标签": ["效果选项", "基础效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "诱饵声音": {
        "标签": ["效果选项", "基础效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "信标声音": {
        "标签": ["效果选项", "基础效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    //···································· 扩展减益状态效果 ····································//
    "安娜生物手雷禁疗效果": {
        "标签": ["效果选项", "扩展减益状态效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "安娜麻醉镖效果": {
        "标签": ["效果选项", "扩展减益状态效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "艾什延时雷管燃烧粒子效果": {
        "标签": ["效果选项", "扩展减益状态效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "艾什延时雷管燃烧材料效果": {
        "标签": ["效果选项", "扩展减益状态效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "卡西迪闪光弹击晕效果": {
        "标签": ["效果选项", "扩展减益状态效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "美冰冻效果": {
        "标签": ["效果选项", "扩展减益状态效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "“西格玛”引力乱流目标效果": {
        "标签": ["效果选项", "扩展减益状态效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "“黑影”黑客入侵完成循环效果": {
        "标签": ["效果选项", "扩展减益状态效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "“黑百合”剧毒诡雷目标效果": {
        "标签": ["效果选项", "扩展减益状态效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "温斯顿特斯拉炮目标效果": {
        "标签": ["效果选项", "扩展减益状态效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "禅雅塔乱目标效果": {
        "标签": ["效果选项", "扩展减益状态效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    //···································· 扩展增益状态效果 ····································//
    "治疗目标效果": {
        "标签": ["效果选项", "扩展增益状态效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "治疗目标激活效果": {
        "标签": ["效果选项", "扩展增益状态效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "安娜生物手雷增疗效果": {
        "标签": ["效果选项", "扩展增益状态效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "安娜纳米激素强化效果": {
        "标签": ["效果选项", "扩展增益状态效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "巴蒂斯特维生力场保护效果": {
        "标签": ["效果选项", "扩展增益状态效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "“回声”复制效果": {
        "标签": ["效果选项", "扩展增益状态效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "卢西奥音障保护效果": {
        "标签": ["效果选项", "扩展增益状态效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "“天使”伤害强化效果": {
        "标签": ["效果选项", "扩展增益状态效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "“死神”幽灵形态效果": {
        "标签": ["效果选项", "扩展增益状态效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "“士兵：76”疾跑效果": {
        "标签": ["效果选项", "扩展增益状态效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "托比昂热力过载效果": {
        "标签": ["效果选项", "扩展增益状态效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "温斯顿原始暴怒效果": {
        "标签": ["效果选项", "扩展增益状态效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "“破坏球”感应护盾目标效果": {
        "标签": ["效果选项", "扩展增益状态效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "“破坏球”重力坠击火焰效果": {
        "标签": ["效果选项", "扩展增益状态效果选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    //···································· 扩展增益效果和减益效果声音 ····································//
    "安娜纳米激素强化声音": {
        "标签": ["效果选项", "扩展增益效果和减益效果声音选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "巴蒂斯特维生力场保护声音": {
        "标签": ["效果选项", "扩展增益效果和减益效果声音选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "“回声”复制声音": {
        "标签": ["效果选项", "扩展增益效果和减益效果声音选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "卢西奥音障保护声音": {
        "标签": ["效果选项", "扩展增益效果和减益效果声音选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "美冰冻声音": {
        "标签": ["效果选项", "扩展增益效果和减益效果声音选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "“天使”伤害强化声音": {
        "标签": ["效果选项", "扩展增益效果和减益效果声音选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "“西格玛”引力乱流目标声音": {
        "标签": ["效果选项", "扩展增益效果和减益效果声音选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "“黑影”黑客入侵进行声音": {
        "标签": ["效果选项", "扩展增益效果和减益效果声音选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "“黑影”黑客入侵完成声音": {
        "标签": ["效果选项", "扩展增益效果和减益效果声音选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "托比昂热力过载声音": {
        "标签": ["效果选项", "扩展增益效果和减益效果声音选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "“黑百合“剧毒诡雷目标声音": {
        "标签": ["效果选项", "扩展增益效果和减益效果声音选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "温斯顿特斯拉炮目标声音": {
        "标签": ["效果选项", "扩展增益效果和减益效果声音选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "温斯顿原始暴怒声音": {
        "标签": ["效果选项", "扩展增益效果和减益效果声音选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "“破坏球”感应护盾目标声音": {
        "标签": ["效果选项", "扩展增益效果和减益效果声音选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "“破坏球”重力坠击火焰声音": {
        "标签": ["效果选项", "扩展增益效果和减益效果声音选项"],
        "提示": "一个效果选项。",
        "图标": ""
    },

    "禅雅塔乱目标声音": {
        "标签": ["效果选项", "扩展增益效果和减益效果声音选项"],
        "提示": "一个效果选项。",
        "图标": ""
    }
}