module.exports = {
    //···································· 图标 ····································//
    "箭头：向下": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "1"
    },

    "箭头：向左": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "2"
    },

    "箭头：向右": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "3"
    },

    "箭头：向上": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "4"
    },

    "星形": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "5"
    },

    "箭矢": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "6"
    },

    "对号": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "7"
    },

    "圆圈": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "8"
    },

    "梅花": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "9"
    },

    "方块": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "10"
    },

    "晕眩": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "11"
    },

    "感叹号": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "12"
    },

    "眼睛": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "13"
    },

    "火焰": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "14"
    },

    "旗帜": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "15"
    },

    "光晕": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "16"
    },

    "高兴": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "17"
    },

    "红桃": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "18"
    },

    "满月": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "19"
    },

    "拒绝": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "20"
    },

    "加号": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "21"
    },

    "剧毒": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "22"
    },

    "剧毒2": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "23"
    },

    "问号": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "24"
    },

    "辐射": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "25"
    },

    "回收": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "26"
    },

    "宽环": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "27"
    },

    "细环": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "28"
    },

    "难过": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "29"
    },

    "骷髅": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "30"
    },

    "黑桃": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "31"
    },

    "螺旋": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "32"
    },

    "停止": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "33"
    },

    "垃圾箱": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "34"
    },

    "警告": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "35"
    },

    "X": {
        "标签": ["图标选项"],
        "提示": "一个用于“创建图标”或“图标字符串”的图标选项。",
        "图标": "36"
    }
}