module.exports = {
    //···································· 模式 ····································//
    "攻防作战": {
        "标签": ["模式选项"],
        "提示": "一个模式选项。"
    },

    "赏金猎手": {
        "标签": ["模式选项"],
        "提示": "一个模式选项。"
    },

    "占领要点": {
        "标签": ["模式选项"],
        "提示": "一个模式选项。"
    },

    "勇夺锦旗": {
        "标签": ["模式选项"],
        "提示": "一个模式选项。"
    },

    "决斗先锋": {
        "标签": ["模式选项"],
        "提示": "一个模式选项。"
    },

    "运载目标": {
        "标签": ["模式选项"],
        "提示": "一个模式选项。"
    },

    "死斗": {
        "标签": ["模式选项"],
        "提示": "一个模式选项。"
    },

    "融冰决斗": {
        "标签": ["模式选项"],
        "提示": "一个模式选项。"
    },

    "攻击护送": {
        "标签": ["模式选项"],
        "提示": "一个模式选项。"
    },

    "怪鼠复仇": {
        "标签": ["模式选项"],
        "提示": "一个模式选项。"
    },

    "雪球攻势": {
        "标签": ["模式选项"],
        "提示": "一个模式选项。"
    },

    "训练靶场": {
        "标签": ["模式选项"],
        "提示": "一个模式选项。"
    },

    "机动推进": {
        "标签": ["模式选项"],
        "提示": "一个模式选项。"
    },

    "突击模式": {
        "标签": ["模式选项"],
        "提示": "一个模式选项。"
    },

    "雪球死斗": {
        "标签": ["模式选项"],
        "提示": "一个模式选项。"
    },

    "团队死斗": {
        "标签": ["模式选项"],
        "提示": "一个模式选项。"
    },

    "雪域狩猎": {
        "标签": ["模式选项"],
        "提示": "一个模式选项。"
    },

    "路霸的小鱿抓抓乐": {
        "标签": ["模式选项"],
        "提示": "一个模式选项。"
    },

    "星际守望：银河救兵": {
        "标签": ["模式选项"],
        "提示": "一个模式选项。"
    }
}