module.exports = {
        //···································· 操作 ····································//
        "加": {
            "标签": ["变量操作选项"],
            "提示": "一个变量操作选项。"
        },
    
        "减": {
            "标签": ["变量操作选项"],
            "提示": "一个变量操作选项。"
        },
    
        "乘": {
            "标签": ["变量操作选项"],
            "提示": "一个变量操作选项。"
        },
    
        "除": {
            "标签": ["变量操作选项"],
            "提示": "一个变量操作选项。"
        },
    
        "最小": {
            "标签": ["变量操作选项"],
            "提示": "一个变量操作选项。"
        },
    
        "最大": {
            "标签": ["变量操作选项"],
            "提示": "一个变量操作选项。"
        },
    
        "根据值从数组中移除": {
            "标签": ["变量操作选项"],
            "提示": "一个变量操作选项。"
        },
    
        "根据索引从数组中移除": {
            "标签": ["变量操作选项"],
            "提示": "一个变量操作选项。"
        },
    
        "添加至数组": {
            "标签": ["变量操作选项"],
            "提示": "一个变量操作选项。"
        },
    
        "余数": {
            "标签": ["变量操作选项"],
            "提示": "一个变量操作选项。"
        },
    
        "乘方": {
            "标签": ["变量操作选项"],
            "提示": "一个变量操作选项。"
        }
}