module.exports = {
    //···································· 基础爆炸效果 ····································//
    "有益爆炸": {
        "标签": ["弹道爆炸效果选项", "基础爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "有害爆炸": {
        "标签": ["弹道爆炸效果选项", "基础爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "环状爆炸": {
        "标签": ["弹道爆炸效果选项", "基础爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    //···································· 扩展能量爆炸效果 ····································//
    "布丽吉塔恢复包击中效果": {
        "标签": ["弹道爆炸效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "布丽吉塔恢复包护甲效果": {
        "标签": ["弹道爆炸效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "布丽吉塔流星飞锤范围治疗效果": {
        "标签": ["弹道爆炸效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "D.Va微型飞弹爆炸效果": {
        "标签": ["弹道爆炸效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "D.Va自毁爆炸效果": {
        "标签": ["弹道爆炸效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "“回声”黏性炸弹爆炸效果": {
        "标签": ["弹道爆炸效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "半藏音初始脉冲效果": {
        "标签": ["弹道爆炸效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "卢西奥音障施放效果": {
        "标签": ["弹道爆炸效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "莫伊拉消散消失效果": {
        "标签": ["弹道爆炸效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "莫伊拉消散重现效果": {
        "标签": ["弹道爆炸效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "奥丽莎站住别动内爆效果": {
        "标签": ["弹道爆炸效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "“西格玛”超能之球内爆效果": {
        "标签": ["弹道爆炸效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "“黑影”标志效果": {
        "标签": ["弹道爆炸效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "“黑影”位移传动消失效果": {
        "标签": ["弹道爆炸效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "“黑影”位移传动重现效果": {
        "标签": ["弹道爆炸效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "“黑影”电磁脉冲爆炸效果": {
        "标签": ["弹道爆炸效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "“秩序之光”传送面板重现效果": {
        "标签": ["弹道爆炸效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "“猎空”闪回消失效果": {
        "标签": ["弹道爆炸效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "“猎空“闪回重现效果": {
        "标签": ["弹道爆炸效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "查莉娅粒子炮爆炸效果": {
        "标签": ["弹道爆炸效果选项", "扩展能量爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    //···································· 扩展运动爆炸效果 ····································//
    "安娜生物手雷爆炸效果": {
        "标签": ["弹道爆炸效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "艾什延时雷管爆炸效果": {
        "标签": ["弹道爆炸效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "巴蒂斯特生化榴弹枪爆炸效果": {
        "标签": ["弹道爆炸效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "“堡垒”坦克炮爆炸效果": {
        "标签": ["弹道爆炸效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "“末日铁拳”上勾重拳跳跃效果": {
        "标签": ["弹道爆炸效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "“末日铁拳”上勾重拳击中效果": {
        "标签": ["弹道爆炸效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "“末日铁拳”毁天灭地击中效果": {
        "标签": ["弹道爆炸效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "“狂鼠”榴弹发射器爆炸效果": {
        "标签": ["弹道爆炸效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "“狂鼠”震荡地雷爆炸效果": {
        "标签": ["弹道爆炸效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "“狂鼠”炸弹轮胎爆炸效果": {
        "标签": ["弹道爆炸效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "卡西迪闪光弹爆炸效果": {
        "标签": ["弹道爆炸效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "“法老之鹰”火箭发射器爆炸效果": {
        "标签": ["弹道爆炸效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "“法老之鹰”震荡冲击效果": {
        "标签": ["弹道爆炸效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "“法老之鹰”火箭弹幕爆炸效果": {
        "标签": ["弹道爆炸效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "莱因哈特烈焰打击目标击中效果": {
        "标签": ["弹道爆炸效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "“西格玛”质量吸附击中效果": {
        "标签": ["弹道爆炸效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "“黑百合“剧毒诡雷爆炸效果": {
        "标签": ["弹道爆炸效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "温斯顿喷射背包着陆效果": {
        "标签": ["弹道爆炸效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "“破坏球”重力坠击击中效果": {
        "标签": ["弹道爆炸效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    },

    "“破坏球”地雷禁区爆炸效果": {
        "标签": ["弹道爆炸效果选项", "扩展运动爆炸效果选项"],
        "提示": "一个弹道爆炸效果选项。",
        "图标": ""
    }
}