module.exports = {
    "球弹道": {
        "标签": ["弹道选项", "基础弹道选项"],
        "提示": "一个弹道选项。",
        "图标": ""
    },

    "巴蒂斯特生化榴弹枪": {
        "标签": ["弹道选项", "扩展弹道选项"],
        "提示": "一个弹道选项。",
        "图标": ""
    },

    "“堡垒”A-36战术榴弹": {
        "标签": ["弹道选项", "扩展弹道选项"],
        "提示": "一个弹道选项。",
        "图标": ""
    },

    "“回声”黏性炸弹": {
        "标签": ["弹道选项", "扩展弹道选项"],
        "提示": "一个弹道选项。",
        "图标": ""
    },

    "源氏“镖”": {
        "标签": ["弹道选项", "扩展弹道选项"],
        "提示": "一个弹道选项。",
        "图标": ""
    },

    "卢西奥音速扩音器": {
        "标签": ["弹道选项", "扩展弹道选项"],
        "提示": "一个弹道选项。",
        "图标": ""
    },

    "美冰锥": {
        "标签": ["弹道选项", "扩展弹道选项"],
        "提示": "一个弹道选项。",
        "图标": ""
    },

    "“天使”天使冲击枪": {
        "标签": ["弹道选项", "扩展弹道选项"],
        "提示": "一个弹道选项。",
        "图标": ""
    },

    "莫伊拉伤害生化之球": {
        "标签": ["弹道选项", "扩展弹道选项"],
        "提示": "一个弹道选项。",
        "图标": ""
    },

    "莫伊拉治疗生化之球": {
        "标签": ["弹道选项", "扩展弹道选项"],
        "提示": "一个弹道选项。",
        "图标": ""
    },

    "奥丽莎聚变驱动器": {
        "标签": ["弹道选项", "扩展弹道选项"],
        "提示": "一个弹道选项。",
        "图标": ""
    },

    "“法老之鹰”火箭": {
        "标签": ["弹道选项", "扩展弹道选项"],
        "提示": "一个弹道选项。",
        "图标": ""
    },

    "莱因哈特烈焰打击": {
        "标签": ["弹道选项", "扩展弹道选项"],
        "提示": "一个弹道选项。",
        "图标": ""
    },

    "“路霸”爆裂枪": {
        "标签": ["弹道选项", "扩展弹道选项"],
        "提示": "一个弹道选项。",
        "图标": ""
    },

    "“路霸”爆裂枪废铁球": {
        "标签": ["弹道选项", "扩展弹道选项"],
        "提示": "一个弹道选项。",
        "图标": ""
    },

    "西格玛超能之球": {
        "标签": ["弹道选项", "扩展弹道选项"],
        "提示": "一个弹道选项。",
        "图标": ""
    },

    "“秩序之光”光子发射器": {
        "标签": ["弹道选项", "扩展弹道选项"],
        "提示": "一个弹道选项。",
        "图标": ""
    },

    "拉玛刹吞噬漩涡能量球": {
        "标签": ["弹道选项", "扩展弹道选项"],
        "提示": "一个弹道选项。",
        "图标": ""
    },

    "查莉娅重力喷涌": {
        "标签": ["弹道选项", "扩展弹道选项"],
        "提示": "一个弹道选项。",
        "图标": ""
    },

    "查莉娅粒子炮": {
        "标签": ["弹道选项", "扩展弹道选项"],
        "提示": "一个弹道选项。",
        "图标": ""
    }
}