module.exports = {
    "爆炸声音": {
        "标签": ["弹道爆炸声音选项", "基础爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "状态爆炸声音": {
        "标签": ["弹道爆炸声音选项", "基础爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "环状爆炸声音": {
        "标签": ["弹道爆炸声音选项", "基础爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "安娜生物手雷爆炸声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "艾什延时雷管爆炸声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "巴蒂斯特生化榴弹枪爆炸声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "“堡垒”坦克炮爆炸声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "布丽吉塔流星飞锤范围治疗声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "布丽吉塔恢复包击中声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "布丽吉塔恢复包护甲声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "D.Va微型飞弹爆炸声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "D.Va自毁爆炸声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "“末日铁拳”上勾重拳跳跃声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "“末日铁拳”上勾重拳击中声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "“末日铁拳”毁天灭地击中声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "“回声”黏性炸弹爆炸声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "“狂鼠”榴弹发射器爆炸声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "“狂鼠”震荡地雷爆炸声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "“狂鼠”炸弹轮胎爆炸声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "半藏音初始脉冲声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "卢西奥音障施放声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "卡西迪闪光弹爆炸声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "莫伊拉消散消失声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "莫伊拉消散重现声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "奥丽莎站住别动内爆声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "“法老之鹰”火箭发射器爆炸声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "“法老之鹰”震荡冲击声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "“法老之鹰”火箭弹幕爆炸声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "莱因哈特烈焰打击目标击中声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "“西格玛”超能之球内爆声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "“西格玛”质量吸附击中声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "“黑影”标志声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "“黑影”位移传动消失声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "“黑影”位移传动重现声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "“黑影”电磁脉冲爆炸声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "“秩序之光”传送面板重现声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "“猎空”闪回消失声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "“猎空”闪回重现声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "“黑百合”剧毒诡雷爆炸声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "温斯顿喷射背包着陆声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "“破坏球”重力坠击击中声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "“破坏球”地雷禁区爆炸声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },

    "查莉娅粒子炮爆炸声音": {
        "标签": ["弹道爆炸声音选项", "扩展爆炸声音选项"],
        "提示": "一个弹道爆炸声音选项。",
        "图标": ""
    },
}