module.exports = {
    //···································· 效果 ····································//
    "无": {
        "标签": ["效果刷新选项"],
        "提示": "一个仅用于“创建效果”或“创建光束效果”的刷新选项。"
    },

    "可见": {
        "标签": ["效果刷新选项"],
        "提示": "一个仅用于“创建效果”或“创建光束效果”的刷新选项。"
    },

    "颜色": {
        "标签": ["效果刷新选项"],
        "提示": "一个仅用于“创建效果”或“创建光束效果”的刷新选项。"
    },

    "可见和颜色": {
        "标签": ["效果刷新选项"],
        "提示": "一个仅用于“创建效果”或“创建光束效果”的刷新选项。"
    },

    "位置和半径": {
        "标签": ["效果刷新选项"],
        "提示": "一个仅用于“创建效果”或“创建光束效果”的刷新选项。"
    },

    "位置，半径和颜色": {
        "标签": ["效果刷新选项"],
        "提示": "一个仅用于“创建效果”或“创建光束效果”的刷新选项。"
    },

    "可见，位置和半径": {
        "标签": ["效果刷新选项"],
        "提示": "一个仅用于“创建效果”或“创建光束效果”的刷新选项。"
    },

    "可见，位置，半径和颜色": {
        "标签": ["效果刷新选项"],
        "提示": "一个仅用于“创建效果”或“创建光束效果”的刷新选项。"
    }
}