module.exports = {
    //···································· 进度条 ····································//
    "无": {
        "标签": ["HUD进度条刷新选项"],
        "提示": "一个仅用于“创建进度条HUD文本”的刷新选项。"
    },

    "可见": {
        "标签": ["HUD进度条刷新选项"],
        "提示": "一个仅用于“创建进度条HUD文本”的刷新选项。"
    },

    "颜色": {
        "标签": ["HUD进度条刷新选项"],
        "提示": "一个仅用于“创建进度条HUD文本”的刷新选项。"
    },

    "可见和颜色": {
        "标签": ["HUD进度条刷新选项"],
        "提示": "一个仅用于“创建进度条HUD文本”的刷新选项。"
    },

    "值": {
        "标签": ["HUD进度条刷新选项"],
        "提示": "一个仅用于“创建进度条HUD文本”的刷新选项。"
    },

    "值和颜色": {
        "标签": ["HUD进度条刷新选项"],
        "提示": "一个仅用于“创建进度条HUD文本”的刷新选项。"
    },

    "可见和值": {
        "标签": ["HUD进度条刷新选项"],
        "提示": "一个仅用于“创建进度条HUD文本”的刷新选项。"
    },

    "可见，值和颜色": {
        "标签": ["HUD进度条刷新选项"],
        "提示": "一个仅用于“创建进度条HUD文本”的刷新选项。"
    }
}