module.exports = {
    //···································· 地图进度条 ····································//
    "无": {
        "标签": ["地图进度条刷新选项"],
        "提示": "一个仅用于“创建进度条地图文本”的刷新选项。"
    },

    "可见": {
        "标签": ["地图进度条刷新选项"],
        "提示": "一个仅用于“创建进度条地图文本”的刷新选项。"
    },

    "颜色": {
        "标签": ["地图进度条刷新选项"],
        "提示": "一个仅用于“创建进度条地图文本”的刷新选项。"
    },

    "可见和颜色": {
        "标签": ["地图进度条刷新选项"],
        "提示": "一个仅用于“创建进度条地图文本”的刷新选项。"
    },

    "值": {
        "标签": ["地图进度条刷新选项"],
        "提示": "一个仅用于“创建进度条地图文本”的刷新选项。"
    },

    "值和颜色": {
        "标签": ["地图进度条刷新选项"],
        "提示": "一个仅用于“创建进度条地图文本”的刷新选项。"
    },

    "可见和值": {
        "标签": ["地图进度条刷新选项"],
        "提示": "一个仅用于“创建进度条地图文本”的刷新选项。"
    },

    "可见，值和颜色": {
        "标签": ["地图进度条刷新选项"],
        "提示": "一个仅用于“创建进度条地图文本”的刷新选项。"
    },

    "可见和位置": {
        "标签": ["地图进度条刷新选项"],
        "提示": "一个仅用于“创建进度条地图文本”的刷新选项。"
    },

    "可见，位置和颜色": {
        "标签": ["地图进度条刷新选项"],
        "提示": "一个仅用于“创建进度条地图文本”的刷新选项。"
    },

    "位置": {
        "标签": ["地图进度条刷新选项"],
        "提示": "一个仅用于“创建进度条地图文本”的刷新选项。"
    },

    "位置和颜色": {
        "标签": ["地图进度条刷新选项"],
        "提示": "一个仅用于“创建进度条地图文本”的刷新选项。"
    },

    "位置和值": {
        "标签": ["地图进度条刷新选项"],
        "提示": "一个仅用于“创建进度条地图文本”的刷新选项。"
    },

    "位置，值和颜色": {
        "标签": ["地图进度条刷新选项"],
        "提示": "一个仅用于“创建进度条地图文本”的刷新选项。"
    },

    "可见，位置和值": {
        "标签": ["地图进度条刷新选项"],
        "提示": "一个仅用于“创建进度条地图文本”的刷新选项。"
    },

    "可见，位置，值和颜色": {
        "标签": ["地图进度条刷新选项"],
        "提示": "一个仅用于“创建进度条地图文本”的刷新选项。"
    }
}