module.exports = {
    //···································· HUD文本 ····································//
    "无": {
        "标签": ["HUD文本刷新选项"],
        "提示": "一个仅用于“创建HUD文本”的刷新选项。"
    },

    "可见": {
        "标签": ["HUD文本刷新选项"],
        "提示": "一个仅用于“创建HUD文本”的刷新选项。"
    },

    "颜色": {
        "标签": ["HUD文本刷新选项"],
        "提示": "一个仅用于“创建HUD文本”的刷新选项。"
    },

    "可见和颜色": {
        "标签": ["HUD文本刷新选项"],
        "提示": "一个仅用于“创建HUD文本”的刷新选项。"
    },

    "字符串": {
        "标签": ["HUD文本刷新选项"],
        "提示": "一个仅用于“创建HUD文本”的刷新选项。"
    },

    "字符串和颜色": {
        "标签": ["HUD文本刷新选项"],
        "提示": "一个仅用于“创建HUD文本”的刷新选项。"
    },

    "可见和字符串": {
        "标签": ["HUD文本刷新选项"],
        "提示": "一个仅用于“创建HUD文本”的刷新选项。"
    },

    "可见，字符串和颜色": {
        "标签": ["HUD文本刷新选项"],
        "提示": "一个仅用于“创建HUD文本”的刷新选项。"
    },

    "可见性和排序": {
        "标签": ["HUD文本刷新选项"],
        "提示": "一个仅用于“创建HUD文本”的刷新选项。"
    },

    "可见，排序规则和颜色": {
        "标签": ["HUD文本刷新选项"],
        "提示": "一个仅用于“创建HUD文本”的刷新选项。"
    },

    "可见性，排序规则和字符串": {
        "标签": ["HUD文本刷新选项"],
        "提示": "一个仅用于“创建HUD文本”的刷新选项。"
    },

    "可见，排序规则，字符串和颜色": {
        "标签": ["HUD文本刷新选项"],
        "提示": "一个仅用于“创建HUD文本”的刷新选项。"
    },

    "排序": {
        "标签": ["HUD文本刷新选项"],
        "提示": "一个仅用于“创建HUD文本”的刷新选项。"
    },

    "排序规则和颜色": {
        "标签": ["HUD文本刷新选项"],
        "提示": "一个仅用于“创建HUD文本”的刷新选项。"
    },

    "排序规则和字符串": {
        "标签": ["HUD文本刷新选项"],
        "提示": "一个仅用于“创建HUD文本”的刷新选项。"
    },

    "排序规则，字符串和颜色": {
        "标签": ["HUD文本刷新选项"],
        "提示": "一个仅用于“创建HUD文本”的刷新选项。"
    }
}