module.exports = {
    //···································· 图标 ····································//
    "无": {
        "标签": ["图标刷新选项"],
        "提示": "一个地图刷新选项。"
    },

    "可见": {
        "标签": ["图标刷新选项"],
        "提示": "一个地图刷新选项。"
    },

    "颜色": {
        "标签": ["图标刷新选项"],
        "提示": "一个地图刷新选项。"
    },

    "可见和颜色": {
        "标签": ["图标刷新选项"],
        "提示": "一个地图刷新选项。"
    },

    "可见和位置": {
        "标签": ["图标刷新选项"],
        "提示": "一个地图刷新选项。"
    },

    "可见，位置和颜色": {
        "标签": ["图标刷新选项"],
        "提示": "一个地图刷新选项。"
    },

    "位置": {
        "标签": ["图标刷新选项"],
        "提示": "一个地图刷新选项。"
    },

    "位置和颜色": {
        "标签": ["图标刷新选项"],
        "提示": "一个地图刷新选项。"
    }
}