module.exports = {
    //···································· 地图文本 ····································//
    "无": {
        "标签": ["地图文本刷新选项"],
        "提示": "一个仅用于“创建地图文本”的刷新选项。"
    },

    "可见": {
        "标签": ["地图文本刷新选项"],
        "提示": "一个仅用于“创建地图文本”的刷新选项。"
    },

    "颜色": {
        "标签": ["地图文本刷新选项"],
        "提示": "一个仅用于“创建地图文本”的刷新选项。"
    },

    "可见和颜色": {
        "标签": ["地图文本刷新选项"],
        "提示": "一个仅用于“创建地图文本”的刷新选项。"
    },

    "字符串": {
        "标签": ["地图文本刷新选项"],
        "提示": "一个仅用于“创建地图文本”的刷新选项。"
    },

    "字符串和颜色": {
        "标签": ["地图文本刷新选项"],
        "提示": "一个仅用于“创建地图文本”的刷新选项。"
    },

    "可见和字符串": {
        "标签": ["地图文本刷新选项"],
        "提示": "一个仅用于“创建地图文本”的刷新选项。"
    },

    "可见，字符串和颜色": {
        "标签": ["地图文本刷新选项"],
        "提示": "一个仅用于“创建地图文本”的刷新选项。"
    },

    "可见和位置": {
        "标签": ["地图文本刷新选项"],
        "提示": "一个仅用于“创建地图文本”的刷新选项。"
    },

    "可见，位置和颜色": {
        "标签": ["地图文本刷新选项"],
        "提示": "一个仅用于“创建地图文本”的刷新选项。"
    },

    "可见，位置和字符串": {
        "标签": ["地图文本刷新选项"],
        "提示": "一个仅用于“创建地图文本”的刷新选项。"
    },

    "可见，位置，字符串和颜色": {
        "标签": ["地图文本刷新选项"],
        "提示": "一个仅用于“创建地图文本”的刷新选项。"
    }
}