module.exports = {
    "无": {
        "标签": ["友善刷新选项"],
        "提示": "一个友善刷新选项。"
    },

    "可见": {
        "标签": ["友善刷新选项"],
        "提示": "一个友善刷新选项。"
    },

    "友善": {
        "标签": ["友善刷新选项"],
        "提示": "一个友善刷新选项。"
    },

    "可见，友善": {
        "标签": ["友善刷新选项"],
        "提示": "一个友善刷新选项。"
    },

    "位置，方向和大小": {
        "标签": ["友善刷新选项"],
        "提示": "一个友善刷新选项。"
    },

    "友善，位置，方向和大小": {
        "标签": ["友善刷新选项"],
        "提示": "一个友善刷新选项。"
    },

    "可见，友善，位置，方向和大小": {
        "标签": ["友善刷新选项"],
        "提示": "一个友善刷新选项。"
    }
}
