module.exports = {
    //···································· 状态 ····································//
    "沉睡": {
        "标签": ["玩家状态选项"],
        "提示": "一种玩家状态选项。"
    },

    "点燃": {
        "标签": ["玩家状态选项"],
        "提示": "一种玩家状态选项。"
    },

    "冰冻": {
        "标签": ["玩家状态选项"],
        "提示": "一种玩家状态选项。"
    },

    "被入侵": {
        "标签": ["玩家状态选项"],
        "提示": "一种玩家状态选项。"
    },

    "无敌": {
        "标签": ["玩家状态选项"],
        "提示": "一种玩家状态选项。"
    },

    "击倒": {
        "标签": ["玩家状态选项"],
        "提示": "一种玩家状态选项。"
    },

    "相移": {
        "标签": ["玩家状态选项"],
        "提示": "一种玩家状态选项。"
    },

    "定身": {
        "标签": ["玩家状态选项"],
        "提示": "一种玩家状态选项。"
    },

    "击晕": {
        "标签": ["玩家状态选项"],
        "提示": "一种玩家状态选项。"
    },

    "无法杀死": {
        "标签": ["玩家状态选项"],
        "提示": "一种玩家状态选项。"
    }
}