module.exports = {
    //···································· 条件 ····································//
    "X方向分量": {
        "参数": {
            "值": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "要获取X方向分量的矢量。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "方向"],
        "提示": "指定矢量在X方向上的分量，通常代表向左的量。"
    },

    "Y方向分量": {
        "参数": {
            "值": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "要获取Y方向分量的矢量。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "方向"],
        "提示": "指定矢量在Y方向上的分量，通常代表向上的量。"
    },

    "Z方向分量": {
        "参数": {
            "值": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "要获取Z方向分量的矢量。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "方向"],
        "提示": "指定矢量在Z方向上的分量，通常代表向前的量。"
    },

    "上": {
        "返回": ["矢量"],
        "标签": ["条件", "方向"],
        "提示": "方向性矢量 (0, 1, 0) 的简写，此矢量指向上方。"
    },

    "上一个伤害调整ID": {
        "返回": ["实体"],
        "标签": ["条件", "ID"],
        "提示": "此ID值代表最后一个事件玩家(或全局)所执行的“开始伤害调整”动作。"
    },

    "上一个助攻ID": {
        "返回": ["实体"],
        "标签": ["条件", "ID"],
        "提示": "此ID值代表最后一个时间玩家（或全局）所执行的“开始助攻”动作。"
    },

    "上一个持续伤害效果ID": {
        "返回": ["实体"],
        "标签": ["条件", "ID"],
        "提示": "此ID值代表最后一个事件玩家（或全局）所执行的”持续伤害“动作。"
    },

    "上一个持续治疗效果ID": {
        "返回": ["实体"],
        "标签": ["条件", "ID"],
        "提示": "此ID值代表最后一个事件玩家（或全局）所执行的”持续治疗“动作。"
    },

    "上一个文本ID": {
        "返回": ["实体"],
        "标签": ["条件", "ID"],
        "提示": "代表由事件玩家创建的（或由全局创建的）通过“创建HUD文本”、“创建地图文本”、“创建进度条HUD文本”或“创建进度条地图文本”动作所创建的最后一段文本。"
    },

    "上一个治疗调整ID": {
        "返回": ["实体"],
        "标签": ["条件", "ID"],
        "提示": "此ID值代表最后一个事件玩家（或全局）所执行的”开始治疗调整“动作。"
    },

    "下": {
        "返回": ["矢量"],
        "标签": ["条件", "方向"],
        "提示": "方向性矢量 (0, -1 ,0) 的简写，此矢量指向下方。"
    },

    "与此方向的垂直角度": {
        "参数": {
            "方向": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "对此方向矢量获取水平角度，单位为度。此矢量在计算开始前进行统一化。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "角度"],
        "提示": "与指定方向矢量的垂直夹角，单位为度。"
    },

    "与此方向的水平角度": {
        "参数": {
            "方向": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "对此方向矢量获取垂直角度，单位为度。此矢量在计算开始前进行统一化。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "角度"],
        "提示": "与指定方向矢量的水平夹角，单位为度。"
    },

    "与此角度的相对方向": {
        "参数": {
            "水平角度": {
                "类型": "条件",
                "默认": "0",
                "提示": "用于构建结果矢量的水平角度，单位为度。"
            },
            "垂直角度": {
                "类型": "条件",
                "默认": "0",
                "提示": "用于构建结果矢量的垂直角度，单位为度。"
            }
        },
        "返回": ["矢量"],
        "标签": ["条件", "方向"],
        "提示": "指向指定角度的单位长度矢量。"
    },

    "主机玩家": {
        "返回": ["实体"],
        "标签": ["条件", "主机"],
        "提示": "当前自定游戏的主机玩家。如果当前的主机玩家离开了比赛，该值会改变。"
    },

    "事件为急救包": {
        "返回": ["布尔"],
        "标签": ["条件", "事件"],
        "提示": "此规则正在处理的事件中的治疗是否来自于急救包。"
    },

    "事件为环境事件": {
        "返回": ["布尔"],
        "标签": ["条件", "事件"],
        "提示": "此规则正在处理的事件中的消灭是否是由环境引起的。"
    },

    "事件伤害": {
        "返回": ["数字"],
        "标签": ["条件", "事件"],
        "提示": "此规则所处理的事件中被攻击者受到的伤害数值。"
    },

    "事件技能": {
        "返回": ["按钮"],
        "标签": ["条件", "事件"],
        "提示": "此规则当前处理的事件中的技能所对应的按键。"
    },

    "事件方向": {
        "返回": ["矢量"],
        "标签": ["条件"],
        "提示": "此规则当前处理的事件来自哪个方向。"
    },

    "事件暴击": {
        "返回": ["布尔"],
        "标签": ["条件", "事件"],
        "提示": "此规则处理的伤害是否为暴击（如爆头伤害）。"
    },

    "事件治疗": {
        "返回": ["数字"],
        "标签": ["条件", "事件"],
        "提示": "此规则所处理的事件中被治疗者受到的治疗数值。"
    },

    "事件玩家": {
        "返回": ["实体"],
        "标签": ["条件", "事件"],
        "提示": "正在执行此规则的玩家，由事件指定。可能与攻击者或被攻击者为同一人。"
    },

    "全局": {
        "返回": ["全局"],
        "标签": ["条件", "全局"],
        "提示": "一个全局变量的当前值，全局变量即属于游戏本身的变量。"
    },

    "队伍1": {
        "标签": ["条件", "队伍"],
        "提示": "表示默认颜色为蓝的队伍。"
    },

    "队伍2": {
        "标签": ["条件", "队伍"],
        "提示": "表示默认颜色为红的队伍。"
    },

    "所有队伍": {
        "标签": ["条件", "队伍"],
        "提示": "表示两支队伍或非团队模式（例如“死斗”）的所有玩家。"
    },

    "从数组中移除": {
        "参数": {
            "数组": {
                "类型": "条件",
                "默认": "数组()",
                "提示": "从此数列中移除值。"
            },
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": "要从数列中移除的值（如果能找到）。如果值本身是一个数列，则所有匹配的元素都将被移除。"
            }
        },
        "返回": ["数组"],
        "标签": ["条件", "数组"],
        "提示": "一个数组的复制，移除一个或更多的值（如果能找到）。"
    },

    "以弧度为单位的反余弦值": {
        "参数": {
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": "为函数输入值。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "数学运算"],
        "提示": "指定值的反余弦值，以弧度为单位。"
    },

    "以弧度为单位的反正切值": {
        "参数": {
            "分子": {
                "类型": "条件",
                "默认": "0",
                "提示": "为函数输入分子。"
            },
            "分母": {
                "类型": "条件",
                "默认": "0",
                "提示": "为函数输入分母。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "数学运算"],
        "提示": "指定分子及分母的反正切值（通常称为Atan2），以弧度为单位。"
    },

    "以弧度为单位的反正弦值": {
        "参数": {
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": "为函数输入值。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "数学运算"],
        "提示": "指定值的反正弦值，以弧度为单位。"
    },

    "以角度为单位的反余弦值": {
        "参数": {
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": "为函数输入值。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "数学运算"],
        "提示": "指定值的反余弦值，以角度为单位。"
    },

    "以角度为单位的反正切值": {
        "参数": {
            "分子": {
                "类型": "条件",
                "默认": "0",
                "提示": "为函数输入分子。"
            },
            "分母": {
                "类型": "条件",
                "默认": "0",
                "提示": "为函数输入分母。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "数学运算"],
        "提示": "指定分子及分母的反正切值（通常称为Atan2），以角度为单位。"
    },

    "以角度为单位的反正弦值": {
        "参数": {
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": "为函数输入值。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "数学运算"],
        "提示": "指定值的反正弦值，以角度为单位。"
    },

    "伤害调整数量": {
        "返回": ["数字"],
        "标签": ["条件", "数量"],
        "提示": "由“开始伤害调整”动作启动的伤害调整副本的当前数量。"
    },

    "作为进攻队伍": {
        "参数": {
            "队伍": {
                "类型": "条件",
                "默认": "所有队伍",
                "提示": "检查此队伍的职责。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "判断"],
        "提示": "指定队伍是否是进攻方。如果游戏模式不是攻防作战、护送、或攻击"
    },

    "假": {
        "返回": ["布尔"],
        "标签": ["条件", "布尔"],
        "提示": "布尔值，假。"
    },

    "全部英雄": {
        "返回": ["数组"],
        "标签": ["条件", "英雄"],
        "提示": "此数组包括了所有英雄。"
    },

    "具有状态": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家的状态。"
            },
            "状态": {
                "类型": "玩家状态选项",
                "默认": "被入侵",
                "提示": "要检测的状态。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "状态"],
        "提示": "指定玩家是否具有指定状态，无论此状态是通过“设置状态”行为获得的还是除命令以外的游戏机制获得的。"
    },

    "分数": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家的分数。"
            },
        },
        "标签": ["条件", "分数"],
        "提示": "一名玩家当前的得分。如果游戏不是自由混战模式，则结果为0。"
    },

    "前": {
        "返回": ["矢量"],
        "标签": ["条件", "方向"],
        "提示": "方向性矢量 (0, 0, 1) 的简写，此矢量指向前方。"
    },

    "助攻数量": {
        "返回": ["数字"],
        "标签": ["条件", "数量"],
        "提示": "由“开始助攻”动作启动的助攻副本的当前数量。"
    },

    "单次赋值": {
        "参数": {
            "输入值": {
                "类型": "条件",
                "默认": "0",
                "提示": "此值在每个动作或条件中只赋值一次。"
            }
        },
        "返回": ["条件"],
        "标签": ["条件", "赋值"],
        "提示": "结果为通过给定动作或条件提供给“输入值”参数的第一个值（当一个可重新赋值的值与一个动作相关联时，此选项可以用来有选择性地对此值的特定部分不重新赋值）。"
    },

    "占领要点模式占领点解锁": {
        "返回": ["布尔"],
        "标签": ["条件", "判断"],
        "提示": "占领要点模式中占领点是否解锁。"
    },

    "占领要点模式得分百分比": {
        "参数": {
            "队伍": {
                "类型": "条件",
                "默认": "所有队伍",
                "提示": "获取此队伍的得分百分比。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "百分比"],
        "提示": "指定队伍在占领要点模式中的得分百分比。"
    },

    "占领要点模式正在得分的队伍": {
        "返回": ["队伍"],
        "标签": ["条件", "队伍"],
        "提示": "该队伍正在占领要点模式中积累得分百分比。如果双方队伍都没有在积累得分，则结果为“全部”。"
    },

    "取整": {
        "参数": {
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": ""
            },
            "取整方式": {
                "类型": "取整方式选项",
                "默认": "上",
                "提示": "决定此值取整的方式。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "数学运算"],
        "提示": "指定值取整后的值。"
    },

    "受治疗者": {
        "返回": ["实体"],
        "标签": ["条件", "玩家"],
        "提示": "根据此规则处理的事件中受到治疗的玩家。可能与治疗者或事件玩家是同一个人。"
    },

    "可用英雄": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家可用的英雄。"
            }
        },
        "返回": ["数组"],
        "标签": ["条件", "英雄"],
        "提示": "此数组中包括指定玩家当前可以选择的英雄。"
    },

    "右": {
        "返回": ["矢量"],
        "标签": ["条件", "方向"],
        "提示": "方向性矢量 (-1 ,0 ,0) 的简写，此矢量指向右方。"
    },

    "后": {
        "返回": ["矢量"],
        "标签": ["条件", "方向"],
        "提示": "方向性矢量 (0, 0, -1) 的简写，此矢量指向后方。"
    },

    "向量": {
        "参数": {
            "开始位置": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "位移矢量的起点。"
            },
            "结束位置": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "位移矢量的终点。"
            }
        },
        "返回": ["矢量"],
        "标签": ["条件", "方向"],
        "提示": "从一个位置到另一个位置的位移矢量。"
    },

    "团队得分": {
        "参数": {
            "队伍": {
                "类型": "条件",
                "默认": "所有队伍",
                "提示": "获取此队伍的得分。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "分数"],
        "提示": "指定队伍当前的得分。在自由混战模式中结果为0。"
    },

    "图标字符串": {
        "参数": {
            "图标": {
                "类型": "图标选项",
                "默认": "警告",
                "提示": "要显示的图标"
            }
        },
        "返回": ["字符串"],
        "标签": ["条件", "图标"],
        "提示": "可以在字符串中使用图标（每个字符串最多4个图标）。"
    },

    "在地面上": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家是否处于地面上。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "判断"],
        "提示": "玩家是否位于地面上（或可行走的表面上）。"
    },

    "在墙上": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家的滑墙状态。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "判断"],
        "提示": "玩家是否位于墙体上（滑墙或爬墙）。"
    },

    "在夺旗模式中开始绝杀局": {
        "返回": ["布尔"],
        "标签": ["条件", "判断"],
        "提示": "当前勇夺锦旗游戏是否处于绝杀局状态。"
    },

    "在目标点上": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家的目标点状态。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "判断"],
        "提示": "指定玩家是否正在运载目标或占领点上。"
    },

    "在视线内": {
        "参数": {
            "开始位置": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "用于进行视线检测的起点位置。如果此处填入一名玩家, 则使用从此玩家脚部向上2米的位置。"
            },
            "结束位置": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "用于进行视线检测的终点位置。如果此处填入一名玩家, 则使用从此玩家脚部向上2米的位置。"
            },
            "屏障": {
                "类型": "视线屏障选项",
                "默认": "屏障不会阻挡视线",
                "提示": "定义屏障是否影响视线判断。如果要考察屏障是否属于敌方, 则以游戏开始时玩家所在的队伍（如果有的话）为准。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "判断"],
        "提示": "两个位置是否在彼此的视线内。"
    },

    "在视野内": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此名玩家的视野。"
            },
            "坐标": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "检测此坐标是否在视角内。"
            },
            "视角": {
                "类型": "条件",
                "默认": "45",
                "提示": "用于比较的视角, 单位为度。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "判断"],
        "提示": "检测一个坐标是否位于玩家的视角内。"
    },

    "在重生室中": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家的重生室状态。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "判断"],
        "提示": "指定玩家是否正在重生室内（恢复生命值且可更换英雄）。"
    },

    "地图": {
        "参数": {
            "地图": {
                "类型": "地图选项",
                "默认": "66号公路",
                "提示": "一个地图选项。"
            }
        },
        "返回": ["地图"],
        "标签": ["条件", "地图"],
        "提示": "一个地图常量。"
    },

    "地图工坊设置实数": {
        "参数": {
            "类别": {
                "类型": "条件",
                "默认": "自定义字符串(\"\")",
                "提示": "此类别的名字，可以用来找到此设置。"
            },
            "名称": {
                "类型": "条件",
                "默认": "自定义字符串(\"\")",
                "提示": "此设置的名称。"
            },
            "默认": {
                "类型": "数字",
                "默认": "0",
                "提示": "此项设置的默认值。"
            },
            "最小": {
                "类型": "数字",
                "默认": "0",
                "提示": "此设置所允许的最小值"
            },
            "最大": {
                "类型": "数字",
                "默认": "0",
                "提示": "此设置所允许的最大值"
            },
            "排序": {
                "类型": "数字",
                "默认": "0",
                "提示": "此设置与其他同类别设置的排序关系。排序较高的设置会在排序较低的设置之后显示。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "设置"],
        "提示": "提供一个新的实数型设置值，会显示在“地图工坊设置”卡片上作为滑块。"
    },

    "地图工坊设置开关": {
        "参数": {
            "类别": {
                "类型": "条件",
                "默认": "自定义字符串(\"\")",
                "提示": "此类别的名字，可以用来找到此设置。"
            },
            "名称": {
                "类型": "条件",
                "默认": "自定义字符串(\"\")",
                "提示": "此设置的名称。"
            },
            "默认": {
                "类型": "布尔",
                "默认": "真",
                "提示": "此项设置的默认值。"
            },
            "排序": {
                "类型": "数字",
                "默认": "0",
                "提示": "此设置与其他同类别设置的排序关系。排序较高的设置会在排序较低的设置之后显示。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "设置"],
        "提示": "提供一个新的开关设置的值（真或假），会显示在“地图工坊设置”卡片上作为勾选项。"
    },

    "地图工坊设置整数": {
        "参数": {
            "类别": {
                "类型": "条件",
                "默认": "自定义字符串(\"\")",
                "提示": "此类别的名字，可以用来找到此设置。"
            },
            "名称": {
                "类型": "条件",
                "默认": "自定义字符串(\"\")",
                "提示": "此设置的名称。"
            },
            "默认": {
                "类型": "数字",
                "默认": "0",
                "提示": "此项设置的默认值。"
            },
            "最小": {
                "类型": "数字",
                "默认": "0",
                "提示": "此设置所允许的最小值"
            },
            "最大": {
                "类型": "数字",
                "默认": "0",
                "提示": "此设置所允许的最大值"
            },
            "排序": {
                "类型": "数字",
                "默认": "0",
                "提示": "此设置与其他同类别设置的排序关系。排序较高的设置会在排序较低的设置之后显示。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "设置"],
        "提示": "提供一个新的整数型设置值，会显示在“地图工坊设置”卡片上作为滑块。"
    },

    "地图工坊设置组合": {
        "参数": {
            "类别": {
                "类型": "条件",
                "默认": "自定义字符串(\"\")",
                "提示": "此类别的名字，可以用来找到此设置。"
            },
            "名称": {
                "类型": "条件",
                "默认": "自定义字符串(\"\")",
                "提示": "此设置的名称。"
            },
            "默认": {
                "类型": "数字",
                "默认": "0",
                "提示": "此项设置的默认值。"
            },
            "选项": {
                "类型": "条件",
                "默认": "数组()",
                "提示": "此设置的选项。"
            },
            "排序": {
                "类型": "数字",
                "默认": "0",
                "提示": "此设置与其他同类别设置的排序关系。排序较高的设置会在排序较低的设置之后显示。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "设置"],
        "提示": "提供一个新的选项设置值（用于选择自定义字符串），会显示在“地图工坊设置”卡片上作为组合框。此值会返回所选内容的索引。"
    },

    "地图工坊设置英雄": {
        "参数": {
            "类别": {
                "类型": "条件",
                "默认": "自定义字符串(\"\")",
                "提示": "此类别的名字，可以用来找到此设置。"
            },
            "名称": {
                "类型": "条件",
                "默认": "自定义字符串(\"\")",
                "提示": "此设置的名称。"
            },
            "默认": {
                "类型": "英雄选项",
                "默认": "回声",
                "提示": "此项设置的默认值。"
            },
            "排序": {
                "类型": "数字",
                "默认": "0",
                "提示": "此设置与其他同类别设置的排序关系。排序较高的设置会在排序较低的设置之后显示。"
            }
        },
        "返回": ["英雄"],
        "标签": ["条件", "设置"],
        "提示": "提供一个新的英雄设置值，会显示在“地图工坊设置”卡片上作为组合框。"
    },

    "地图矢量": {
        "参数": {
            "本地矢量": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "将此相对本地坐标的矢量值转化为相对于地图坐标的矢量值。"
            },
            "相对玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "本地矢量是相对此玩家的。"
            },
            "转换": {
                "类型": "矢量转换选项",
                "默认": "旋转",
                "提示": "指定此矢量是否接受旋转及平移（通常是位置），或者只接受旋转（通常是方向和速度）。"
            }
        },
        "返回": ["矢量"],
        "标签": ["条件", "矢量运算"],
        "提示": "相对于地图坐标的矢量值，与所提供的相对本地坐标的矢量值对应。"
    },

    "垂直方向夹角": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "以此玩家当前面向的角度为起点。"
            },
            "位置": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "测定与地图中此位置的夹角。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "角度"],
        "提示": "玩家当前朝向的方向与指定位置之间的垂直方向夹角，单位为度。如果位置在玩家下方，则结果为正数。否则，结果为零或负数。"
    },

    "垂直朝向角度": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家的面向角度。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "角度"],
        "提示": "玩家当前面对的方向与地图的垂直夹角。当玩家转向下方时这个值会增加。"
    },

    "垂直速度": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家的垂直速度。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "速度"],
        "提示": "秒。排除所有垂直方向的运动，包括沿斜坡方向的运动。"
    },

    "处于回合之间": {
        "返回": ["布尔"],
        "标签": ["条件", "判断"],
        "提示": "此比赛是否正在两个回合之间。"
    },

    "处于非初始状态": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家的状态。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "判断"],
        "提示": "指定玩家当前是否处于非初始状态（如D.Va离开机甲、卢西奥使用加速音乐、堡垒处于转换形态期间、天使和托比昂使用辅助攻击武器，等等。）如果要检测回声是否正在使用人格复制，请使用“正在人格复制”的值。"
    },

    "头像火力全开": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家的头像状态。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "判断"],
        "提示": "指定玩家的头像是否处于火力全开状态。"
    },

    "字符串": {
        "参数": {
            "字符串": {
                "类型": "字符串选项",
                "默认": "问候",
                "提示": "结果文本。花括号中的数字将被相应的值取代。"
            },
            "{0}": {
                "类型": "条件",
                "默认": "空",
                "提示": "此值将转换为文本并用于替代{0}。"
            },
            "{1}": {
                "类型": "条件",
                "默认": "空",
                "提示": "此值将转换为文本并用于替代{1}。"
            },
            "{2}": {
                "类型": "条件",
                "默认": "空",
                "提示": "此值将转换为文本并用于替代{2}。"
            }
        },
        "返回": ["字符串"],
        "标签": ["条件", "字符串"],
        "提示": "由选定的字符串和指定的值构成的文本。"
    },

    "自定义字符串": {
        "参数": {
            "字符串": {
                "类型": "字符串选项",
                "默认": "",
                "提示": "结果文本。花括号中的数字将被相应的值取代。"
            },
            "{0}": {
                "类型": "条件",
                "默认": "空",
                "提示": "此值将转换为文本并用于替代{0}。"
            },
            "{1}": {
                "类型": "条件",
                "默认": "空",
                "提示": "此值将转换为文本并用于替代{1}。"
            },
            "{2}": {
                "类型": "条件",
                "默认": "空",
                "提示": "此值将转换为文本并用于替代{2}。"
            }
        },
        "返回": ["字符串"],
        "标签": ["条件", "字符串"],
        "提示": "可以输入值的自定义文本。"
    },

    "字符串中字符": {
        "参数": {
            "字符串": {
                "类型": "条件",
                "默认": "自定义字符串(\"\")",
                "提示": "获取此字符串值的字符。"
            },
            "索引": {
                "类型": "条件",
                "默认": "0",
                "提示": "要获取字符的索引（0表示第一个字符，1表示第二个字符，以此类推）。"
            }
        },
        "返回": ["字符串"],
        "标签": ["条件", "字符串"],
        "提示": "一条字符串的指定索引对应的字符。"
    },

    "字符串分割": {
        "参数": {
            "字符串": {
                "类型": "条件",
                "默认": "自定义字符串(\"\")",
                "提示": "要分割的字符串值。"
            },
            "分隔符": {
                "类型": "条件",
                "默认": "自定义字符串(\"\")",
                "提示": "要分割字符串值所用的分隔符字符串。"
            }
        },
        "返回": ["字符串"],
        "标签": ["条件", "字符串"],
        "提示": "结果为字符串值数组。数组中的字符串值由将指定字符串值用分隔符字符串分割而成。"
    },

    "字符串包含": {
        "参数": {
            "字符串": {
                "类型": "条件",
                "默认": "自定义字符串(\"\")",
                "提示": "在此字符串中搜索指定的值。"
            },
            "字符串": {
                "类型": "条件",
                "默认": "自定义字符串(\"\")",
                "提示": "要搜索的值。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "字符串"],
        "提示": "指定字符串中是否包含指定的值。"
    },

    "字符串字符索引": {
        "参数": {
            "字符串": {
                "类型": "条件",
                "默认": "自定义字符串(\"\")",
                "提示": "从此字符串值中搜索字符。"
            },
            "字符": {
                "类型": "条件",
                "默认": "自定义字符串(\"\")",
                "提示": "要搜索的字符。"
            }
        },
        "返回": ["字符串"],
        "标签": ["条件", "字符串"],
        "提示": "一个字符在字符串中的索引位置。如果找不到此字符，则为"
    },

    "字符串替换": {
        "参数": {
            "字符串": {
                "类型": "条件",
                "默认": "自定义字符串(\"\")",
                "提示": "在此字符串中搜索进行替换。"
            },
            "模式": {
                "类型": "条件",
                "默认": "自定义字符串(\"\")",
                "提示": "要替换的字符串模式。"
            },
            "替换": {
                "类型": "条件",
                "默认": "自定义字符串(\"\")",
                "提示": "用此字符串值替换模式字符串。"
            }
        },
        "返回": ["字符串"],
        "标签": ["条件", "字符串"],
        "提示": "结果为字符串值。此字符串值由将指定字符串值中出现的所有模式字符串替换为替换字符串而成。"
    },

    "字符串长度": {
        "参数": {
            "字符串": {
                "类型": "条件",
                "默认": "自定义字符串(\"\")",
                "提示": "计算此字符串值的字符数。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "字符串"],
        "提示": "结果为所选字符串值中的字符数（所选值不是字符串时为0）。"
    },

    "存活": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家的生命状态。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "判断"],
        "提示": "玩家是否存活。"
    },

    "存活玩家数量": {
        "参数": {
            "队伍": {
                "类型": "条件",
                "默认": "所有队伍",
                "提示": "计算下列队伍中玩家的数量。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "数量"],
        "提示": "队伍或比赛中存活的玩家数量。"
    },

    "实体存在": {
        "参数": {
            "实体": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检查是否存在此玩家、图标实体或效果实体。"
            },
        },
        "返回": ["布尔"],
        "标签": ["条件", "判断"],
        "提示": "指定玩家、图标实体或效果实体是否存在。可以用来查看一个玩家是否已经离开比赛，或一个实体是否已被消除。"
    },

    "实体数量": {
        "返回": ["数字"],
        "标签": ["条件", "数量"],
        "提示": "由“创建效果”、“创建光束效果”或“创建图标”动作创建的实体的当前数量。"
    },

    "对任意为“真”": {
        "参数": {
            "数组": {
                "类型": "条件",
                "默认": "数组()",
                "提示": "考察此数组中的值。"
            },
            "条件": {
                "类型": "条件",
                "默认": "0 == 0",
                "提示": "对指定的数组中每个元素判断此条件。可以使用“当前数组元素值”来指代数组中当前正在进行判断的元素。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "数组"],
        "提示": "指定数组中是否有元素对指定的条件为“真”。"
    },

    "对全部为“真”": {
        "参数": {
            "数组": {
                "类型": "条件",
                "默认": "数组()",
                "提示": "考察此数组中的值。"
            },
            "条件": {
                "类型": "条件",
                "默认": "0 == 0",
                "提示": "对指定的数组中每个元素判断此条件。可以使用“当前数组元素值”来指代数组中当前正在进行判断的元素。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "数组"],
        "提示": "指定数组中所有元素是否都对指定的条件为“真”。"
    },

    "对方队伍": {
        "参数": {
            "队伍": {
                "类型": "条件",
                "默认": "所有队伍",
                "提示": "获得此队伍的对方队伍。如果选择“全部”，结果亦为“全部”。"
            }
        },
        "返回": ["队伍"],
        "标签": ["条件", "队伍"],
        "提示": "指定队伍的对方队伍。"
    },

    "对象索引": {
        "返回": ["数字"],
        "标签": ["条件", "索引"],
        "提示": "当前激活的控制点、运载目标检查点或运载目标目的地（0，1或2）。在攻防作战、攻击"
    },

    "射线命中位置": {
        "参数": {
            "开始位置": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "射线开始施放的位置。如果此处填入一名玩家，则使用从此玩家脚部向上2米的位置。"
            },
            "结束位置": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "射线结束的位置。如果此处填入一名玩家，则使用从此玩家脚部向上2米的位置。"
            },
            "包括玩家": {
                "类型": "条件",
                "默认": "所有玩家(所有队伍)",
                "提示": "哪些玩家可以被射线击中。"
            },
            "不包括玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "射线不会击中的玩家。此列表将优先于“包括玩家”。"
            },
            "包括玩家拥有的物体": {
                "类型": "条件",
                "默认": "真",
                "提示": "玩家拥有的物体（如屏障或炮台）是否包括在射线中。"
            }
        },
        "返回": ["矢量"],
        "标签": ["条件", "射线"],
        "提示": "射线在表面、物体或玩家上命中的位置（如果没有命中则此位置在视线结束处）。"
    },

    "射线命中法线": {
        "参数": {
            "开始位置": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "射线开始施放的位置。如果此处填入一名玩家，则使用从此玩家脚部向上2米的位置。"
            },
            "结束位置": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "射线结束的位置。如果此处填入一名玩家，则使用从此玩家脚部向上2米的位置。"
            },
            "包括玩家": {
                "类型": "条件",
                "默认": "所有玩家(所有队伍)",
                "提示": "哪些玩家可以被射线击中。"
            },
            "不包括玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "射线不会击中的玩家。此列表将优先于“包括玩家”。"
            },
            "包括玩家拥有的物体": {
                "类型": "条件",
                "默认": "真",
                "提示": "玩家拥有的物体（如屏障或炮台）是否包括在射线中。"
            }
        },
        "返回": ["矢量"],
        "标签": ["条件", "射线"],
        "提示": "射线命中平面的法线（如果没有命中，则从视线结束位置到射线起始位置）。"
    },

    "射线命中玩家": {
        "参数": {
            "开始位置": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "射线开始施放的位置。如果此处填入一名玩家，则使用从此玩家脚部向上2米的位置。"
            },
            "结束位置": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "射线结束的位置。如果此处填入一名玩家，则使用从此玩家脚部向上2米的位置。"
            },
            "包括玩家": {
                "类型": "条件",
                "默认": "所有玩家(所有队伍)",
                "提示": "哪些玩家可以被射线击中。"
            },
            "不包括玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "射线不会击中的玩家。此列表将优先于“包括玩家”。"
            },
            "包括玩家拥有的物体": {
                "类型": "条件",
                "默认": "真",
                "提示": "玩家拥有的物体（如屏障或炮台）是否包括在射线中。"
            }
        },
        "返回": ["实体"],
        "标签": ["条件", "射线"],
        "提示": "射线命中的玩家（如果没有命中则为空）。"
    },

    "左": {
        "返回": ["矢量"],
        "标签": ["条件", "方向"],
        "提示": "方向性矢量 (1, 0, 0) 的简写，此矢量指向左方。"
    },

    "已排序的数组": {
        "参数": {
            "数组": {
                "类型": "条件",
                "默认": "数组()",
                "提示": "对此数组的复制进行排序。"
            },
            "条件": {
                "类型": "条件",
                "默认": "相距距离(当前数组元素, 事件玩家)",
                "提示": "将此值赋值给复制的数组中的每个元素。数组将以升序排列。可以使用“当前数组元素值”来指代数组中当前正在进行判断的元素。"
            }
        },
        "返回": ["数组"],
        "标签": ["条件", "数组"],
        "提示": "复制指定的数组，根据每个元素的值的排名重新排序。"
    },

    "已过滤的数组": {
        "参数": {
            "数组": {
                "类型": "条件",
                "默认": "数组()",
                "提示": "对此数组的复制进行过滤。"
            },
            "条件": {
                "类型": "条件",
                "默认": "当前数组元素 == 0",
                "提示": "对复制的数组中每个元素判断此条件。如果条件为“真”，则在复制的数组中保留此元素。可以使用“当前数组元素值”来指代数组中当前正在进行判断的元素。"
            }
        },
        "返回": ["数组"],
        "标签": ["条件", "数组"],
        "提示": "复制指定的数组，不满足特定条件的值将被移除。"
    },

    "已重生": {
        "参数": {
            "实体": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家、图标实体或效果实体是否存在于地图中。"
            },
        },
        "返回": ["布尔"],
        "标签": ["条件", "判断"],
        "提示": "一个实体是否存在于地图中。如果玩家尚未选择英雄，则返回结果为“假“。"
    },

    "幅值": {
        "参数": {
            "矢量": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "求幅值操作的矢量操作数。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "矢量运算"],
        "提示": "指定值的幅值。例如指定向量的长度。"
    },

    "平方根": {
        "参数": {
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": "计算此实数值的平方根。负数值则为0。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "数学运算"],
        "提示": "指定值的平方根。"
    },

    "弧度的余弦值": {
        "参数": {
            "角度": {
                "类型": "条件",
                "默认": "0",
                "提示": "角度，以角度为单位。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "数学运算"],
        "提示": "指定角度（以弧度为单位）的余弦值。"
    },

    "弧度的正切值": {
        "参数": {
            "角度": {
                "类型": "条件",
                "默认": "0",
                "提示": "角度，以角度为单位。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "数学运算"],
        "提示": "指定弧度（以度为单位）的正切值。"
    },

    "弧度的正弦值": {
        "参数": {
            "角度": {
                "类型": "条件",
                "默认": "0",
                "提示": "角度，以角度为单位。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "数学运算"],
        "提示": "指定角度（以弧度为单位）的正弦值。"
    },

    "弹药": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家的弹药数量。"
            },
            "弹夹": {
                "类型": "条件",
                "默认": "0",
                "提示": "获取弹夹的索引。0为第一个弹夹，1为第二个。若指定类型不存在，则返还0。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "数量"],
        "提示": "一名玩家当前的弹药数量。"
    },

    "归一化": {
        "参数": {
            "矢量": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "要归一化的矢量。"
            }
        },
        "返回": ["矢量"],
        "标签": ["条件", "矢量运算"],
        "提示": "将矢量归一化为单位长度。"
    },

    "当前地图": {
        "返回": ["地图"],
        "标签": ["条件", "地图"],
        "提示": "自定义游戏中当前使用的地图。"
    },

    "当前数组元素": {
        "返回": ["条件"],
        "标签": ["条件", "数组"],
        "提示": "当前在考察的数组元素。只有在使用“过滤数组”或“排序数组”赋值时才有意义。"
    },

    "当前数组索引": {
        "返回": ["数字"],
        "标签": ["条件", "数组"],
        "提示": "当前在考察的数组索引。只有在使用“过滤数组”或“排序数组”赋值时才有意义。"
    },

    "当前游戏模式": {
        "返回": ["模式"],
        "标签": ["条件", "判断"],
        "提示": "当前自定游戏的游戏模式。"
    },

    "总计消耗时间": {
        "返回": ["数字"],
        "标签": ["条件", "时间"],
        "提示": "该游戏副本创建后已经过去的总时间（包括准备时间和攻防转换时间），以秒为单位。"
    },

    "截取字符串": {
        "参数": {
            "字符串": {
                "类型": "条件",
                "默认": "自定义字符串(\"\")",
                "提示": "从此字符串值中构建子字符串。"
            },
            "开始字符索引": {
                "类型": "条件",
                "默认": "0",
                "提示": "指定一个字符作为子字符串的起始处（0表示第一个字符，1表示第二个字符，以此类推）。"
            },
            "字符串长度": {
                "类型": "条件",
                "默认": "1",
                "提示": "指定子字符串的字符数。"
            }
        },
        "返回": ["字符串"],
        "标签": ["条件", "字符串"],
        "提示": "结果为所选字符串值的指定子字符串。"
    },

    "所在队伍": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家的队伍。"
            }
        },
        "返回": ["队伍"],
        "标签": ["条件", "队伍"],
        "提示": "一支玩家所在的队伍。如果在自由混战模式中，则“队伍”视为“全部”。"
    },

    "所有存活玩家": {
        "参数": {
            "队伍": {
                "类型": "条件",
                "默认": "所有队伍",
                "提示": "玩家所在的队伍。"
            }
        },
        "返回": ["数组"],
        "标签": ["条件", "玩家"],
        "提示": "此数组中包括一支队伍或整个比赛中所有存活的玩家。"
    },

    "所有支援英雄": {
        "返回": ["数组"],
        "标签": ["条件", "英雄"],
        "提示": "此数组包括了所有支援英雄。"
    },

    "所有死亡玩家": {
        "参数": {
            "队伍": {
                "类型": "条件",
                "默认": "所有队伍",
                "提示": "玩家所在的队伍。"
            }
        },
        "返回": ["数组"],
        "标签": ["条件", "玩家"],
        "提示": "此数组中包括一支队伍或整个比赛中所有已死亡的玩家。"
    },

    "所有玩家": {
        "参数": {
            "队伍": {
                "类型": "条件",
                "默认": "所有队伍",
                "提示": "玩家所在的队伍。"
            }
        },
        "返回": ["数组"],
        "标签": ["条件", "玩家"],
        "提示": "此数组中包括一支队伍或整个比赛中所有的玩家。"
    },

    "所有目标点内玩家": {
        "参数": {
            "队伍": {
                "类型": "条件",
                "默认": "所有队伍",
                "提示": "玩家所在的队伍。"
            }
        },
        "返回": ["数组"],
        "标签": ["条件", "玩家"],
        "提示": "此数组中包括所有在运载目标或控制点上的玩家（可以是一支队伍中的，也可以是整个比赛中的）。"
    },

    "所有目标点外玩家": {
        "参数": {
            "队伍": {
                "类型": "条件",
                "默认": "所有队伍",
                "提示": "玩家所在的队伍。"
            }
        },
        "返回": ["数组"],
        "标签": ["条件", "玩家"],
        "提示": "此数组中包括所有不在运载目标或控制点上的玩家（可以是一支队伍中的，也可以是整个比赛中的）。"
    },

    "所有输出英雄": {
        "返回": ["数组"],
        "标签": ["条件", "英雄"],
        "提示": "此数组包括了所有输出英雄。"
    },

    "所有重装英雄": {
        "返回": ["数组"],
        "标签": ["条件", "英雄"],
        "提示": "此数组包括了所有重装英雄。"
    },

    "所用英雄": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家的英雄。"
            }
        },
        "返回": ["英雄"],
        "标签": ["条件", "英雄"],
        "提示": "一名玩家当前的英雄。"
    },

    "所选位置": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家的位置。"
            }
        },
        "返回": ["矢量"],
        "标签": ["条件", "位置"],
        "提示": "玩家的当前位置，此值为矢量。"
    },

    "技能充能": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家的技能状态。"
            },
            "按钮": {
                "类型": "条件",
                "默认": "按钮(主要攻击模式)",
                "提示": "检测此按键对应的技能状态。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "技能"],
        "提示": "一名玩家指定按键对应技能的充能次数。"
    },

    "技能冷却时间": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家的技能状态。"
            },
            "按钮": {
                "类型": "条件",
                "默认": "按钮(主要攻击模式)",
                "提示": "检测此按键对应的技能状态。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "技能"],
        "提示": "一名玩家指定按键对应技能的冷却时间，以秒为单位。"
    },

    "技能图标字符串": {
        "参数": {
            "英雄": {
                "类型": "条件",
                "默认": "英雄(回声)",
                "提示": "将这个英雄的技能转化为图标。"
            },
            "按钮": {
                "类型": "条件",
                "默认": "按钮(主要攻击模式)",
                "提示": "将这个技能的按键转化为图标。"
            }
        },
        "返回": ["字符串"],
        "标签": ["条件", "字符串"],
        "提示": "将一个英雄和按键的参数转化为图标在字符串中显示（每个字符串中最多4个）。"
    },

    "技能资源": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家的生命状态。"
            },

            "按钮": {
                "类型": "条件",
                "默认": "按钮(主要攻击模式)",
                "提示": "检测此按键对应的技能状态。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "资源"],
        "提示": "一名玩家指定按键对应技能的资源百分比。"
    },

    "持续伤害数量": {
        "返回": ["数字"],
        "标签": ["条件", "数量"],
        "提示": "由“持续伤害”动作启动的持续伤害副本的当前数量。"
    },

    "持续治疗数量": {
        "返回": ["数字"],
        "标签": ["条件", "数量"],
        "提示": "由“持续治疗”动作启动的持续治疗副本的当前数量。"
    },

    "指定方向速度": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家的速度。"
            },

            "方向": {
                "类型": "条件",
                "默认": "面朝方向(事件玩家)",
                "提示": "行动的方向，用于测量玩家速度。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "速度"],
        "提示": "一名玩家在指定方向上的当前速度，单位为米/秒。"
    },

    "按钮": {
        "参数": {
            "按钮": {
                "类型": "按钮选项",
                "默认": "主要攻击模式",
                "提示": "一个按钮选项。"
            },
        },
        "返回": ["按钮"],
        "标签": ["条件", "按钮"],
        "提示": "一个按钮常量。"
    },

    "按钮被按下": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家的按钮。"
            },

            "按钮": {
                "类型": "条件",
                "默认": "按钮(主要攻击模式)",
                "提示": "用于检测的按钮。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "按钮"],
        "提示": "玩家是否正在按下特定按钮。"
    },

    "携带旗帜的玩家": {
        "参数": {
            "队伍": {
                "类型": "条件",
                "默认": "所有队伍",
                "提示": "检测此队伍的旗帜。"
            }
        },
        "返回": ["实体"],
        "标签": ["条件", "玩家"],
        "提示": "在勇夺锦旗模式中正在携带指定队伍旗帜的玩家。如果没有玩家正在携带旗帜，则返回值为空。"
    },

    "攻击方": {
        "返回": ["实体"],
        "标签": ["条件", "玩家"],
        "提示": "根据此规则处理的事件中造成伤害的玩家。可能与被攻击者或事件玩家是同一个人。"
    },

    "数组": {
        "参数": {
            "条件": {
                "类型": "条件",
                "默认": "空",
                "提示": "获取此数组中的元素。"
            }
        },
        "返回": ["数组"],
        "标签": ["条件", "数组"],
        "提示": "由所列出的值组成的数组。"
    },

    "数组中的值": {
        "参数": {
            "数组": {
                "类型": "条件",
                "默认": "数组()",
                "提示": "获取此数组中的元素。"
            },
            "索引": {
                "类型": "条件",
                "默认": "0",
                "提示": "获取索引中的元素。"
            }
        },
        "返回": ["数组"],
        "标签": ["条件", "数组"],
        "提示": "一个数组中指定元素的值。如果该元素不存在，则结果为0。"
    },

    "数组值的索引": {
        "参数": {
            "数组": {
                "类型": "条件",
                "默认": "数组()",
                "提示": "在此数组中搜索指定的值。"
            },
            "值": {
                "类型": "条件",
                "默认": "全局.A",
                "提示": "要搜索的值。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "数组"],
        "提示": "一个值在数组中的索引位置。如果找不到此值，则为-1。"
    },

    "数组分割": {
        "参数": {
            "数组": {
                "类型": "条件",
                "默认": "数组()",
                "提示": "产生此数组的复制。"
            },
            "开始索引": {
                "类型": "条件",
                "默认": "0",
                "提示": "范围内的第一个索引。"
            },
            "计数": {
                "类型": "条件",
                "默认": "0",
                "提示": "结果数组中的元素数量。如果指定的范围超过此数组的限制，则结果数组中会包含较少的元素。"
            }
        },
        "返回": ["数组"],
        "标签": ["条件", "数组"],
        "提示": "复制指定的数组，只复制指定索引范围内的值。"
    },

    "数组包含": {
        "参数": {
            "数组": {
                "类型": "条件",
                "默认": "数组()",
                "提示": "在此数组中搜索指定的值。"
            },
            "值": {
                "类型": "条件",
                "默认": "全局.A",
                "提示": "要搜索的值。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "数组"],
        "提示": "指定数组中是否包含指定的值。"
    },

    "数组随机取值": {
        "参数": {
            "数组": {
                "类型": "条件",
                "默认": "数组()",
                "提示": "从一个数组中随机取值。如果提供的值不是数组，则结果为提供的值。"
            }
        },
        "返回": ["条件"],
        "标签": ["条件", "数组"],
        "提示": "指定数组中的一个随机值。"
    },

    "数量": {
        "参数": {
            "数组": {
                "类型": "条件",
                "默认": "数组()",
                "提示": "计算此数组的元素个数。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "数量"],
        "提示": "指定数组的元素个数。"
    },

    "文本数量": {
        "返回": ["数字"],
        "标签": ["条件", "数量"],
        "提示": "由“创建HUD文本”、“创建地图文本”、“创建进度条HUD文本”或“创建进度条地图文本”动作启动的文本副本的当前数量。"
    },

    "方向": {
        "参数": {
            "开始位置": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "用于获取方向矢量的起点位置。"
            },
            "结束位置": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "用于获取方向矢量的终点位置。"
            }
        },
        "返回": ["矢量"],
        "标签": ["条件", "方向"],
        "提示": "从一个位置到另一个位置的单位长度矢量。"
    },

    "旗帜位置": {
        "参数": {
            "队伍": {
                "类型": "条件",
                "默认": "所有队伍",
                "提示": "获取此队伍旗帜的位置。"
            }
        },
        "返回": ["矢量"],
        "标签": ["条件", "位置"],
        "提示": "在勇夺锦旗模式中指定队伍的位置。"
    },

    "旗帜是否在基地中": {
        "参数": {
            "队伍": {
                "类型": "条件",
                "默认": "所有队伍",
                "提示": "检测此队伍的旗帜。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "判断"],
        "提示": "在勇夺锦旗模式下，指定队伍的旗帜是否在其基地内。"
    },

    "空": {
        "返回": ["空"],
        "标签": ["条件", "空"],
        "提示": "一名玩家已离开。当没有玩家进行输入时使用。用来比较或测试时等效于实数0。"
    },

    "映射的数组": {
        "参数": {
            "数组": {
                "类型": "条件",
                "默认": "数组()",
                "提示": "对此数组的复制进行映射。"
            },
            "条件": {
                "类型": "条件",
                "默认": "当前数组元素.A",
                "提示": "映射表达式将此数组中的每个元素复值为被复制的数组中的元素值。使用“当前数组元素值”可以指定当前考察的数组中元素的值。"
            },
        },
        "返回": ["数组"],
        "标签": ["条件", "数组"],
        "提示": "复制指定的数组，根据映射表达式对每个元素进行赋值。"
    },

    "是否是机器人": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "考察此玩家。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "判断"],
        "提示": "玩家是否是机器人。"
    },

    "是否有人携带旗帜": {
        "参数": {
            "队伍": {
                "类型": "条件",
                "默认": "所有队伍",
                "提示": "检测此队伍的旗帜。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "判断"],
        "提示": "在勇夺锦旗模式下，指定队伍的旗帜是否在其基地内。"
    },

    "最后": {
        "参数": {
            "数组": {
                "类型": "条件",
                "默认": "数组()",
                "提示": "获取此数组中的值。"
            }
        },
        "返回": ["条件"],
        "标签": ["条件", "数组"],
        "提示": "指定数组末尾元素的值。如果指定数组为空，则结果为0。"
    },

    "最后一击数": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家的最后一击次数。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "数量"],
        "提示": "指定玩家造成最后一击的次数。这个值会随着游戏的进程不断累积。"
    },

    "最后创建的实体": {
        "返回": ["实体"],
        "标签": ["条件", "ID"],
        "提示": "对事件玩家创建的（或由全局创建的）最后一个效果，图标实体或机器人的引用。"
    },

    "最后创建的生命池": {
        "返回": ["实体"],
        "标签": ["条件", "ID"],
        "提示": "此ID值代表最后一个事件玩家（或全局）所执行的”添加生命池“动作。"
    },

    "最大弹药量": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家的最大弹药数量。"
            },
            "弹夹": {
                "类型": "条件",
                "默认": "0",
                "提示": "获取弹夹的索引。0为第一个弹夹，1为第二个。若指定类型不存在，则返还0。"
            },
        },
        "返回": ["数字"],
        "标签": ["条件", "数量"],
        "提示": "一名玩家当前的最大弹药数量。"
    },

    "最大生命值": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家的最大生命值。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "玩家"],
        "提示": "一名玩家的最大生命值，包括护甲和护盾。"
    },

    "最近的可行走位置": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家的方向输入。"
            }
        },
        "返回": ["矢量"],
        "标签": ["条件", "位置"],
        "提示": "与指定位置最接近的、可以站立且能够从一个重生点到达的位置。"
    },

    "服务器负载": {
        "返回": ["数字"],
        "标签": ["条件", "百分比"],
        "提示": "当前游戏副本造成的CPU负载百分比。如果这个数字接近或者超过100，表示此游戏副本消耗了过多资源，游戏很可能会关闭。"
    },

    "服务器负载峰值": {
        "返回": ["数字"],
        "标签": ["条件", "百分比"],
        "提示": "当前游戏副本在过去2秒内造成的最高CPU负载百分比。如果这个数字接近或者超过100，表示此游戏副本消耗了过多资源，游戏很可能会关闭。"
    },

    "服务器负载平均值": {
        "返回": ["数字"],
        "标签": ["条件", "百分比"],
        "提示": "当前游戏副本在过去2秒内造成的平均CPU负载百分比。如果这个数字接近或者超过100，表示此游戏副本消耗了过多资源，游戏很可能会关闭。"
    },

    "本地玩家": {
        "返回": ["实体"],
        "标签": ["条件", "玩家"],
        "提示": "由终端用户的电脑所操控的玩家。此值对每位终端用户均不相同，所以只有会影响视觉效果或HUD的动作才可访问此值。此值无法储存在变量中。（一般配合“持续 - 全局”规则使用。）"
    },

    "本地矢量": {
        "参数": {
            "地图矢量": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "将此相对地图坐标的矢量值转化为相对于本地坐标的矢量值。"
            },
            "相对玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "本地矢量是相对此玩家的。"
            },
            "转换": {
                "类型": "矢量转换选项",
                "默认": "旋转",
                "提示": "指定此矢量是否接受旋转及平移（通常是位置），或者只接受旋转（通常是方向和速度）。"
            }
        },
        "返回": ["矢量"],
        "标签": ["条件", "矢量运算"],
        "提示": "相对于本地坐标的矢量值，与所提供的相对地图坐标的矢量值对应。"
    },

    "标准化生命值": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家的标准化生命值。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "数学运算"],
        "提示": "玩家当前的生命值，包括护甲和护盾，在0到1之间取标准化值。（例如，0为无生命值，0"
    },

    "标量积": {
        "参数": {
            "值": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "用于计算标量积的矢量之一。"
            },
            "值": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "用于计算标量积的矢量之一。"
            }
        },
        "返回": ["矢量"],
        "标签": ["条件", "矢量运算"],
        "提示": "指定值的标量积。"
    },

    "栏位": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家的栏位编号。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "栏位"],
        "提示": "指定玩家的栏位编号。在队伍模式中，每个队伍中玩家的栏位编号为0到5的数字；在自由混战模式中，栏位编号为0到11。"
    },

    "栏位数量": {
        "参数": {
            "队伍": {
                "类型": "条件",
                "默认": "所有队伍",
                "提示": "计算下列队伍中栏位的数量。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "栏位", "数量"],
        "提示": "队伍或比赛中的栏位数量。"
    },

    "正在与人交流": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家的交流状态。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "交流", "判断"],
        "提示": "玩家是否在使用任意的交流类型（如表情、播放语音、喷漆等）。"
    },

    "正在交流": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家的交流状态。"
            },
            "类型": {
                "类型": "交流选项",
                "默认": "收到",
                "提示": "考察的交流类型。表情的持续时间为准确值，语音的播放时间视为4秒，其他所有交流类型的持续时间视为2秒。"
            },
        },
        "返回": ["布尔"],
        "标签": ["条件", "交流", "判断"],
        "提示": "玩家是否在使用指定的交流类型（如表情、播放语音、喷漆等）。"
    },

    "正在人格复制": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家的人格复制状态。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "状态", "判断"],
        "提示": "指定玩家是否正在复制另一名输出英雄。（为了检测复制的英雄，可使用“正在复制的英雄”的值。）"
    },

    "正在使用主要武器": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家的主要武器攻击状态。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "状态", "判断"],
        "提示": "指定玩家是否在使用主要武器攻击。"
    },

    "正在使用喷漆交流": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家的喷漆状态。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "交流", "判断"],
        "提示": "玩家是否在使用喷漆。"
    },

    "正在使用技能 1": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家的技能1状态。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "状态", "判断"],
        "提示": "指定玩家是否在使用技能"
    },

    "正在使用技能 2": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家的技能2状态。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "状态", "判断"],
        "提示": "指定玩家是否在使用技能"
    },

    "正在使用终极技能": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家的终极技能状态。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "状态", "判断"],
        "提示": "玩家是否在使用终极技能。"
    },

    "正在使用英雄": {
        "参数": {
            "英雄": {
                "类型": "条件",
                "默认": "英雄(回声)",
                "提示": "检测此英雄是否在使用。"
            },
            "队伍": {
                "类型": "条件",
                "默认": "所有队伍",
                "提示": "检测队伍中是否正在使用这名英雄。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "英雄", "判断"],
        "提示": "指定英雄是否正在使用（可以限定在队伍中或游戏中）。"
    },

    "正在使用表情交流": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家是否在使用表情。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "交流", "判断"],
        "提示": "玩家是否在使用表情。"
    },

    "正在使用语音交流": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家是否在播放语音。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "交流", "判断"],
        "提示": "玩家是否在播放语音（语音的长度统一视为4秒）。"
    },

    "正在使用辅助武器": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家的辅助武器攻击状态。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "状态", "判断"],
        "提示": "指定玩家是否在使用辅助武器攻击。"
    },

    "正在复制的英雄": {
        "标签": ["条件", "英雄", "判断"],
        "提示": ""
    },

    "正在移动": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家的运动状态。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "状态", "判断"],
        "提示": "玩家是否在移动（当前速度不为零）。"
    },

    "正在空中": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家的浮空状态。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "状态", "判断"],
        "提示": "玩家是否在空中。"
    },

    "正在站立": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家的站立状态。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "状态", "判断"],
        "提示": "玩家是否在站立（既不在移动也不在空中）。"
    },

    "正在等待玩家": {
        "返回": ["布尔"],
        "标签": ["条件", "比赛", "判断"],
        "提示": "此比赛是否正在等待玩家加入。"
    },

    "正在装填": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家的装填状态。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "状态", "判断"],
        "提示": "指定玩家是否在装填。"
    },

    "正在设置": {
        "返回": ["布尔"],
        "标签": ["条件", "状态", "判断"],
        "提示": "此比赛是否正在准备阶段。"
    },

    "正在跳跃": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家的跳跃状态。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "状态", "判断"],
        "提示": "指定玩家是否在跳跃。"
    },

    "正在蹲下": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家是否正在下蹲。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "状态", "判断"],
        "提示": "玩家是否在下蹲。"
    },

    "正在近战攻击": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家的近战攻击状态。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "状态", "判断"],
        "提示": "指定玩家是否在近战攻击。"
    },

    "正在防守": {
        "参数": {
            "队伍": {
                "类型": "条件",
                "默认": "所有队伍",
                "提示": "检查此队伍的职责。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "队伍", "判断"],
        "提示": "指定队伍是否是防守方。如果游戏模式不是攻防作战、护送、或攻击"
    },

    "正在集结英雄": {
        "返回": ["布尔"],
        "标签": ["条件", "比赛", "判断"],
        "提示": "此比赛是否正在集结英雄阶段。"
    },

    "此栏位的玩家": {
        "参数": {
            "栏位": {
                "类型": "条件",
                "默认": "0",
                "提示": "获取指定栏位编号的玩家。在队伍模式中，每个队伍中玩家的栏位编号为0到5的数字；在自由混战模式中，栏位编号为0到11。"
            },
            "队伍": {
                "类型": "条件",
                "默认": "所有队伍",
                "提示": "从这些队伍中选择玩家。"
            }
        },
        "返回": ["玩家", "玩家数组"],
        "标签": ["条件", "玩家"],
        "提示": "游戏的指定栏位编号处的玩家或玩家数组。"
    },

    "武器": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家的武器。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "武器", "索引"],
        "提示": "一名玩家当前的武器。"
    },

    "死亡": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家的死亡状态。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "玩家", "判断"],
        "提示": "玩家是否死亡。"
    },

    "死亡数": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家的死亡次数。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "数量"],
        "提示": "指定玩家死亡的次数。这个值会随着游戏的进程不断累积。"
    },

    "死亡玩家数量": {
        "参数": {
            "队伍": {
                "类型": "条件",
                "默认": "所有队伍",
                "提示": "计算下列队伍中玩家的数量。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "数量"],
        "提示": "队伍或比赛中死亡的玩家数量。"
    },

    "比赛回合": {
        "返回": ["数字"],
        "标签": ["条件", "索引"],
        "提示": "比赛当前的回合数，从1开始计数。"
    },

    "比赛时间": {
        "返回": ["数字"],
        "标签": ["条件", "时间"],
        "提示": "当前游戏模式阶段剩余的时间，以秒为单位。"
    },

    "比赛结束": {
        "返回": ["布尔"],
        "标签": ["条件", "判断"],
        "提示": "此比赛是否已经结束。"
    },

    "水平方向夹角": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "以此玩家当前面向的角度为起点。"
            },
            "位置": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "测定与地图中此位置的夹角。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "角度"],
        "提示": "玩家当前朝向的方向与指定位置之间的水平方向夹角，单位为度。如果位置在玩家左边，则结果为正数。否则，结果为零或负数。"
    },

    "水平朝向角度": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家的面向角度。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "角度"],
        "提示": "玩家当前面对的方向与地图的水平夹角。当玩家转向左方时这个值会增加。（范围为"
    },

    "水平速度": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家的水平速度。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "速度"],
        "提示": "一名玩家在水平方向上的当前速度，单位为米"
    },

    "治疗者": {
        "返回": ["实体"],
        "标签": ["条件", "玩家"],
        "提示": "根据此规则处理的事件中造成治疗的玩家。可能与被治疗者或事件玩家是同一个人。"
    },

    "治疗调整数量": {
        "返回": ["数字"],
        "标签": ["条件", "数量"],
        "提示": "由“开始治疗调整”动作启动的治疗调整副本的当前数量。"
    },

    "消灭数": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家的消灭次数。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "数量"],
        "提示": "指定玩家参与消灭的次数。这个值会随着游戏的进程不断累积。"
    },

    "添加至数组": {
        "参数": {
            "数组": {
                "类型": "条件",
                "默认": "数组()",
                "提示": "要被添加的数组。"
            },
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": "加入数列尾端的值。如果值本身是一个数列，则添加其中的每一个元素。"
            }
        },
        "返回": ["数组"],
        "标签": ["条件", "数组"],
        "提示": "一个数组的复制，将一个或更多的值添加至其末尾。"
    },

    "游戏模式": {
        "参数": {
            "模式": {
                "类型": "模式选项",
                "默认": "死斗",
                "提示": "一个模式选项。"
            }
        },
        "返回": ["模式"],
        "标签": ["条件", "模式"],
        "提示": "一个模式常量。"
    },

    "游戏正在进行中": {
        "返回": ["布尔"],
        "标签": ["条件", "判断"],
        "提示": "此比赛是否正在主要阶段（可以进行战斗并获得分数的阶段）。"
    },

    "玩家数据": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家的数据。"
            },
            "数据": {
                "类型": "玩家数据选项",
                "默认": "所有造成伤害量",
                "提示": "获取数据。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "数据"],
        "提示": "提供指定玩家的数据（仅限当前比赛）。仅在游戏进行时收集数据。机器人不会收集数据。"
    },

    "玩家数量": {
        "参数": {
            "队伍": {
                "类型": "条件",
                "默认": "所有队伍",
                "提示": "计算下列队伍中玩家的数量。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "数量"],
        "提示": "队伍或比赛中的玩家数量。"
    },

    "玩家英雄数据": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家的数据。"
            },
            "英雄": {
                "类型": "条件",
                "默认": "英雄(回声)",
                "提示": "获取此英雄的数据。"
            },
            "数据": {
                "类型": "英雄数据选项",
                "默认": "所有造成伤害量",
                "提示": "获取数据。"
            }
        },
        "返回": ["英雄数据"],
        "标签": ["条件", "英雄数据"],
        "提示": "提供指定玩家使用指定英雄的数据（仅限当前比赛）。仅在游戏进行时收集数据。机器人不会收集数据。"
    },

    "生命值": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家的生命值。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "玩家"],
        "提示": "玩家当前的生命值，包括护甲和护盾。"
    },

    "目标位置": {
        "参数": {
            "数字": {
                "类型": "条件",
                "默认": "0",
                "提示": "考察的目标点的索引，从0开始逐渐累加。每个控制点、运载目标检查点、运载目标目的地都有其独自的索引。"
            }
        },
        "返回": ["矢量"],
        "标签": ["条件", "位置"],
        "提示": "特定目标点（控制点、运载目标检查点、或运载目标目的地）在地图中的位置。在攻防作战、攻击"
    },

    "目标是否完成": {
        "参数": {
            "数字": {
                "类型": "条件",
                "默认": "0",
                "提示": "考察的目标点的索引，从0开始逐渐累加。每个控制点、运载目标检查点、运载目标目的地都有其独自的索引。"
            }
        },
        "返回": ["布尔"],
        "标签": ["条件", "判断"],
        "提示": "目标是否已经完成。如果游戏模式不是攻防作战、护送、或攻击/护送，则结果为“假”。在攻防作战、攻击/护送及占领要点模式中生效。"
    },

    "目标点上玩家数量": {
        "返回": ["数字"],
        "标签": ["条件", "数量"],
        "提示": "在运载目标或控制点上的玩家数量（可以是一支队伍中的，也可以是整个比赛中的）。"
    },

    "目标点占领百分比": {
        "返回": ["数字"],
        "标签": ["条件", "百分比"],
        "提示": "已激活的控制点当前的占领进度（以百分比表示）。"
    },

    "相距距离": {
        "参数": {
            "开始位置": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "用于测量距离的两个位置之一。"
            },
            "结束位置": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "用于测量距离的两个位置之一。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "位置"],
        "提示": "两个位置之间的距离，单位为米。"
    },

    "真": {
        "返回": ["布尔"],
        "标签": ["条件", "布尔"],
        "提示": "布尔值，真。"
    },

    "眼睛位置": {
        "参数": {
            "位置": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取第一人称视角的位置（用于瞄准）的玩家。"
            }
        },
        "返回": ["矢量"],
        "标签": ["条件", "位置"],
        "提示": "玩家第一人称视角的位置（用于瞄准）。"
    },

    "矢量": {
        "参数": {
            "X": {
                "类型": "条件",
                "默认": "0",
                "提示": "矢量的X轴值，表示向左的量。"
            },
            "Y": {
                "类型": "条件",
                "默认": "0",
                "提示": "矢量的Y轴值，表示向上的量。"
            },
            "Z": {
                "类型": "条件",
                "默认": "0",
                "提示": "矢量的Z轴值，表示向前的量。"
            }
        },
        "返回": ["矢量"],
        "标签": ["条件", "矢量"],
        "提示": "矢量在三个方向上的实数值（X，Y，Z），X为左，Y为上，Z为前。矢量用来表示位置、方向和速度。"
    },

    "矢量积": {
        "参数": {
            "值": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "用于计算矢量积的左边矢量。"
            },
            "值": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "用于计算矢量积的右边矢量。"
            }
        },
        "返回": ["矢量"],
        "标签": ["条件", "矢量运算"],
        "提示": "指定值的矢量积。（左乘以上等于前）"
    },

    "矢量间夹角": {
        "参数": {
            "矢量": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "需以角度为单位测量夹角的两个方向性矢量之一。该矢量不需要预先归一化。"
            },
            "矢量": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "需以角度为单位测量夹角的两个方向性矢量之一。该矢量不需要预先归一化。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "角度"],
        "提示": "两方向性矢量间的夹角（不需要归一化）"
    },

    "空数组": {
        "返回": ["数组"],
        "标签": ["条件", "数组"],
        "提示": "一个没有任何元素的数组。"
    },

    "类型的最大生命值": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家的最大生命值。"
            },
            "生命值": {
                "类型": "生命种类选项",
                "默认": "生命值",
                "提示": "获取此类型的最大生命值。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "玩家"],
        "提示": "玩家此类型的最大生命值（生命，护甲，或护盾）。"
    },

    "类型的生命值": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家的生命值。"
            },
            "生命值": {
                "类型": "生命种类选项",
                "默认": "生命值",
                "提示": "获取此类型的生命值。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "玩家"],
        "提示": "玩家此类型的生命值（生命，护甲，或护盾）。"
    },

    "终极技能充能百分比": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家当前终极技能的充能百分比。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "技能", "百分比"],
        "提示": "一名玩家当前终极技能的充能百分比。"
    },

    "绝对值": {
        "参数": {
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": "计算此实数值的绝对值。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "数学运算"],
        "提示": "指定值的绝对值。"
    },

    "自定义颜色": {
        "参数": {
            "红色": {
                "类型": "条件",
                "默认": "255",
                "提示": "一种颜色的红色分量。"
            },
            "绿色": {
                "类型": "条件",
                "默认": "255",
                "提示": "一种颜色的绿色分量。"
            },
            "蓝色": {
                "类型": "条件",
                "默认": "255",
                "提示": "一种颜色的蓝色分量。"
            },
            "不透明度": {
                "类型": "条件",
                "默认": "255",
                "提示": "一种颜色的不透明度分量。"
            }
        },
        "返回": ["颜色"],
        "标签": ["条件", "颜色"],
        "提示": "可设置指定RGB值和不透明度的自定义颜色。"
    },

    "英雄": {
        "参数": {
            "英雄": {
                "类型": "英雄选项",
                "默认": "回声",
                "提示": "一个英雄选项。"
            }
        },
        "返回": ["英雄"],
        "标签": ["条件", "英雄"],
        "提示": "一个英雄常量。"
    },

    "英雄图标字符串": {
        "参数": {
            "值": {
                "类型": "条件",
                "默认": "英雄(回声)",
                "提示": "此英雄将被转换为一个图标。"
            }
        },
        "返回": ["字符串"],
        "标签": ["条件", "字符串"],
        "提示": "将一个英雄的参数转化为字符串并作为图标显示（每个字符串最多4项）。"
    },

    "英雄数量": {
        "参数": {
            "英雄": {
                "类型": "条件",
                "默认": "英雄(回声)",
                "提示": "检测此英雄是否在使用。"
            },
            "队伍": {
                "类型": "条件",
                "默认": "所有队伍",
                "提示": "检测队伍中是否正在使用这名英雄。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "数量"],
        "提示": "在一支队伍或此比赛中使用指定英雄的数量。"
    },

    "范围内玩家": {
        "参数": {
            "中间": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "以此位置为中心测定距离。"
            },
            "半径": {
                "类型": "条件",
                "默认": "0",
                "提示": "玩家需在此距离范围内（单位：米）才会出现在结果列表中。"
            },
            "队伍": {
                "类型": "条件",
                "默认": "所有队伍",
                "提示": "所选队伍的玩家会出现在结果列表中。"
            },
            "视线": {
                "类型": "视线检测选项",
                "默认": "关闭",
                "提示": "只有通过视线检测的玩家才会出现在结果列表中。"
            }
        },
        "返回": ["数组"],
        "标签": ["条件", "玩家"],
        "提示": "一个列表，其中包含距离指定位置小于一定距离的玩家，可设置是否受到队伍及视线的限制。"
    },

    "被攻击方": {
        "返回": ["实体"],
        "标签": ["条件", "玩家"],
        "提示": "根据此规则处理的事件中受到伤害的玩家。可能与攻击者或事件玩家是同一个人。"
    },

    "视角中的玩家": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "检测此玩家的视野。"
            },
            "队伍": {
                "类型": "条件",
                "默认": "所有队伍",
                "提示": "用于比较的视角，单位为度。"
            },
        },
        "返回": ["实体"],
        "标签": ["条件", "玩家"],
        "提示": "最接近此玩家准星位置的玩家，可以选择是否限制所在队伍。"
    },

    "角度差": {
        "参数": {
            "角度": {
                "类型": "条件",
                "默认": "0",
                "提示": "用于计算结果角度的两个角度之一。"
            },
            "角度": {
                "类型": "条件",
                "默认": "0",
                "提示": "用于计算结果角度的两个角度之一。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "角度"],
        "提示": "两个角度之间的度数差。将两个角度折算为彼此+/-180度范围内之后进行计算，如果第二个角度比第一个大则结果为正数。否则结果为负数。"
    },

    "角度的余弦值": {
        "参数": {
            "角度": {
                "类型": "条件",
                "默认": "0",
                "提示": "角度，以角度为单位。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "角度"],
        "提示": "指定角度（以度为单位）的余弦值。"
    },

    "角度的正切值": {
        "参数": {
            "角度": {
                "类型": "条件",
                "默认": "0",
                "提示": "角度，以角度为单位。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "角度"],
        "提示": "指定角度（以度为单位）的正切值。"
    },

    "角度的正弦值": {
        "参数": {
            "角度": {
                "类型": "条件",
                "默认": "0",
                "提示": "角度，以角度为单位。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "角度"],
        "提示": "指定角度（以度为单位）的正弦值。"
    },

    "距离准星最近的玩家": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "搜索距此玩家准星最近的玩家。"
            },
            "队伍": {
                "类型": "条件",
                "默认": "所有队伍",
                "提示": "搜索此队伍中最近的玩家。"
            }
        },
        "返回": ["实体"],
        "标签": ["条件", "玩家"],
        "提示": "最接近指定玩家准星位置的玩家，可以选择是否限制所在队伍。"
    },

    "距离最近的玩家": {
        "参数": {
            "中间": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "以此位置为起点测量距离。"
            },
            "队伍": {
                "类型": "条件",
                "默认": "所有队伍",
                "提示": "最近一名玩家所在的队伍。"
            }
        },
        "返回": ["实体"],
        "标签": ["条件", "玩家"],
        "提示": "距离一个位置最近的玩家，可以选择是否限制所在队伍。"
    },

    "距离最远的玩家": {
        "参数": {
            "中间": {
                "类型": "条件",
                "默认": "矢量(0, 0, 0)",
                "提示": "以此位置为起点测量距离。"
            },
            "队伍": {
                "类型": "条件",
                "默认": "所有队伍",
                "提示": "最近一名玩家所在的队伍。"
            }
        },
        "返回": ["实体"],
        "标签": ["条件", "玩家"],
        "提示": "距离一个位置最远的玩家，可以选择是否限制所在队伍。"
    },

    "较大": {
        "参数": {
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": "左边的运算量，可以是结果为数字的值。"
            },
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": "右边的运算量，可以是结果为数字的值。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "数学运算"],
        "提示": "两个数字中较大的一个。"
    },

    "较小": {
        "参数": {
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": "左边的运算量，可以是结果为数字的值。"
            },
            "值": {
                "类型": "条件",
                "默认": "0",
                "提示": "右边的运算量，可以是结果为数字的值。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "数学运算"],
        "提示": "两个数字中较小的一个。"
    },

    "输入绑定字符串": {
        "参数": {
            "按钮": {
                "类型": "条件",
                "默认": "按钮(主要攻击模式)",
                "提示": "将这个输入绑定的按键转化为图标。"
            }
        },
        "返回": ["字符串"],
        "标签": ["条件", "字符串"],
        "提示": "将一个“按钮”参数转化为一个字符串，根据玩家所输入的绑定按键显示。此值不能存储在变量中。"
    },

    "运载目标位置": {
        "返回": ["矢量"],
        "标签": ["条件", "位置"],
        "提示": "已激活的运载目标在地图中的位置。"
    },

    "运载目标进度百分比": {
        "返回": ["数字"],
        "标签": ["条件", "百分比"],
        "提示": "已激活的运载目标前往目标地的当前进度（以百分比表示）。"
    },

    "选择英雄的玩家": {
        "参数": {
            "英雄": {
                "类型": "条件",
                "默认": "英雄(回声)",
                "提示": "检测此英雄是否在使用。"
            },
            "队伍": {
                "类型": "条件",
                "默认": "所有队伍",
                "提示": "检测队伍中是否正在使用这名英雄。"
            }
        },
        "返回": ["实体"],
        "标签": ["条件", "玩家"],
        "提示": "此数列中是一支队伍或本场比赛中正在使用指定英雄的玩家。"
    },

    "逐帧更新": {
        "参数": {
            "值": {
                "类型": "条件",
                "默认": "所选位置(事件玩家)",
                "提示": "此值的更新频率将从每几帧更新一次提高为每一帧更新一次。"
            }
        },
        "返回": ["条件"],
        "标签": ["条件", "赋值"],
        "提示": "结果为提供给“输入值”参数的值，并且会将此值的更新频率提高为每一帧更新一次。可以用来使特定值的出现更加平滑，例如“所选位置”等通常每几帧才会更新一次的值。可对条件和会重新赋值的动作参数使用。可能会增加服务器负载和/或降低帧率。"
    },

    "速度": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家的速度。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "速度"],
        "提示": "一名玩家的当前速度，单位为米/秒。"
    },

    "速率": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家的速率。"
            }
        },
        "返回": ["矢量"],
        "标签": ["条件", "矢量运算"],
        "提示": "玩家当前的速率，此值为一个矢量。如果玩家位于表面上，则矢量在Y方向上的分量为0，即使在上坡或下坡。"
    },

    "重生点": {
        "参数": {
            "队伍": {
                "类型": "条件",
                "默认": "所有队伍",
                "提示": "获取此队伍的重生点。"
            }
        },
        "返回": ["数组"],
        "标签": ["条件", "比赛"],
        "提示": "队伍或比赛中激活的重生点，以实体数组的形式提供。"
    },

    "阈值": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家的方向输入。"
            }
        },
        "返回": ["矢量"],
        "标签": ["条件", "玩家"],
        "提示": "玩家所输入的方向，通过一个矢量表示，X轴为水平（正值代表向左），Z轴为垂直（正值代表向前）。"
    },

    "队伍": {
        "参数": {
            "队伍": {
                "类型": "队伍选项",
                "默认": "双方",
                "提示": "一个队伍选项。“所有队伍”或“双方”选项代表队伍模式中的两支队伍，或自由混战模式中的全部玩家。"
            },
        },
        "返回": ["队伍"],
        "标签": ["条件", "队伍"],
        "提示": "一个队伍常量。“所有队伍”或“双方”选项代表队伍模式中的两支队伍，或自由混战模式中的全部玩家。"
    },

    "随机实数": {
        "参数": {
            "最小": {
                "类型": "条件",
                "默认": "0",
                "提示": "允许的最小实数。"
            },
            "最大": {
                "类型": "条件",
                "默认": "1",
                "提示": "允许的最大实数。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "数学运算"],
        "提示": "指定最小值与最大值之间的一个随机实数。"
    },

    "随机数组": {
        "参数": {
            "数组": {
                "类型": "条件",
                "默认": "数组()",
                "提示": "对此数组的复制进行随机排列。"
            }
        },
        "返回": ["数组"],
        "标签": ["条件", "数组"],
        "提示": "复制指定的数组，所有值随机排序。"
    },

    "随机整数": {
        "参数": {
            "最小": {
                "类型": "条件",
                "默认": "0",
                "提示": "允许的最小整数。如果此处输入的是一个实数，则取最接近此实数的整数。"
            },
            "最大": {
                "类型": "条件",
                "默认": "1",
                "提示": "允许的最大整数。如果此处输入的是一个实数，则取最接近此实数的整数。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "数学运算"],
        "提示": "指定最小值与最大值之间的一个随机整数（包括最小值与最大值在内）。"
    },

    "面朝方向": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家面向的方向。"
            }
        },
        "返回": ["矢量"],
        "标签": ["条件", "方向"],
        "提示": "玩家当前面向方向与地图相对角度的单位长度方向矢量。此矢量的值同进包括水平和垂直方向。"
    },

    "颜色": {
        "参数": {
            "颜色": {
                "类型": "颜色选项",
                "默认": "白色",
                "提示": "一个颜色选项。"
            }
        },
        "返回": ["颜色"],
        "标签": ["条件", "颜色"],
        "提示": "一个颜色常量。"
    },

    "首个": {
        "参数": {
            "数组": {
                "类型": "条件",
                "默认": "数组()",
                "提示": "获取此数组中的值。"
            }
        },
        "返回": ["条件"],
        "标签": ["条件", "数组"],
        "提示": "指定数组开始处的值。如果指定数组为空，此值则为0。"
    },

    "高度": {
        "参数": {
            "玩家": {
                "类型": "条件",
                "默认": "事件玩家",
                "提示": "获取此玩家的高度。"
            }
        },
        "返回": ["数字"],
        "标签": ["条件", "玩家"],
        "提示": "玩家当前距离表面的高度，以米为单位。如果玩家正在表面上则结果为0。"
    }
}