module.exports = {
    //···································· 事件 ····································//
    "持续 - 全局": {
        "标签": ["规则事件选项"],
        "提示": "当比赛开始时，创建此规则的单一副本。此副本在整场比赛中保持激活状态。"
    },

    "持续 - 每名玩家": {
        "标签": ["规则事件选项"],
        "提示": "当玩家加入比赛时，为每位玩家创建此规则的副本。此副本会保持激活，直至玩家离开比赛或比赛结束。每个副本都会独立追踪并执行条件和行动。"
    },

    "玩家造成伤害": {
        "标签": ["规则事件选项"],
        "提示": "当玩家造成伤害时执行规则。"
    },

    "玩家造成最后一击": {
        "标签": ["规则事件选项"],
        "提示": "当玩家造成最后一击时执行规则。"
    },

    "玩家造成治疗": {
        "标签": ["规则事件选项"],
        "提示": "当玩家造成治疗时执行规则。"
    },

    "玩家造成击退": {
        "标签": ["规则事件选项"],
        "提示": "当玩家造成击退时执行规则. "
    },

    "玩家阵亡": {
        "标签": ["规则事件选项"],
        "提示": "当玩家阵亡时执行规则。"
    },

    "玩家参与消灭": {
        "标签": ["规则事件选项"],
        "提示": "当玩家参与消灭时执行规则。"
    },

    "玩家加入比赛": {
        "标签": ["规则事件选项"],
        "提示": "当玩家加入比赛时执行规则。"
    },

    "玩家离开比赛": {
        "标签": ["规则事件选项"],
        "提示": "当玩家离开比赛时执行规则。"
    },

    "玩家受到治疗": {
        "标签": ["规则事件选项"],
        "提示": "当玩家受到治疗时执行规则。"
    },

    "玩家受到击退": {
        "标签": ["规则事件选项"],
        "提示": "当玩家受到击退时执行规则. "
    },

    "玩家受到伤害": {
        "标签": ["规则事件选项"],
        "提示": "当玩家受到伤害时执行规则。"
    },

    "子程序": {
        "标签": ["规则事件选项"],
        "提示": "当被“调用子程序“或”开始规则”动作调用时执行该规则。"
    }
}

/*
//  此参数应该属于规则，在函数中判断规则的事件参数类型后决定剩下的参数
//
//  当前架构制造3类规则模板:
//      [1] 只有 事件 参数，适用于 持续-全局 规则
//      [2] 有 事件，队伍，玩家 3个参数，适用于 持续-每名玩家，玩家加入比赛 等等 规则
//      [3] 有 事件，子程序 2个参数， 适用于 子程序 规则
//
"参数": {
    "队伍": {
        "类型": "条件",
        "默认": "双方",
        "提示": "限定要观察的队伍。队伍1表示蓝队，队伍2表示红队。非团队模式（例如“死斗”）请设置为双方。"
    },
    "玩家": {
        "类型": "玩家",
        "默认": "全部",
        "提示": "限定要观察的玩家。可选特定栏位或使用特定英雄的玩家。"
    }
},
"参数": {
    "子程序": {
        "类型": "子程序",
        "默认": "Sub0",
        "提示": "已注册的子程序名称"
    }
},
*/