module.exports = {
    //···································· 栏位 ····································//
    "栏位 0": {
        "标签": ["规则事件玩家选项"],
        "顺序": "000",
        "提示": "表示第0个栏位的玩家。"
    },

    "栏位 1": {
        "标签": ["规则事件玩家选项"],
        "顺序": "001",
        "提示": "表示第1个栏位的玩家。"
    },

    "栏位 2": {
        "标签": ["规则事件玩家选项"],
        "顺序": "002",
        "提示": "表示第2个栏位的玩家。"
    },

    "栏位 3": {
        "标签": ["规则事件玩家选项"],
        "顺序": "003",
        "提示": "表示第3个栏位的玩家。"
    },

    "栏位 4": {
        "标签": ["规则事件玩家选项"],
        "顺序": "004",
        "提示": "表示第4个栏位的玩家。"
    },

    "栏位 5": {
        "标签": ["规则事件玩家选项"],
        "顺序": "005",
        "提示": "表示第5个栏位的玩家。"
    },

    "栏位 6": {
        "标签": ["规则事件玩家选项"],
        "顺序": "006",
        "提示": "表示第6个栏位的玩家。"
    },

    "栏位 7": {
        "标签": ["规则事件玩家选项"],
        "顺序": "007",
        "提示": "表示第7个栏位的玩家。"
    },

    "栏位 8": {
        "标签": ["规则事件玩家选项"],
        "顺序": "008",
        "提示": "表示第8个栏位的玩家。"
    },

    "栏位 9": {
        "标签": ["规则事件玩家选项"],
        "顺序": "009",
        "提示": "表示第9个栏位的玩家。"
    },

    "栏位 10": {
        "标签": ["规则事件玩家选项"],
        "顺序": "010",
        "提示": "表示第10个栏位的玩家。"
    },

    "栏位 11": {
        "标签": ["规则事件玩家选项"],
        "顺序": "011",
        "提示": "表示第11个栏位的玩家。"
    },

    "全部": {
        "标签": ["规则事件玩家选项"],
        "顺序": "012",
        "提示": "表示所有栏位的玩家。"
    },

    "安娜": {
        "标签": ["规则事件玩家选项"],
        "提示": "作为守望先锋的副指挥官，安娜·艾玛莉利用她的技巧和专长保护家园和最亲密的人。",
        "路径": "images/ow/hero/support/ana/",
        "图标": "icon",
        "生命": {
            "自由": "200",
            "职责": "200"
        },
        "技能": {
            "生化步枪": {
                "图标": "weapon",
                "绑定": ["主要攻击模式", "辅助攻击模式"],
                "提示": "安娜的步枪能够射出治疗队友和对敌人造成持续伤害的子弹。而她步枪上的瞄准镜能够让她进行更加精确的射击。"
            },
            "纳米激素": {
                "图标": "ultimate",
                "绑定": ["终极技能"],
                "提示": "安娜在给一名队友注射战斗激素后，造成的伤害更高，而受到敌人的伤害更少。"
            },
            "麻醉镖": {
                "图标": "ability1",
                "绑定": ["技能1"],
                "提示": "安娜用她的手枪发射飞镖，而飞镖能够让敌人失去意识(但任何的伤害都能唤醒敌人)。"
            },
            "生物手雷": {
                "图标": "ability2",
                "绑定": ["技能2"],
                "提示": "受到手雷影响的队友在一段时间内所受到的治疗量增加，而受到手雷影响的敌人在一段时间内无法接受治疗。"
            }
        }
    },

    "艾什": {
        "标签": ["规则事件玩家选项"],
        "提示": "艾什是死局帮的领袖，这个帮派在美国西南部非常有影响。",
        "路径": "images/ow/hero/damage/ashe/",
        "图标": "icon",
        "生命": {
            "自由": "200",
            "职责": "200"
        },
        "技能": {
            "“毒蛇”": {
                "图标": "weapon",
                "绑定": ["主要攻击模式", "辅助攻击模式"]
            },
            "召唤鲍勃": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "短筒猎枪": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "延时雷管": {
                "图标": "ability2",
                "绑定": ["技能2"]
            }
        }
    },

    "巴蒂斯特": {
        "标签": ["规则事件玩家选项"],
        "提示": "巴蒂斯特是一位精英战地医疗兵，曾担任黑爪特工，但现在的他致力于使用自己的能力去帮助那些饱受战火袭扰的人们。",
        "路径": "images/ow/hero/support/baptiste/",
        "图标": "icon",
        "生命": {
            "自由": "200",
            "职责": "200"
        },
        "技能": {
            "生化榴弹枪": {
                "图标": "weapon",
                "绑定": ["主要攻击模式", "辅助攻击模式"],
                "提示": "使用不同的弹药索引。攻击为 0，治疗为 1。"
            },
            "增幅矩阵": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "愈合冲击": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "维生力场": {
                "图标": "ability2",
                "绑定": ["技能2"]
            },
            "动力战靴": {
                "图标": "passive",
                "绑定": ["跳跃", "被动"],
                "提示": "在蓄力后可以跳得更高。"
            }
        }
    },

    "堡垒": {
        "标签": ["规则事件玩家选项"],
        "提示": "曾在智械危机中身为前线战斗单位，充满好奇心的“堡垒”现在成为了一名探险者，被自然之美深深吸引的同时也警惕着人性之恶。",
        "路径": "images/ow/hero/damage/bastion/",
        "图标": "icon",
        "生命": {
            "自由": "200",
            "职责": "200",
            "护甲": "100"
        },
        "技能": {
            "侦察模式": {
                "图标": "weapon1",
                "绑定": ["主要攻击模式"]
            },
            "强攻模式": {
                "图标": "weapon2",
                "绑定": ["主要攻击模式"],
                "提示": "切换模式状态下的武器。无需装弹，故无法设置弹药。"
            },
            "A-36战术榴弹": {
                "图标": "secondaryfire",
                "绑定": ["辅助攻击模式"]
            },
            "火炮模式": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "切换模式": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "抗击装甲": {
                "图标": "passive",
                "绑定": ["被动"],
                "提示": "降低切换模式后所受的伤害。"
            }
        }
    },

    "布丽吉塔": {
        "标签": ["规则事件玩家选项"],
        "提示": "布丽吉塔·林德霍姆是莱因哈特·威尔海姆的追随者，她曾经是一名机械工程师，现在则穿上盔甲踏上战场，保卫这个世界。",
        "路径": "images/ow/hero/support/brigitte/",
        "图标": "icon",
        "生命": {
            "自由": "150",
            "职责": "150",
            "护甲": "50",
            "屏障": "300"
        },
        "技能": {
            "火箭连枷": {
                "图标": "weapon",
                "绑定": ["主要攻击模式"],
                "提示": "举盾时不可用。"
            },
            "屏障护盾": {
                "图标": "secondaryfire1",
                "绑定": ["辅助攻击模式"]
            },
            "能量盾击": {
                "图标": "secondaryfire2",
                "绑定": ["辅助攻击模式 + 主要攻击模式"],
                "提示": "仅在举盾时可用。作为事件技能时为“主要攻击模式”。"
            },
            "集结号令": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "流星飞锤": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "恢复包": {
                "图标": "ability2",
                "绑定": ["技能2"]
            },
            "鼓舞士气": {
                "图标": "passive",
                "绑定": ["被动"]
            }
        }
    },

    "末日铁拳": {
        "标签": ["规则事件玩家选项"],
        "提示": "“末日铁拳”是“黑爪”的领导者之一，他坚信只有将世界带向一场新的战争才能让人类变得更加强大。",
        "路径": "images/ow/hero/tank/doomfist/",
        "图标": "icon",
        "生命": {
            "自由": "300",
            "职责": "450"
        },
        "技能": {
            "手炮": {
                "图标": "weapon",
                "绑定": ["主要攻击模式"],
                "提示": "无法手动装填，但可以设置弹药。"
            },
            "火箭重拳": {
                "图标": "secondaryfire",
                "绑定": ["辅助攻击模式"]
            },
            "毁天灭地": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "裂地重拳": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "悍猛格挡": {
                "图标": "ability2",
                "绑定": ["技能2"]
            },
            "最佳防守": {
                "图标": "passive",
                "绑定": ["被动"],
                "提示": "用技能命中敌人后，自身可生成临时生命值。"
            }
        }
    },

    "D.Va": {
        "标签": ["规则事件玩家选项"],
        "提示": "D.Va曾经是一名职业玩家，而现在则利用自己的技巧驾驶一台尖端机甲保卫国家。",
        "路径": "images/ow/hero/tank/dva/",
        "图标": "icon",
        "生命": {
            "自由": "200",
            "职责": "350",
            "护甲": "300"
        },
        "技能": {
            "聚变机炮": {
                "图标": "weapon1",
                "绑定": ["主要攻击模式"],
                "提示": "使用时会降低D.Va的移动速度。"
            },
            "光枪": {
                "图标": "weapon2",
                "绑定": ["主要攻击模式"],
                "提示": "不在机甲内时为光枪。"
            },
            "防御矩阵": {
                "图标": "secondaryfire",
                "绑定": ["辅助攻击模式"]
            },
            "自毁": {
                "图标": "ultimate1",
                "绑定": ["终极技能"],
                "提示": "将机甲设定为自爆模式，爆炸会对附近大范围的敌人造成巨额伤害。。"
            },
            "呼叫机甲": {
                "图标": "ultimate2",
                "绑定": ["终极技能"],
                "提示": "不在机甲内时为召唤机甲。"
            },
            "推进器": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "微型飞弹": {
                "图标": "ability2",
                "绑定": ["技能2"]
            },
            "弹射": {
                "图标": "passive",
                "绑定": ["被动"]
            }
        }
    },

    "回声": {
        "标签": ["规则事件玩家选项"],
        "提示": "“回声”是守望先锋成员米娜·廖博士设计制造的机器人，搭载了可以高速学习适应的先进人工智能程序。",
        "路径": "images/ow/hero/damage/echo/",
        "图标": "icon",
        "生命": {
            "自由": "200",
            "职责": "200"
        },
        "技能": {
            "三角射击": {
                "图标": "weapon",
                "绑定": ["主要攻击模式"]
            },
            "黏性炸弹": {
                "图标": "secondaryfire",
                "绑定": ["辅助攻击模式"]
            },
            "人格复制": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "飞行": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "聚焦光线": {
                "图标": "ability2",
                "绑定": ["技能2"]
            },
            "滑翔": {
                "图标": "passive",
                "绑定": ["跳跃", "被动"]
            }
        }
    },

    "源氏": {
        "标签": ["规则事件玩家选项"],
        "提示": "半机械忍者岛田源氏已经接受了他曾经排斥的强化躯体，并因此发现了更高境界的人性。",
        "路径": "images/ow/hero/damage/genji/",
        "图标": "icon",
        "生命": {
            "自由": "200",
            "职责": "200"
        },
        "技能": {
            "镖": {
                "图标": "weapon",
                "绑定": ["主要攻击模式", "辅助攻击模式"]
            },
            "斩": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "影": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "闪": {
                "图标": "ability2",
                "绑定": ["技能2"]
            },
            "灵": {
                "图标": "passive",
                "绑定": ["跳跃", "被动"],
                "提示": "可以攀爬墙壁并且在空中二段跳。正在攀爬时视为“在墙上”。"
            }
        }
    },

    "破坏球": {
        "标签": ["规则事件玩家选项"],
        "提示": "“破坏球”的驾驶员哈蒙德是一只仓鼠，经过基因改造，他的智力发生了突变式进化。哈蒙德在世界各地探索，不断寻求着新的冒险。",
        "路径": "images/ow/hero/tank/wrecking-ball/",
        "图标": "icon",
        "生命": {
            "自由": "300",
            "职责": "450",
            "护甲": "100",
            "护盾": "150"
        },
        "技能": {
            "四联火炮": {
                "图标": "weapon",
                "绑定": ["主要攻击模式"]
            },
            "工程抓钩": {
                "图标": "secondaryfire",
                "绑定": ["辅助攻击模式"]
            },
            "地雷禁区": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "动力铁球": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "感应护盾": {
                "图标": "ability2",
                "绑定": ["技能2"]
            },
            "重力坠击": {
                "图标": "crouch",
                "绑定": ["蹲下"]
            }
        }
    },

    "半藏": {
        "标签": ["规则事件玩家选项"],
        "提示": "作为箭术和忍术大师，岛田半藏一直都在追求极致完美的技艺以证明自己是最强大的武士。",
        "路径": "images/ow/hero/damage/hanzo/",
        "图标": "icon",
        "生命": {
            "自由": "200",
            "职责": "200"
        },
        "技能": {
            "风": {
                "图标": "weapon",
                "绑定": ["主要攻击模式", "辅助攻击模式"],
                "提示": "用辅助攻击模式取消拉弓。"
            },
            "竜": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "音": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "岚": {
                "图标": "ability2",
                "绑定": ["技能2"]
            },
            "跃": {
                "图标": "jump",
                "绑定": ["跳跃"]
            },
            "攀": {
                "图标": "passive",
                "绑定": ["跳跃", "被动"],
                "提示": "可以攀爬墙壁。正在攀爬时视为“在墙上”。"
            }
        }
    },

    "渣客女王": {
        "标签": ["规则事件玩家选项"],
        "提示": "曾经的废民奥代萨·“代斯”·斯通用她辛辣的笑容和无情的铁腕统治着渣客镇。",
        "路径": "images/ow/hero/tank/junker-queen/",
        "图标": "icon",
        "生命": {
            "自由": "300",
            "职责": "450"
        },
        "技能": {
            "散弹枪": {
                "图标": "weapon",
                "绑定": ["主要攻击模式"]
            },
            "锯齿利刃": {
                "图标": "secondaryfire",
                "绑定": ["辅助攻击模式", "近身攻击"],
                "提示": "仅在被丢出时可进行正常近战。"
            },
            "轰翻天": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "命令怒吼": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "血斩": {
                "图标": "ability2",
                "绑定": ["技能2"]
            },
            "狂血奔涌": {
                "图标": "passive",
                "绑定": ["被动"]
            }
        }
    },

    "狂鼠": {
        "标签": ["规则事件玩家选项"],
        "提示": "“狂鼠”是一个满脑子都是爆炸的渣客，只为了混乱和破坏而活。",
        "路径": "images/ow/hero/damage/junkrat/",
        "图标": "icon",
        "生命": {
            "自由": "200",
            "职责": "200"
        },
        "技能": {
            "榴弹发射器": {
                "图标": "weapon",
                "绑定": ["主要攻击模式"]
            },
            "炸弹轮胎": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "震荡地雷": {
                "图标": "ability1",
                "绑定": ["技能1", "辅助攻击模式"],
                "提示": "用 技能1 部署，按 辅助攻击模式 引爆。"
            },
            "捕兽夹": {
                "图标": "ability2",
                "绑定": ["技能2"]
            },
            "临别礼物": {
                "图标": "passive",
                "绑定": ["被动"],
                "提示": "被击杀后，在原地丢下若干快速引爆的榴弹。"
            }
        }
    },

    "雾子": {
        "标签": ["规则事件玩家选项"],
        "提示": "岛田家族衰亡后，雾子便开始为恢复铁坂的和平而战。",
        "路径": "images/ow/hero/support/kiriko/",
        "图标": "icon",
        "生命": {
            "自由": "200",
            "职责": "200"
        },
        "技能": {
            "锥": {
                "图标": "weapon2",
                "绑定": ["辅助攻击模式"],
                "提示": "由于一个问题，无法通过地图工坊动作更改弹药。"
            },
            "符": {
                "图标": "weapon1",
                "绑定": ["主要攻击模式"],
                "提示": "无法更改弹药。"
            },
            "狐": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "瞬": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "铃": {
                "图标": "ability2",
                "绑定": ["技能2"]
            },
            "攀": {
                "图标": "passive",
                "绑定": ["跳跃", "被动"],
                "提示": "可以攀爬墙壁。正在攀爬时视为“在墙上”。"
            }
        }
    },

    "卢西奥": {
        "标签": ["规则事件玩家选项"],
        "提示": "卢西奥是一位国际名人，通过音乐和巡演激发社会正能量。",
        "路径": "images/ow/hero/support/lucio/",
        "图标": "icon",
        "生命": {
            "自由": "200",
            "职责": "200"
        },
        "技能": {
            "音速扩音器": {
                "图标": "weapon",
                "绑定": ["主要攻击模式"]
            },
            "音波": {
                "图标": "secondaryfire",
                "绑定": ["辅助攻击模式"]
            },
            "音障": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "切歌": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "强音": {
                "图标": "ability2",
                "绑定": ["技能2"]
            },
            "滑墙": {
                "图标": "passive",
                "绑定": ["跳跃", "技能2"],
                "提示": "跃上墙面并在其上滑动。滑墙时视为“在墙上”。"
            }
        }
    },

    "卡西迪": {
        "标签": ["规则事件玩家选项"],
        "提示": "科尔·卡西迪依靠手中值得信赖的“维和者”四处亡命，以自己的方式伸张正义。",
        "路径": "images/ow/hero/damage/cassidy/",
        "图标": "icon",
        "生命": {
            "自由": "225",
            "职责": "225"
        },
        "技能": {
            "维和者": {
                "图标": "weapon",
                "绑定": ["主要攻击模式", "辅助攻击模式"]
            },
            "神射手": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "战术翻滚": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "磁性手雷": {
                "图标": "ability2",
                "绑定": ["技能2"]
            }
        }
    },

    "美": {
        "标签": ["规则事件玩家选项"],
        "提示": "美是一名为了保护环境而选择战斗的科学家。",
        "路径": "images/ow/hero/damage/mei/",
        "图标": "icon",
        "生命": {
            "自由": "250",
            "职责": "250"
        },
        "技能": {
            "冰霜冲击枪": {
                "图标": "weapon",
                "绑定": ["主要攻击模式", "辅助攻击模式"]
            },
            "暴雪": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "急冻": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "冰墙": {
                "图标": "ability2",
                "绑定": ["技能2"]
            }
        }
    },

    "天使": {
        "标签": ["规则事件玩家选项"],
        "提示": "对那些在她照料下的人来说，“天使”是名副其实的守护天使：她是一位顶尖的治疗者、天才科学家以及坚定的和平使者。",
        "路径": "images/ow/hero/support/mercy/",
        "图标": "icon",
        "生命": {
            "自由": "200",
            "职责": "200"
        },
        "技能": {
            "天使之杖": {
                "图标": "weapon1",
                "绑定": ["主要攻击模式", "辅助攻击模式"]
            },
            "天使冲击枪": {
                "图标": "weapon2",
                "绑定": ["主要攻击模式"]
            },
            "女武神": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "守护天使": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "重生": {
                "图标": "ability2",
                "绑定": ["技能2"]
            },
            "同情愈疗": {
                "图标": "passive",
                "绑定": ["被动"]
            }
        }
    },

    "莫伊拉": {
        "标签": ["规则事件玩家选项"],
        "提示": "黑爪的科学家莫伊拉·奥德莱恩有着杰出的才华，但她的工作也引起了诸多争议。她是基因工程方面的顶尖专家，研究的方向是如何对生命最基本的单元加以改进。",
        "路径": "images/ow/hero/support/moira/",
        "图标": "icon",
        "生命": {
            "自由": "200",
            "职责": "200"
        },
        "技能": {
            "生化之触": {
                "图标": "weapon",
                "绑定": ["主要攻击模式", "辅助攻击模式"],
                "提示": "治疗队友，吸取敌人。"
            },
            "生化之触-光束": {
                "图标": "secondaryfire",
                "绑定": ["辅助攻击模式"],
                "提示": "吸取敌人。"
            },
            "聚合射线": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "消散": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "生化之球": {
                "图标": "ability2",
                "绑定": ["技能2"]
            }
        }
    },

    "奥丽莎": {
        "标签": ["规则事件玩家选项"],
        "提示": "奥丽莎是用一台在努巴尼昙花一现的 OR15 系列防御机器人的零件组装而成的。尽管她还有很多要学，但现在的奥丽莎已经成为了这座城市的守护者。",
        "路径": "images/ow/hero/tank/orisa/",
        "图标": "icon",
        "生命": {
            "自由": "125",
            "职责": "275",
            "护甲": "275"
        },
        "技能": {
            "强化聚变驱动器": {
                "图标": "weapon",
                "绑定": ["主要攻击模式"]
            },
            "能量标枪": {
                "图标": "secondaryfire",
                "绑定": ["辅助攻击模式"]
            },
            "撼地猛刺": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "强固防御": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "标枪旋击": {
                "图标": "ability2",
                "绑定": ["技能2"]
            }
        }
    },

    "法老之鹰": {
        "标签": ["规则事件玩家选项"],
        "提示": "法芮尔·艾玛莉骨子里就是一个恪守岗位的人。她来自一个军功卓越的军人世家，贡献与荣耀就是她最高的追求。",
        "路径": "images/ow/hero/damage/pharah/",
        "图标": "icon",
        "生命": {
            "自由": "200",
            "职责": "200"
        },
        "技能": {
            "火箭发射器": {
                "图标": "weapon",
                "绑定": ["主要攻击模式"]
            },
            "火箭弹幕": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "推进背包": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "震荡冲击": {
                "图标": "ability2",
                "绑定": ["技能2"]
            },
            "悬浮背包": {
                "图标": "passive",
                "绑定": ["辅助攻击模式", "跳跃", "被动"]
            }
        }
    },

    "死神": {
        "标签": ["规则事件玩家选项"],
        "提示": "关于这个黑衣人的传闻并不多，只知道大家都称他为“死神”。虽然没人知道他的真实身份和动机，但有一点是可以肯定的，他的出现意味着死亡。",
        "路径": "images/ow/hero/damage/reaper/",
        "图标": "icon",
        "生命": {
            "自由": "250",
            "职责": "250"
        },
        "技能": {
            "地狱火霰弹枪": {
                "图标": "weapon",
                "绑定": ["主要攻击模式"]
            },
            "死亡绽放": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "暗影步": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "幽灵形态": {
                "图标": "ability2",
                "绑定": ["技能2"]
            },
            "收割": {
                "图标": "passive",
                "绑定": ["被动"]
            }
        }
    },

    "莱因哈特": {
        "标签": ["规则事件玩家选项"],
        "提示": "莱因哈特·威尔海姆的行事作风就像一个属于过去的勇士，时刻铭记着骑士的信条：无畏、公正、勇敢。",
        "路径": "images/ow/hero/tank/reinhardt/",
        "图标": "icon",
        "生命": {
            "自由": "175",
            "职责": "325",
            "护甲": "300",
            "屏障": "1200"
        },
        "技能": {
            "火箭重锤": {
                "图标": "weapon",
                "绑定": ["主要攻击模式"]
            },
            "屏障力场": {
                "图标": "secondaryfire",
                "绑定": ["辅助攻击模式"]
            },
            "裂地猛击": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "冲锋": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "烈焰打击": {
                "图标": "ability2",
                "绑定": ["技能2"]
            }
        }
    },

    "路霸": {
        "标签": ["规则事件玩家选项"],
        "提示": "“路霸”是一个心狠手辣的暴徒，因残忍和肆意破坏而臭名昭著。",
        "路径": "images/ow/hero/tank/roadhog/",
        "图标": "icon",
        "生命": {
            "自由": "550",
            "职责": "700"
        },
        "技能": {
            "爆裂枪": {
                "图标": "weapon",
                "绑定": ["主要攻击模式", "辅助攻击模式"]
            },
            "鸡飞狗跳": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "链钩": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "呼吸器": {
                "图标": "ability2",
                "绑定": ["技能2"]
            }
        }
    },

    "西格玛": {
        "标签": ["规则事件玩家选项"],
        "提示": "希尔伯伦·德·柯伊伯博士是一位成就不凡的天体物理学家，在一场实验事故后，他获得了操控引力的力量。目前他正在黑爪的操纵下为他们效力。",
        "路径": "images/ow/hero/tank/sigma/",
        "图标": "icon",
        "生命": {
            "自由": "200",
            "职责": "350",
            "护盾": "200",
            "屏障": "700"
        },
        "技能": {
            "超能之球": {
                "图标": "weapon",
                "绑定": ["主要攻击模式"]
            },
            "实验屏障": {
                "图标": "secondaryfire",
                "绑定": ["辅助攻击模式"]
            },
            "引力乱流": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "动能俘获": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "质量吸附": {
                "图标": "ability2",
                "绑定": ["技能2"]
            }
        }
    },

    "索杰恩": {
        "标签": ["规则事件玩家选项"],
        "提示": "“索杰恩”的躯体几乎均由机械强化部件组成，她是一位杰出的战术家，疾恶好善不曾动摇。战场之上，她是不可或缺的盟友……亦或是令人胆寒的敌人。",
        "路径": "images/ow/hero/damage/sojourn/",
        "图标": "icon",
        "生命": {
            "自由": "200",
            "职责": "200"
        },
        "技能": {
            "电磁炮": {
                "图标": "weapon",
                "绑定": ["主要攻击模式", "辅助攻击模式"],
                "提示": "无法通过修改技能资源或“伤害”动作来调整电磁炮的能量值。"
            },
            "机体超频": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "机动滑铲": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "干扰弹": {
                "图标": "ability2",
                "绑定": ["技能2"]
            }
        }
    },

    "士兵：76": {
        "标签": ["规则事件玩家选项"],
        "提示": "被全球通缉的独行侠“士兵：76”独自一人发动了一场旨在查出守望先锋解散真相的战争。",
        "路径": "images/ow/hero/damage/soldier-76/",
        "图标": "icon",
        "生命": {
            "自由": "200",
            "职责": "200"
        },
        "技能": {
            "重型脉冲步枪": {
                "图标": "weapon",
                "绑定": ["主要攻击模式"]
            },
            "螺旋飞弹": {
                "图标": "secondaryfire",
                "绑定": ["辅助攻击模式"]
            },
            "战术目镜": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "疾跑": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "生物力场": {
                "图标": "ability2",
                "绑定": ["技能2"]
            }
        }
    },

    "黑影": {
        "标签": ["规则事件玩家选项"],
        "提示": "作为全球最臭名昭著的黑客，“黑影”利用信息与情报操控权贵。",
        "路径": "images/ow/hero/damage/sombra/",
        "图标": "icon",
        "生命": {
            "自由": "200",
            "职责": "200"
        },
        "技能": {
            "自动手枪": {
                "图标": "weapon",
                "绑定": ["主要攻击模式"]
            },
            "黑客入侵": {
                "图标": "secondaryfire",
                "绑定": ["辅助攻击模式"]
            },
            "电磁脉冲": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "隐秘潜行": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "位移传动": {
                "图标": "ability2",
                "绑定": ["技能2"]
            },
            "相时而动": {
                "图标": "passive",
                "绑定": ["被动"],
                "提示": "可以透过墙体侦测到严重受伤的敌人。"
            }
        }
    },

    "秩序之光": {
        "标签": ["规则事件玩家选项"],
        "提示": "“秩序之光”可以在真正意义上扭曲现实。通过控制高强度光束，她可以将世界改造成自己想象中的模样，实现一个完美、有序的社会。",
        "路径": "images/ow/hero/damage/symmetra/",
        "图标": "icon",
        "生命": {
            "自由": "100",
            "职责": "100",
            "护盾": "125"
        },
        "技能": {
            "光子发射器": {
                "图标": "weapon",
                "绑定": ["主要攻击模式", "辅助攻击模式"]
            },
            "光子屏障": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "哨戒炮": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "传送面板": {
                "图标": "ability2",
                "绑定": ["技能2"]
            }
        }
    },

    "托比昂": {
        "标签": ["规则事件玩家选项"],
        "提示": "托比昂可以使用铆钉枪远距离或近距离作战，也可以布置一个炮台自动攻击敌人。他的锻造锤既可以修理炮台，也可以近身作战。他还可以射出高额伤害的熔岩陷阱持续伤害敌人。",
        "路径": "images/ow/hero/damage/torbjorn/",
        "图标": "icon",
        "生命": {
            "自由": "200",
            "职责": "200",
            "护甲": "50"
        },
        "技能": {
            "铆钉枪": {
                "图标": "weapon1",
                "绑定": ["主要攻击模式", "辅助攻击模式"]
            },
            "锻造锤": {
                "图标": "weapon2",
                "绑定": ["主要攻击模式"]
            },
            "熔火核心": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "热力过载": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "部署炮台": {
                "图标": "ability2",
                "绑定": ["技能2"],
                "提示": "按 互动 摧毁。部署到炮台可射击前无法主动摧毁。"
            }
        }
    },

    "猎空": {
        "标签": ["规则事件玩家选项"],
        "提示": "前守望先锋成员“猎空”是一位可以进行时间跳跃的冒险家，为了正义而不懈努力着。",
        "路径": "images/ow/hero/damage/tracer/",
        "图标": "icon",
        "生命": {
            "自由": "150",
            "职责": "150"
        },
        "技能": {
            "脉冲双枪": {
                "图标": "weapon",
                "绑定": ["主要攻击模式"]
            },
            "脉冲炸弹": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "闪现": {
                "图标": "ability1",
                "绑定": ["辅助攻击模式", "技能1"]
            },
            "闪回": {
                "图标": "ability2",
                "绑定": ["技能2"]
            }
        }
    },

    "黑百合": {
        "标签": ["规则事件玩家选项"],
        "提示": "“黑百合”是一位完美的刺客：耐心、果断、无情。没有任何情感且事后毫无悔意。",
        "路径": "images/ow/hero/damage/widowmaker/",
        "图标": "icon",
        "生命": {
            "自由": "175",
            "职责": "175"
        },
        "技能": {
            "黑百合之吻": {
                "图标": "weapon",
                "绑定": ["主要攻击模式", "辅助攻击模式"]
            },
            "红外侦测": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "抓钩": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "剧毒诡雷": {
                "图标": "ability2",
                "绑定": ["技能2"]
            }
        }
    },

    "温斯顿": {
        "标签": ["规则事件玩家选项"],
        "提示": "作为一个拥有高等智慧并被基因改造的大猩猩，温斯顿无疑是一位出色的科学家和代表着人类潜力的勇士。",
        "路径": "images/ow/hero/tank/winston/",
        "图标": "icon",
        "生命": {
            "自由": "200",
            "职责": "350",
            "护甲": "200",
            "屏障": "650"
        },
        "技能": {
            "特斯拉炮": {
                "图标": "weapon",
                "绑定": ["主要攻击模式", "辅助攻击模式"]
            },
            "原始暴怒": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "喷射背包": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "屏障发射器": {
                "图标": "ability2",
                "绑定": ["技能2"]
            }
        }
    },

    "查莉娅": {
        "标签": ["规则事件玩家选项"],
        "提示": "查莉娅是世界上最强壮的女运动员之一。在战争期间，为了家人、朋友和祖国，毅然放弃了个人荣誉。",
        "路径": "images/ow/hero/tank/zarya/",
        "图标": "icon",
        "生命": {
            "自由": "100",
            "职责": "250",
            "护盾": "225"
        },
        "技能": {
            "粒子炮": {
                "图标": "weapon",
                "绑定": ["主要攻击模式", "辅助攻击模式"],
                "提示": "无法通过修改技能资源或“伤害”动作来调整粒子炮的能量值。"
            },
            "重力喷涌": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "粒子屏障": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "投射屏障": {
                "图标": "ability2",
                "绑定": ["技能2"]
            },
            "能量转换": {
                "图标": "passive",
                "绑定": ["被动"]
            }
        }
    },

    "禅雅塔": {
        "标签": ["规则事件玩家选项"],
        "提示": "禅雅塔是一位游走于世界寻找灵魂升华之道的机械僧侣。据说任何有幸遇到他的人，其生命轨迹也会发生改变。",
        "路径": "images/ow/hero/support/zenyatta/",
        "图标": "icon",
        "生命": {
            "自由": "50",
            "职责": "50",
            "护盾": "150"
        },
        "技能": {
            "灭": {
                "图标": "weapon",
                "绑定": ["主要攻击模式", "辅助攻击模式"]
            },
            "圣": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "谐": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "乱": {
                "图标": "ability2",
                "绑定": ["技能2"]
            },
            "蹬": {
                "图标": "passive",
                "绑定": ["近身攻击", "被动"],
                "提示": "近身攻击伤害提高50%，击退效果大幅提高。"
            }
        }
    },

    "拉玛刹": {
        "标签": ["规则事件玩家选项"],
        "提示": "拉玛刹有过很多身份：士兵、僧侣、革命者。如今身为“归零者”领袖的他为智械而战，不惜一切代价。",
        "路径": "images/ow/hero/tank/ramattra/",
        "图标": "icon",
        "生命": {
            "自由": "300",
            "职责": "450",
            "屏障": "1000"
        },
        "技能": {
            "虚空加速器": {
                "图标": "weapon1",
                "绑定": ["主要攻击模式"]
            },
            "猛拳": {
                "图标": "weapon2",
                "绑定": ["主要攻击模式"]
            },
            "虚空屏障": {
                "图标": "secondaryfire1",
                "绑定": ["辅助攻击模式"]
            },
            "铁臂": {
                "图标": "secondaryfire2",
                "绑定": ["辅助攻击模式"]
            },
            "诛": {
                "图标": "ultimate",
                "绑定": ["终极技能"]
            },
            "天罚形态": {
                "图标": "ability1",
                "绑定": ["技能1"]
            },
            "吞噬漩涡": {
                "图标": "ability2",
                "绑定": ["技能2"]
            }
        }
    }
}
